{
  "language": "en",
  "text": "As we get older and especially as we get to our mid and late 20s, it takes an immense amount of focus and energy in order to learn. But that focus and energy feels almost like an agitation, like it's something to back away from. But if we can learn to approach that and understand that that agitation is actually the circulation of chemicals, which is the brain and nervous system telling itself, aha, now I need to pay attention and change, we can start to actually modify the way that system works. How do you think our relationship with learning has been formed over time? I think it was the great physicist Max Delbruck who said that, you know, when teaching assume zero knowledge and infinite intelligence. I try and keep that in mind. I think that we are all innate learners by virtue of the fact that this thing, this nervous system as it's called, is really a map of our experience. The nervous system is there essentially to educate itself so that it can operate better in a given environment. And once one understands that, you start to realize that the forms of learning are many. So whether or not one learns better verbally or visually, or whether one has a propensity for math or for verbal subjects, what is true for all of us is that the brain is there always asking questions and trying to make predictions about its environment. And I think what happens is when we're children, we are learning passively all the time. As we get older, and especially as we get to our mid and late 20s,  It takes an immense amount of focus and energy in order to learn. But of course, the nervous system can still shape itself well into adulthood, almost certainly for the entire lifespan. But that focus and energy feels almost like an agitation. And I think that as children, we don't necessarily experience that agitation because we can, for better or for worse, we can experience and change passively. Neuroplasticity just happens by way of pure experience. As we get older, mid-20s, early 30s, and so on, that threshold of agitation for people feels like it's something to back away from but if we can learn to approach that and understand that that agitation is actually the circulation of chemicals which is the brain and nervous system telling itself aha now I need to pay attention and change we can start to actually modify the way that system works so that's a bit of a convoluted answer to your question but I think that at the heart of our nervous system is this ability and it's on all of us to understand that that bit of agitation and discomfort need not be interpreted as discomfort. That's the edge where learning is beginning. So confusion, being perplexed, feeling somewhat overwhelmed by the amount of information. That's actually the stir of chemicals that are cueing the nervous system to change because if it can do something easily, there's no reason for the nervous system to change. Now, in terms of different styles of teaching and learning, I think that many of us experience that agitation early on and we, for reasons that are understandable, we backed away from learning anymore. The agitation, the stress, the embarrassment is actually the cue to the nervous system that it's about to rewire itself. So I think if people just understood that, children and adults would lean into learning more regularly and hopefully with more ease overall. How can someone start thinking about how they should approach learning? Terrific question. And fortunately, nowadays we can look to studies done in humans that define some very key principles. The first principle is that the whole process of neuroplasticity and learning is really a two-stage process. First, there must be focus and alertness. That focus and alertness is associated with the release of neurochemicals, so-called neuromodulators, things like acetylcholine in particular, which sort of acts as a highlighter pen, if you will, for certain connections in the brain to later be reinforced. And the neurochemical adrenaline, which is also called epinephrine. Epinephrine is associated with an increase in kind of agitation and alertness. So you need alertness and focus. And then the second stage is that it is only during periods of deep rest, in particular sleep, and something that I call non-sleep deep rest, which I've given an acronym because scientists like acronyms, NSDR, non-sleep deep rest, things like yoga nidra, things like shallow naps, things like forms of meditation that don't involve a lot of focused concentration. It is only periods of intense focus and alertness followed by periods of deep rest that allow the nervous system to change. And there is an abundance of evidence for that. So that's the first thing to understand. The brain actually rewires during deep sleep and rest because during deep sleep and rest, naps, yoga nidra, deep sleep, there's a replay of the very same cells in the brain that were active during learning, oftentimes in reverse for reasons that are still not understood, but at a much higher repetition rate. So you're actually getting repetitions while you sleep. This is why one will strain to learn a language or a motor skill or maths or something like that over and over and over, it doesn't happen. You take a couple of nights sleep, take a break from and all of a sudden it's there. It's because it happens in rest. Now there's some other things that one can do to enhance this process further that are arrived to us from good data. First of all, there's a so-called ultradian rhythm, which is the 90 minute cycles during which we can focus pretty well for a duration of about 90 minutes. Of course, flickering in and out of focus. Nobody really focuses for 90 minutes straight unless they've built up that capacity or they are very interested in what they're learning, right? They're just wrapped with attention. Usually people flicker in and out. And of course nowadays there's a lot of literature and ideas about ways to maintain focus. Put the phone away, limit noise. Some people like background noise, some people like music, some don't. It's very contextual, highly individualized. But 90 minutes is sort of the batch of time that the brain can focus really hard on one thing before it needs a true rest of an hour or two before you can go back to learning or working very hard. The other thing is that there's some very interesting data showing that shallow naps or NSDR, non-sleep deep rest, done within four hours of one of these 90-minute learning bouts can be very beneficial for accelerating learning. And then there are these incredible data on so-called gap effects. So there have been studies now of skills that are physical skills, mental skills, where people will, for instance, try to learn scales on the piano or a math problem or a spatial problem or a physical skill. And then at random, every so often a buzzer will go off and the person will just be told to do nothing. Sit their eyes closed or eyes open and do nothing. Just stop the learning process for about 10 seconds and then return to doing what they're doing. These are these little micro rests. It turns out that during those micro rests, the hippocampus of brain areas, you know, that's associated with learning and memory and the neocortex also associated with learning and memory undergoes replay of the thing that the individual is trying to learn at 20 times the speed, also in reverse, just as in sleep. And that can lead and has been shown to lead to accelerations in learning. So whether or not you're a child or an adult, every so often when trying to learn something, just pause for 10 seconds or so, do your best to just clear your mind. Of course, it's very hard to clear the mind, but do your best to clear the mind and then go back to the learning task as it were. And that has been shown to significantly accelerate the learning process and the retention of newly learned information. And then the last thing, this notion of incremental learning. Turns out that from beautiful work done by my colleague at Stanford School of Medicine, Eric Knudsen, has shown that, yes, it's true that early in development, in humans, this would be up until the mid-20s, we can learn things in larger batches and much more easily than we can later in life. However, if one batches that work into smaller increments, so for instance, deciding maybe set a timer, turning the phone off otherwise, and saying, I'm going to spend three minutes,  just three minutes in trying to intensely learn this thing, even if I feel like I'm failing, if one does that repeatedly, those little increments of learning can lead to an outsized amount of learning overall. And so the nervous system loves incremental learning. It loves to batch things into focused little bouts. But if somebody is out there trying, you know, struggling to learn, really trying to break things down into very brief periods of intense focus, that is the cue by which during sleep, the nervous system will change itself. And this has been shown over and over and over again. Even in very late life, people in their 80s and 90s still have neuroplasticity. There's even evidence that new neurons can be produced in the hippocampus of people in their late 80s and 90s. So the capacity is there.",
  "chunks": [
    {
      "timestamp": [
        0.0,
        4.72
      ],
      "text": " As we get older and especially as we get to our mid and late 20s, it takes an immense amount of"
    },
    {
      "timestamp": [
        4.72,
        9.32
      ],
      "text": " focus and energy in order to learn. But that focus and energy feels almost like an agitation,"
    },
    {
      "timestamp": [
        9.62,
        13.92
      ],
      "text": " like it's something to back away from. But if we can learn to approach that and understand that"
    },
    {
      "timestamp": [
        13.92,
        18.3
      ],
      "text": " that agitation is actually the circulation of chemicals, which is the brain and nervous system"
    },
    {
      "timestamp": [
        18.3,
        23.88
      ],
      "text": " telling itself, aha, now I need to pay attention and change, we can start to actually modify the"
    },
    {
      "timestamp": [
        23.88,
        31.4
      ],
      "text": " way that system works. How do you think our relationship with learning has been formed over"
    },
    {
      "timestamp": [
        31.4,
        37.3
      ],
      "text": " time? I think it was the great physicist Max Delbruck who said that, you know, when teaching"
    },
    {
      "timestamp": [
        37.3,
        42.98
      ],
      "text": " assume zero knowledge and infinite intelligence. I try and keep that in mind. I think that we are"
    },
    {
      "timestamp": [
        42.98,
        47.42
      ],
      "text": " all innate learners by virtue of the fact that this thing, this nervous system as it's called,"
    },
    {
      "timestamp": [
        47.54,
        52.84
      ],
      "text": " is really a map of our experience. The nervous system is there essentially to educate itself"
    },
    {
      "timestamp": [
        52.84,
        55.06
      ],
      "text": " so that it can operate better in a given environment."
    },
    {
      "timestamp": [
        55.24,
        57.06
      ],
      "text": " And once one understands that,"
    },
    {
      "timestamp": [
        57.24,
        59.88
      ],
      "text": " you start to realize that the forms of learning are many."
    },
    {
      "timestamp": [
        60.02,
        62.9
      ],
      "text": " So whether or not one learns better verbally or visually,"
    },
    {
      "timestamp": [
        62.92,
        65.8
      ],
      "text": " or whether one has a propensity for math"
    },
    {
      "timestamp": [
        65.8,
        66.9
      ],
      "text": " or for verbal subjects,"
    },
    {
      "timestamp": [
        67.06,
        68.64
      ],
      "text": " what is true for all of us"
    },
    {
      "timestamp": [
        68.64,
        72.08
      ],
      "text": " is that the brain is there always asking questions"
    },
    {
      "timestamp": [
        72.08,
        74.04
      ],
      "text": " and trying to make predictions about its environment."
    },
    {
      "timestamp": [
        74.18,
        75.86
      ],
      "text": " And I think what happens is when we're children,"
    },
    {
      "timestamp": [
        76.04,
        78.3
      ],
      "text": " we are learning passively all the time."
    },
    {
      "timestamp": [
        78.52,
        79.52
      ],
      "text": " As we get older,"
    },
    {
      "timestamp": [
        79.58,
        81.76
      ],
      "text": " and especially as we get to our mid and late 20s,"
    },
    {
      "timestamp": [
        81.9,
        81.76
      ],
      "text": ""
    },
    {
      "timestamp": [
        84.76,
        85.24
      ],
      "text": " It takes an immense amount of focus and energy in order to learn."
    },
    {
      "timestamp": [
        89.0,
        90.06
      ],
      "text": " But of course, the nervous system can still shape itself well into adulthood, almost certainly for the entire lifespan."
    },
    {
      "timestamp": [
        90.6,
        93.66
      ],
      "text": " But that focus and energy feels almost like an agitation."
    },
    {
      "timestamp": [
        94.0,
        98.08
      ],
      "text": " And I think that as children, we don't necessarily experience that agitation because we can,"
    },
    {
      "timestamp": [
        98.44,
        101.0
      ],
      "text": " for better or for worse, we can experience and change passively."
    },
    {
      "timestamp": [
        101.26,
        103.52
      ],
      "text": " Neuroplasticity just happens by way of pure experience."
    },
    {
      "timestamp": [
        104.08,
        109.46
      ],
      "text": " As we get older, mid-20s, early 30s, and so on, that threshold of agitation for people"
    },
    {
      "timestamp": [
        109.46,
        114.7
      ],
      "text": " feels like it's something to back away from but if we can learn to approach that and understand"
    },
    {
      "timestamp": [
        114.7,
        119.36
      ],
      "text": " that that agitation is actually the circulation of chemicals which is the brain and nervous system"
    },
    {
      "timestamp": [
        119.36,
        125.22
      ],
      "text": " telling itself aha now I need to pay attention and change we can start to actually modify the"
    },
    {
      "timestamp": [
        125.22,
        128.82
      ],
      "text": " way that system works so that's a bit of a convoluted answer to your question but I think"
    },
    {
      "timestamp": [
        128.82,
        134.34
      ],
      "text": " that at the heart of our nervous system is this ability and it's on all of us to understand that"
    },
    {
      "timestamp": [
        134.34,
        136.5
      ],
      "text": " that bit of agitation and discomfort"
    },
    {
      "timestamp": [
        136.5,
        139.0
      ],
      "text": " need not be interpreted as discomfort."
    },
    {
      "timestamp": [
        139.0,
        142.04
      ],
      "text": " That's the edge where learning is beginning."
    },
    {
      "timestamp": [
        142.04,
        144.92
      ],
      "text": " So confusion, being perplexed,"
    },
    {
      "timestamp": [
        144.92,
        147.42
      ],
      "text": " feeling somewhat overwhelmed by the amount of information."
    },
    {
      "timestamp": [
        147.42,
        149.32
      ],
      "text": " That's actually the stir of chemicals"
    },
    {
      "timestamp": [
        149.32,
        150.84
      ],
      "text": " that are cueing the nervous system to change"
    },
    {
      "timestamp": [
        150.84,
        152.88
      ],
      "text": " because if it can do something easily,"
    },
    {
      "timestamp": [
        152.88,
        154.78
      ],
      "text": " there's no reason for the nervous system to change."
    },
    {
      "timestamp": [
        154.78,
        157.28
      ],
      "text": " Now, in terms of different styles of teaching and learning,"
    },
    {
      "timestamp": [
        157.28,
        161.1
      ],
      "text": " I think that many of us experience that agitation early on"
    },
    {
      "timestamp": [
        161.1,
        163.86
      ],
      "text": " and we, for reasons that are understandable,"
    },
    {
      "timestamp": [
        163.86,
        165.92
      ],
      "text": " we backed away from learning anymore."
    },
    {
      "timestamp": [
        165.92,
        168.52
      ],
      "text": " The agitation, the stress, the embarrassment"
    },
    {
      "timestamp": [
        168.52,
        170.48
      ],
      "text": " is actually the cue to the nervous system"
    },
    {
      "timestamp": [
        170.48,
        172.48
      ],
      "text": " that it's about to rewire itself."
    },
    {
      "timestamp": [
        172.48,
        174.12
      ],
      "text": " So I think if people just understood that,"
    },
    {
      "timestamp": [
        174.12,
        177.44
      ],
      "text": " children and adults would lean into learning more regularly"
    },
    {
      "timestamp": [
        177.44,
        179.66
      ],
      "text": " and hopefully with more ease overall."
    },
    {
      "timestamp": [
        179.66,
        181.4
      ],
      "text": " How can someone start thinking about"
    },
    {
      "timestamp": [
        181.4,
        183.12
      ],
      "text": " how they should approach learning?"
    },
    {
      "timestamp": [
        183.12,
        184.1
      ],
      "text": " Terrific question."
    },
    {
      "timestamp": [
        184.1,
        186.7
      ],
      "text": " And fortunately, nowadays we can look to studies done"
    },
    {
      "timestamp": [
        186.7,
        189.82
      ],
      "text": " in humans that define some very key principles."
    },
    {
      "timestamp": [
        189.82,
        192.18
      ],
      "text": " The first principle is that the whole process"
    },
    {
      "timestamp": [
        192.18,
        194.08
      ],
      "text": " of neuroplasticity and learning"
    },
    {
      "timestamp": [
        194.08,
        196.06
      ],
      "text": " is really a two-stage process."
    },
    {
      "timestamp": [
        196.06,
        199.56
      ],
      "text": " First, there must be focus and alertness."
    },
    {
      "timestamp": [
        199.56,
        201.62
      ],
      "text": " That focus and alertness is associated"
    },
    {
      "timestamp": [
        201.62,
        203.74
      ],
      "text": " with the release of neurochemicals,"
    },
    {
      "timestamp": [
        203.74,
        204.82
      ],
      "text": " so-called neuromodulators,"
    },
    {
      "timestamp": [
        204.82,
        206.72
      ],
      "text": " things like acetylcholine in particular,"
    },
    {
      "timestamp": [
        206.72,
        209.16
      ],
      "text": " which sort of acts as a highlighter pen, if you will,"
    },
    {
      "timestamp": [
        209.16,
        213.3
      ],
      "text": " for certain connections in the brain to later be reinforced."
    },
    {
      "timestamp": [
        213.3,
        215.66
      ],
      "text": " And the neurochemical adrenaline,"
    },
    {
      "timestamp": [
        215.66,
        217.14
      ],
      "text": " which is also called epinephrine."
    },
    {
      "timestamp": [
        217.14,
        219.02
      ],
      "text": " Epinephrine is associated with an increase"
    },
    {
      "timestamp": [
        219.02,
        220.6
      ],
      "text": " in kind of agitation and alertness."
    },
    {
      "timestamp": [
        220.6,
        222.16
      ],
      "text": " So you need alertness and focus."
    },
    {
      "timestamp": [
        222.16,
        224.76
      ],
      "text": " And then the second stage is that it is only"
    },
    {
      "timestamp": [
        224.76,
        227.42
      ],
      "text": " during periods of deep rest, in particular sleep,"
    },
    {
      "timestamp": [
        227.42,
        230.0
      ],
      "text": " and something that I call non-sleep deep rest,"
    },
    {
      "timestamp": [
        230.0,
        231.04
      ],
      "text": " which I've given an acronym"
    },
    {
      "timestamp": [
        231.04,
        234.08
      ],
      "text": " because scientists like acronyms, NSDR, non-sleep deep rest,"
    },
    {
      "timestamp": [
        234.08,
        236.86
      ],
      "text": " things like yoga nidra, things like shallow naps,"
    },
    {
      "timestamp": [
        236.86,
        238.36
      ],
      "text": " things like forms of meditation"
    },
    {
      "timestamp": [
        238.36,
        241.56
      ],
      "text": " that don't involve a lot of focused concentration."
    },
    {
      "timestamp": [
        241.56,
        245.18
      ],
      "text": " It is only periods of intense focus and alertness"
    },
    {
      "timestamp": [
        245.18,
        247.1
      ],
      "text": " followed by periods of deep rest"
    },
    {
      "timestamp": [
        247.1,
        248.72
      ],
      "text": " that allow the nervous system to change."
    },
    {
      "timestamp": [
        248.72,
        250.68
      ],
      "text": " And there is an abundance of evidence for that."
    },
    {
      "timestamp": [
        250.68,
        252.02
      ],
      "text": " So that's the first thing to understand."
    },
    {
      "timestamp": [
        252.02,
        255.14
      ],
      "text": " The brain actually rewires during deep sleep and rest"
    },
    {
      "timestamp": [
        255.14,
        257.2
      ],
      "text": " because during deep sleep and rest,"
    },
    {
      "timestamp": [
        257.2,
        259.66
      ],
      "text": " naps, yoga nidra, deep sleep,"
    },
    {
      "timestamp": [
        259.66,
        262.68
      ],
      "text": " there's a replay of the very same cells in the brain"
    },
    {
      "timestamp": [
        262.68,
        264.04
      ],
      "text": " that were active during learning,"
    },
    {
      "timestamp": [
        264.04,
        265.98
      ],
      "text": " oftentimes in reverse for reasons"
    },
    {
      "timestamp": [
        265.98,
        267.32
      ],
      "text": " that are still not understood,"
    },
    {
      "timestamp": [
        267.32,
        269.94
      ],
      "text": " but at a much higher repetition rate."
    },
    {
      "timestamp": [
        269.94,
        272.46
      ],
      "text": " So you're actually getting repetitions while you sleep."
    },
    {
      "timestamp": [
        272.46,
        275.0
      ],
      "text": " This is why one will strain to learn a language"
    },
    {
      "timestamp": [
        275.0,
        277.72
      ],
      "text": " or a motor skill or maths or something like that"
    },
    {
      "timestamp": [
        277.72,
        279.24
      ],
      "text": " over and over and over, it doesn't happen."
    },
    {
      "timestamp": [
        279.24,
        281.04
      ],
      "text": " You take a couple of nights sleep,"
    },
    {
      "timestamp": [
        281.04,
        283.22
      ],
      "text": " take a break from and all of a sudden it's there."
    },
    {
      "timestamp": [
        283.22,
        284.98
      ],
      "text": " It's because it happens in rest."
    },
    {
      "timestamp": [
        284.98,
        286.88
      ],
      "text": " Now there's some other things that one can do"
    },
    {
      "timestamp": [
        286.88,
        288.56
      ],
      "text": " to enhance this process further"
    },
    {
      "timestamp": [
        288.56,
        291.42
      ],
      "text": " that are arrived to us from good data."
    },
    {
      "timestamp": [
        291.42,
        293.78
      ],
      "text": " First of all, there's a so-called ultradian rhythm,"
    },
    {
      "timestamp": [
        293.78,
        296.12
      ],
      "text": " which is the 90 minute cycles during which"
    },
    {
      "timestamp": [
        296.12,
        299.94
      ],
      "text": " we can focus pretty well for a duration of about 90 minutes."
    },
    {
      "timestamp": [
        299.94,
        301.84
      ],
      "text": " Of course, flickering in and out of focus."
    },
    {
      "timestamp": [
        301.84,
        303.9
      ],
      "text": " Nobody really focuses for 90 minutes straight"
    },
    {
      "timestamp": [
        303.9,
        305.54
      ],
      "text": " unless they've built up that capacity"
    },
    {
      "timestamp": [
        305.54,
        308.84
      ],
      "text": " or they are very interested in what they're learning, right?"
    },
    {
      "timestamp": [
        308.84,
        310.54
      ],
      "text": " They're just wrapped with attention."
    },
    {
      "timestamp": [
        310.54,
        312.68
      ],
      "text": " Usually people flicker in and out."
    },
    {
      "timestamp": [
        312.68,
        314.96
      ],
      "text": " And of course nowadays there's a lot of literature and ideas"
    },
    {
      "timestamp": [
        314.96,
        316.06
      ],
      "text": " about ways to maintain focus."
    },
    {
      "timestamp": [
        316.06,
        318.44
      ],
      "text": " Put the phone away, limit noise."
    },
    {
      "timestamp": [
        318.44,
        319.6
      ],
      "text": " Some people like background noise,"
    },
    {
      "timestamp": [
        319.6,
        320.82
      ],
      "text": " some people like music, some don't."
    },
    {
      "timestamp": [
        320.82,
        324.1
      ],
      "text": " It's very contextual, highly individualized."
    },
    {
      "timestamp": [
        324.1,
        327.86
      ],
      "text": " But 90 minutes is sort of the batch of time"
    },
    {
      "timestamp": [
        327.86,
        330.24
      ],
      "text": " that the brain can focus really hard on one thing"
    },
    {
      "timestamp": [
        330.24,
        333.12
      ],
      "text": " before it needs a true rest of an hour or two"
    },
    {
      "timestamp": [
        333.12,
        334.6
      ],
      "text": " before you can go back to learning"
    },
    {
      "timestamp": [
        334.6,
        336.44
      ],
      "text": " or working very hard."
    },
    {
      "timestamp": [
        336.44,
        339.6
      ],
      "text": " The other thing is that there's some very interesting data"
    },
    {
      "timestamp": [
        339.6,
        343.52
      ],
      "text": " showing that shallow naps or NSDR, non-sleep deep rest,"
    },
    {
      "timestamp": [
        343.52,
        344.66
      ],
      "text": " done within four hours"
    },
    {
      "timestamp": [
        344.66,
        346.18
      ],
      "text": " of one of these 90-minute learning bouts"
    },
    {
      "timestamp": [
        346.18,
        348.66
      ],
      "text": " can be very beneficial for accelerating learning."
    },
    {
      "timestamp": [
        348.66,
        351.54
      ],
      "text": " And then there are these incredible data"
    },
    {
      "timestamp": [
        351.54,
        353.32
      ],
      "text": " on so-called gap effects."
    },
    {
      "timestamp": [
        353.32,
        355.48
      ],
      "text": " So there have been studies now of skills"
    },
    {
      "timestamp": [
        355.48,
        357.02
      ],
      "text": " that are physical skills, mental skills,"
    },
    {
      "timestamp": [
        357.02,
        357.98
      ],
      "text": " where people will, for instance,"
    },
    {
      "timestamp": [
        357.98,
        360.96
      ],
      "text": " try to learn scales on the piano or a math problem"
    },
    {
      "timestamp": [
        360.96,
        363.4
      ],
      "text": " or a spatial problem or a physical skill."
    },
    {
      "timestamp": [
        363.4,
        368.32
      ],
      "text": " And then at random, every so often a buzzer will go off"
    },
    {
      "timestamp": [
        368.32,
        370.74
      ],
      "text": " and the person will just be told to do nothing."
    },
    {
      "timestamp": [
        370.74,
        372.94
      ],
      "text": " Sit their eyes closed or eyes open and do nothing."
    },
    {
      "timestamp": [
        372.94,
        375.5
      ],
      "text": " Just stop the learning process for about 10 seconds"
    },
    {
      "timestamp": [
        375.5,
        376.96
      ],
      "text": " and then return to doing what they're doing."
    },
    {
      "timestamp": [
        376.96,
        378.82
      ],
      "text": " These are these little micro rests."
    },
    {
      "timestamp": [
        378.82,
        380.84
      ],
      "text": " It turns out that during those micro rests,"
    },
    {
      "timestamp": [
        380.84,
        382.6
      ],
      "text": " the hippocampus of brain areas, you know,"
    },
    {
      "timestamp": [
        382.6,
        383.86
      ],
      "text": " that's associated with learning and memory"
    },
    {
      "timestamp": [
        383.86,
        387.46
      ],
      "text": " and the neocortex also associated with learning and memory"
    },
    {
      "timestamp": [
        387.46,
        389.54
      ],
      "text": " undergoes replay of the thing"
    },
    {
      "timestamp": [
        389.54,
        391.52
      ],
      "text": " that the individual is trying to learn"
    },
    {
      "timestamp": [
        391.52,
        395.84
      ],
      "text": " at 20 times the speed, also in reverse, just as in sleep."
    },
    {
      "timestamp": [
        395.84,
        398.58
      ],
      "text": " And that can lead and has been shown to lead"
    },
    {
      "timestamp": [
        398.58,
        399.98
      ],
      "text": " to accelerations in learning."
    },
    {
      "timestamp": [
        399.98,
        401.84
      ],
      "text": " So whether or not you're a child or an adult,"
    },
    {
      "timestamp": [
        401.84,
        403.8
      ],
      "text": " every so often when trying to learn something,"
    },
    {
      "timestamp": [
        403.8,
        405.9
      ],
      "text": " just pause for 10 seconds or so,"
    },
    {
      "timestamp": [
        405.9,
        407.88
      ],
      "text": " do your best to just clear your mind."
    },
    {
      "timestamp": [
        407.88,
        409.52
      ],
      "text": " Of course, it's very hard to clear the mind,"
    },
    {
      "timestamp": [
        409.52,
        411.74
      ],
      "text": " but do your best to clear the mind"
    },
    {
      "timestamp": [
        411.74,
        414.74
      ],
      "text": " and then go back to the learning task as it were."
    },
    {
      "timestamp": [
        414.74,
        418.02
      ],
      "text": " And that has been shown to significantly accelerate"
    },
    {
      "timestamp": [
        418.02,
        418.88
      ],
      "text": " the learning process"
    },
    {
      "timestamp": [
        418.88,
        420.86
      ],
      "text": " and the retention of newly learned information."
    },
    {
      "timestamp": [
        420.86,
        423.28
      ],
      "text": " And then the last thing, this notion of incremental learning."
    },
    {
      "timestamp": [
        423.28,
        426.96
      ],
      "text": " Turns out that from beautiful work done by my colleague at Stanford School of Medicine,"
    },
    {
      "timestamp": [
        427.08,
        432.06
      ],
      "text": " Eric Knudsen, has shown that, yes, it's true that early in development, in humans, this"
    },
    {
      "timestamp": [
        432.06,
        437.44
      ],
      "text": " would be up until the mid-20s, we can learn things in larger batches and much more easily"
    },
    {
      "timestamp": [
        437.44,
        438.64
      ],
      "text": " than we can later in life."
    },
    {
      "timestamp": [
        438.8,
        444.08
      ],
      "text": " However, if one batches that work into smaller increments, so for instance, deciding maybe"
    },
    {
      "timestamp": [
        444.08,
        447.82
      ],
      "text": " set a timer, turning the phone off otherwise, and saying, I'm going to spend three minutes,"
    },
    {
      "timestamp": [
        447.9,
        447.82
      ],
      "text": ""
    },
    {
      "timestamp": [
        452.28,
        452.58
      ],
      "text": " just three minutes in trying to intensely learn this thing, even if I feel like I'm failing,"
    },
    {
      "timestamp": [
        457.48,
        462.72
      ],
      "text": " if one does that repeatedly, those little increments of learning can lead to an outsized amount of learning overall. And so the nervous system loves incremental learning. It loves to"
    },
    {
      "timestamp": [
        462.72,
        467.2
      ],
      "text": " batch things into focused little bouts. But if somebody is out there trying, you know, struggling"
    },
    {
      "timestamp": [
        467.2,
        472.1
      ],
      "text": " to learn, really trying to break things down into very brief periods of intense focus, that is the"
    },
    {
      "timestamp": [
        472.1,
        476.76
      ],
      "text": " cue by which during sleep, the nervous system will change itself. And this has been shown over and"
    },
    {
      "timestamp": [
        476.76,
        483.12
      ],
      "text": " over and over again. Even in very late life, people in their 80s and 90s still have neuroplasticity."
    },
    {
      "timestamp": [
        483.12,
        487.16
      ],
      "text": " There's even evidence that new neurons can be produced in the hippocampus of people"
    },
    {
      "timestamp": [
        487.16,
        490.66
      ],
      "text": " in their late 80s and 90s. So the capacity is there."
    }
  ]
}