{
  "language": "en",
  "text": "Imagine this, you sit down to work, and two hours later you look up, and you've finished a task that would have taken you two days before. No distractions, no procrastination, no, let me just check Instagram real quick. You didn't use motivation, you didn't use willpower, you used something better. This is how to be so productive it feels illegal, even if your brain runs on Wi-Fi signals from another planet. Stop trying to be disciplined, design instead. People say, bro, you just need to be more disciplined. Me. Discipline? I can't even discipline my sleep schedule and you want me to build an empire? Here's the truth. Productivity isn't about brute force. It's about building invisible systems that force your lazy self to win. A legal hack. Number one, make your phone boring. Want to go God mode? Turn your phone into a brick. Remove every app that doesn't pay your bills or teach you something. Put social media in a folder called Distraction Prison. Set screen time limits like you're your own strict mom. Black and white screen mode? Highly illegal. Why it works? Because you don't rise to the level of your motivation. You fall to the level of your environmental design. Start your day like a boss. Most people wake up like, ugh, where's my phone? What day is it? Oh no, a pigeon meme. Brother, you just lost the day before it even started. Illegal hack. Number two, wake and win routine. Here's how to hit productivity before breakfast. No phone for the first 30 minutes. Drink water like you're trying to flood a desert. Five-minute movement, stretch, walk, or shadow box your problems. Write three things you're gonna destroy today. This tells your brain, we are not surviving today we are winning master the three-hour deep work block this is where real productivity lives not in multitasking not in checking emails 67 times not in fake busy vibes illegal hack number three block lock execute choose one task set a 90-minute timer put on headphones social do not disturb sign? Do nothing else. After 90 minutes, walk, hydrate, celebrate, repeat. It's like entering the matrix, but instead of dodging bullets, you're dodging distractions. Focus triggers equals brain cheat codes. Want to become unstoppable? Train your brain like Pavlov's dog, but instead of drooling for food, you lock into focus mode. Illegal hack number four,  set triggers. Same chair, same playlist, no lyrics, deep beats. Same hoodie, yes, the productivity hoodie is real. Light a candle, smash a Red Bull, whatever signals go time. Do this enough and your brain will autopilot into flow, no motivation needed, like muscle memory for work. Gamify or die. Your brain loves games, points, streaks, levels, rewards. So let's use that addictive energy for good. Illegal hack number five. Build a daily streak tracker. Every productive block equals one point. Hit five points equals reward. Miss a day equals reset. Use a whiteboard, notion, an app, whatever. Just see your progress. Because boredom doesn't kill productivity.  Lack of visible progress does The productivity paradox Here's the biggest truth bomb You don't need more time, you need more energy Illegal hack 6. Prioritize your energy like a CEO Protect your sleep like it's your crypto wallet Move your body daily, even 10 minutes equals upgrade mode Dump your brain every night, journaling, therapy sometimes Eat clean-ish equals think clean-ish Energy is the hidden fuel behind every to-do list. No energy quals, no focus. No focus equals no results. No results equals sadness plus doom scroll spiral. Quit multitasking. It's fake. Multitasking is just a fancy word for let me suck at five things at once. Illegal hack number seven, theme your days. Monday equals study only. Tuesday equals right stuff. Wednesday equals edit mode. Friday equals chill or catch up. It removes decision fatigue. You're not asking, what do I feel like doing? You already know what today is for. That's how bosses move. Final message, you are not lazy. You're just unarmed. If you feel unmotivated, scattered, tired, it's not because you're broken. You've just been using tools that aren't designed for how your brain works. But now you've got the cheat codes. And if you actually use them, you'll scare people with how productive you are. If you want a free productivity toolkit template I use to plan my illegal focus days, drop a brain emoji in the comments or DM me focus mode on Instagram. And if you want to study faster than a Harvard student,  click this video right here. It'll feel like you're cheating at life, legally.",
  "chunks": [
    {
      "timestamp": [
        0.0,
        7.4
      ],
      "text": " Imagine this, you sit down to work, and two hours later you look up, and you've finished a task that would have taken you two days before."
    },
    {
      "timestamp": [
        8.06,
        14.04
      ],
      "text": " No distractions, no procrastination, no, let me just check Instagram real quick."
    },
    {
      "timestamp": [
        14.82,
        18.76
      ],
      "text": " You didn't use motivation, you didn't use willpower, you used something better."
    },
    {
      "timestamp": [
        19.54,
        25.9
      ],
      "text": " This is how to be so productive it feels illegal, even if your brain runs on Wi-Fi signals from another planet."
    },
    {
      "timestamp": [
        26.5,
        29.36
      ],
      "text": " Stop trying to be disciplined, design instead."
    },
    {
      "timestamp": [
        30.0,
        36.1
      ],
      "text": " People say, bro, you just need to be more disciplined. Me. Discipline? I can't even"
    },
    {
      "timestamp": [
        36.1,
        41.36
      ],
      "text": " discipline my sleep schedule and you want me to build an empire? Here's the truth. Productivity"
    },
    {
      "timestamp": [
        41.36,
        46.64
      ],
      "text": " isn't about brute force. It's about building invisible systems that force your lazy self to"
    },
    {
      "timestamp": [
        46.64,
        54.04
      ],
      "text": " win. A legal hack. Number one, make your phone boring. Want to go God mode? Turn your phone into"
    },
    {
      "timestamp": [
        54.04,
        59.94
      ],
      "text": " a brick. Remove every app that doesn't pay your bills or teach you something. Put social media"
    },
    {
      "timestamp": [
        59.94,
        65.72
      ],
      "text": " in a folder called Distraction Prison. Set screen time limits like you're your own strict mom."
    },
    {
      "timestamp": [
        66.6,
        72.78
      ],
      "text": " Black and white screen mode? Highly illegal. Why it works? Because you don't rise to the level of"
    },
    {
      "timestamp": [
        72.78,
        78.74
      ],
      "text": " your motivation. You fall to the level of your environmental design. Start your day like a boss."
    },
    {
      "timestamp": [
        79.72,
        85.58
      ],
      "text": " Most people wake up like, ugh, where's my phone? What day is it? Oh no, a pigeon meme. Brother,"
    },
    {
      "timestamp": [
        85.58,
        92.68
      ],
      "text": " you just lost the day before it even started. Illegal hack. Number two, wake and win routine."
    },
    {
      "timestamp": [
        93.7,
        99.72
      ],
      "text": " Here's how to hit productivity before breakfast. No phone for the first 30 minutes. Drink water"
    },
    {
      "timestamp": [
        99.72,
        105.0
      ],
      "text": " like you're trying to flood a desert. Five-minute movement, stretch, walk, or shadow box your"
    },
    {
      "timestamp": [
        105.0,
        111.84
      ],
      "text": " problems. Write three things you're gonna destroy today. This tells your brain, we are not surviving"
    },
    {
      "timestamp": [
        111.84,
        119.1
      ],
      "text": " today we are winning master the three-hour deep work block this is where real productivity lives"
    },
    {
      "timestamp": [
        119.1,
        128.06
      ],
      "text": " not in multitasking not in checking emails 67 times not in fake busy vibes illegal hack number"
    },
    {
      "timestamp": [
        128.06,
        138.2
      ],
      "text": " three block lock execute choose one task set a 90-minute timer put on headphones social do not"
    },
    {
      "timestamp": [
        138.2,
        146.3
      ],
      "text": " disturb sign? Do nothing else. After 90 minutes, walk, hydrate, celebrate, repeat. It's like"
    },
    {
      "timestamp": [
        146.3,
        151.4
      ],
      "text": " entering the matrix, but instead of dodging bullets, you're dodging distractions. Focus"
    },
    {
      "timestamp": [
        151.4,
        158.02
      ],
      "text": " triggers equals brain cheat codes. Want to become unstoppable? Train your brain like Pavlov's dog,"
    },
    {
      "timestamp": [
        158.02,
        163.78
      ],
      "text": " but instead of drooling for food, you lock into focus mode. Illegal hack number four,"
    },
    {
      "timestamp": [
        164.12,
        163.78
      ],
      "text": ""
    },
    {
      "timestamp": [
        172.44,
        180.04
      ],
      "text": " set triggers. Same chair, same playlist, no lyrics, deep beats. Same hoodie, yes, the productivity hoodie is real. Light a candle, smash a Red Bull, whatever signals go time. Do this enough and your"
    },
    {
      "timestamp": [
        180.04,
        187.32
      ],
      "text": " brain will autopilot into flow, no motivation needed, like muscle memory for work. Gamify or"
    },
    {
      "timestamp": [
        187.32,
        194.86
      ],
      "text": " die. Your brain loves games, points, streaks, levels, rewards. So let's use that addictive"
    },
    {
      "timestamp": [
        194.86,
        202.4
      ],
      "text": " energy for good. Illegal hack number five. Build a daily streak tracker. Every productive block"
    },
    {
      "timestamp": [
        202.4,
        209.98
      ],
      "text": " equals one point. Hit five points equals reward. Miss a day equals reset. Use a whiteboard,"
    },
    {
      "timestamp": [
        210.26,
        216.26
      ],
      "text": " notion, an app, whatever. Just see your progress. Because boredom doesn't kill productivity."
    },
    {
      "timestamp": [
        217.12,
        216.26
      ],
      "text": ""
    },
    {
      "timestamp": [
        218.88,
        221.3
      ],
      "text": " Lack of visible progress does The productivity paradox"
    },
    {
      "timestamp": [
        221.3,
        223.42
      ],
      "text": " Here's the biggest truth bomb"
    },
    {
      "timestamp": [
        223.42,
        226.04
      ],
      "text": " You don't need more time, you need more energy"
    },
    {
      "timestamp": [
        226.04,
        227.82
      ],
      "text": " Illegal hack"
    },
    {
      "timestamp": [
        227.82,
        230.64
      ],
      "text": " 6. Prioritize your energy like a CEO"
    },
    {
      "timestamp": [
        230.64,
        233.88
      ],
      "text": " Protect your sleep like it's your crypto wallet"
    },
    {
      "timestamp": [
        233.88,
        237.56
      ],
      "text": " Move your body daily, even 10 minutes equals upgrade mode"
    },
    {
      "timestamp": [
        237.56,
        241.54
      ],
      "text": " Dump your brain every night, journaling, therapy sometimes"
    },
    {
      "timestamp": [
        241.54,
        244.38
      ],
      "text": " Eat clean-ish equals think clean-ish"
    },
    {
      "timestamp": [
        244.38,
        251.84
      ],
      "text": " Energy is the hidden fuel behind every to-do list. No energy quals, no focus. No focus equals no"
    },
    {
      "timestamp": [
        251.84,
        259.24
      ],
      "text": " results. No results equals sadness plus doom scroll spiral. Quit multitasking. It's fake."
    },
    {
      "timestamp": [
        260.3,
        266.52
      ],
      "text": " Multitasking is just a fancy word for let me suck at five things at once. Illegal hack number seven,"
    },
    {
      "timestamp": [
        266.52,
        274.06
      ],
      "text": " theme your days. Monday equals study only. Tuesday equals right stuff. Wednesday equals"
    },
    {
      "timestamp": [
        274.06,
        281.56
      ],
      "text": " edit mode. Friday equals chill or catch up. It removes decision fatigue. You're not asking,"
    },
    {
      "timestamp": [
        281.82,
        287.12
      ],
      "text": " what do I feel like doing? You already know what today is for. That's how bosses move."
    },
    {
      "timestamp": [
        288.04,
        293.9
      ],
      "text": " Final message, you are not lazy. You're just unarmed. If you feel unmotivated, scattered,"
    },
    {
      "timestamp": [
        293.9,
        299.2
      ],
      "text": " tired, it's not because you're broken. You've just been using tools that aren't designed for"
    },
    {
      "timestamp": [
        299.2,
        304.46
      ],
      "text": " how your brain works. But now you've got the cheat codes. And if you actually use them,"
    },
    {
      "timestamp": [
        304.88,
        310.94
      ],
      "text": " you'll scare people with how productive you are. If you want a free productivity toolkit template"
    },
    {
      "timestamp": [
        310.94,
        316.92
      ],
      "text": " I use to plan my illegal focus days, drop a brain emoji in the comments or DM me"
    },
    {
      "timestamp": [
        316.92,
        322.1
      ],
      "text": " focus mode on Instagram. And if you want to study faster than a Harvard student,"
    },
    {
      "timestamp": [
        322.22,
        322.1
      ],
      "text": ""
    },
    {
      "timestamp": [
        326.52,
        null
      ],
      "text": " click this video right here. It'll feel like you're cheating at life, legally."
    }
  ]
}