{
  "language": "en",
  "text": "Today we are discussing how to study and learn, that is, what the scientific data say is the best way to study in order to remember information and to be able to use that information effectively in different areas of your life. Most of what we believe about the best ways to study are absolutely false. Fortunately, today you will learn the best ways to study. Now let's talk about how the best students structure their days. There's a really nice paper, in fact, that surveyed close to 700 students, these were medical students, approximately equal number of male and female students, and analyzed the most useful learning habits. There are at least 10 study habits that the highly effective students use. I'm going to focus on the top five or six because it turns out that most of the effect, it appears, of being a better student can be attributed to these top five or six habits.  First of all, they set aside time to study. They literally schedule time to study. Now, this probably serves several roles. The first one is that they are able to clear out other distractions. And in fact, that's the second thing that they do. They are very effective where they make it a point of putting their phone away and off, of isolating themselves. That's right. They're not studying with other people. They study alone. They put their phone away. They tell their friends and families that they are not going to be able to be reached during that time. Yes, they study for three or four hours per day, but they break that up into a couple of different sessions typically, two or three sessions. So they're not doing a three or four hour studying about all in one shot. So they're managing their time. They're eliminating distractions. That is sure to help them anchor their focus and attention. They know that they're going to need to use their focus and attention during that time. Scheduling time where you know you're going to need to be focused and attending is perhaps one of the most important things toward being able to focus and attend to the material. To the extent that you have any control over the time in which you're going to study, keeping that at a regular time or times, perhaps one block early in the day, one block later in the day, perhaps two blocks early in the day, and so on, is going to be beneficial. It turns out that's also supported by the research literature. If you regularly, meaning for the course of about three days, make it a point to focus and study at particular times, again, pulling your attention back, it's not an automatic process, but pulling your attention back to a specific location, perhaps on a page or that you're listening to in a lecture, your body and brain will start to entrain to that rhythm such that you will be able to focus and attend better simply by virtue of the regularity of the timing of the exposure to the material. Okay. So you probably need about two or three days to break into a regular schedule of focusing and attending and studying at a given time, allow yourself that transition period, but then make it a point to schedule those times to study, set aside your phone, tell people you're going offline, turn off the wifi if you need to or have to. You may need it for your studying. I don't know, depends on what you're studying, but limit distractions at all costs and learn to just focus on the material. And this is a skill. This is the most important thing to understand. It's a skill to be able to focus and study. And it's a skill that you can learn very quickly, especially if you schedule it for regular times and you give yourself two or three days in which to adapt to those schedules and times and then try and stick to them as regularly as possible. Perhaps even on the weekends, if you're approaching the end of the quarter or semester, keeping those regular times will entrain your nervous system to study and learn at its best at those particular times. If ever there was a strongly research-supported tool in the literature, in the peer-reviewed literature about how students can learn information better, it's testing.  I know, I know, I know we think of tests as a way to evaluate our knowledge, but it turns out that testing is one of the best ways to build our knowledge, to retain our knowledge, and again, to offset forgetting. The study of testing as a learning tool, not just as a way to evaluate how much information we've learned, goes back over a hundred years. There's a classic study that was done in 1917 where grade school aged children read biographies. So they read biographies and then the kids were divided into different groups. One group read and reread and reread those biographies over and over. Another group read the biographies once and then were tested on those biographies. But get this, they tested themselves on those biographies simply by having to think about the information that they had read and trying to remember the information. Like, what was the biography? Who was the person? Who were they married to? What did they do? When did they go to school? What did they do in school? What did they do in the world? What role did they play in life? So they essentially tested their own knowledge simply by going into their own head and asking themselves what they could remember about those biographies. Now, keep in mind here that even though it's fairly apparent that reading a biography two, three, four times might seem more passive than testing oneself on a biography that they had read just once, right? You could imagine that thinking about the biography involves more effort, and indeed it does. But keep in mind also that kids in the second group were only exposed to the biography once. And yet, when you look at the percent of accurate recall of information from those biographies, the children that read the biography once and then made a deliberate point to think about that biography in their own mind to effectively test themselves on that material just within their heads over and over, vastly outperformed the kids that read the biographies over and over. Put differently, reading and rereading material and rereading material is far less effective than reading material and then thinking about that material, testing yourself on that material, forcing yourself to bring that material to mind in your own mind. And this is not just for sake of remembering more volume of material, but also accuracy of recall of that material. The more times you test yourself or that you are tested on material,  the better your retention of that material. Now, some people will immediately say, well, goodness, what if I learned it and then I'm tested and I'm somehow consolidating the wrong or inaccurate material, but it doesn't appear to be the case. As long as you learn what the correct answers to the tests are, even if you're getting, you know, 40 or 50% or less accurate on those tests that you take immediately after the studying period, that's still going to be a better strategy than rereading the material, which ought to be somewhat surprising. It certainly was surprising to me,  But you know what's even more surprising and a little scary and that we all should know and I wish I had learned when I was like in the second grade is that if you ask students how confident are you in the material that you just learned the students who studied the material that is who were exposed to the material four times think that they are going to perform best on the ultimate exam. However, the students that study the material once and then are tested three times on that material, they think that ultimately they're going to perform least well. And guess what? The exact opposite is true. Put differently, when you're exposed to material over and over and over again, you think you've learned the material. In fact, your confidence that you've learned the material increases with each subsequent exposure to the material. But actually, you haven't learned it at all compared to the people that are exposed to of the material and then take tests on the material, oftentimes straining to get the answers right on those tests. In fact, sometimes getting those answers dead wrong and then realizing they get those answers dead wrong or sometimes they just sense it. But guess what? Testing yourself once, twice, maybe three times prior to the ultimate test of your knowledge of that material is far and away the best way to lock that material into those neural circuits. The other thing that they do, and this is very important, is that they make an effort to then teach their peers to teach other students in the class. Now, some of you may be thinking that if you spend all this time learning the information and you are in a competitive scenario with the other students, that teaching them the information is kind of a freebie for them and it's harder for you, meaning you're putting yourself at a competitive disadvantage or you're giving them an unfair advantage for not having done the work. It's very clear that students who make it a point to learn material in isolation, then bring that material to other students in the same course and teach them, perform exceedingly well in comparison to the other students. So don't be afraid to be a teacher of your peers in order to test, this is key, to test and develop mastery of the material. Now, there are other components to learning and neuroplasticity that I've talked about on previous podcasts that are just too interesting not to mention, but I'm just going to mention them in brief, things like gap effects. Gap effects are oh so cool, and they've been demonstrated for lots of different forms of learning. Gap effects are what I just did, which is to take periodic pauses in the learning of material as short as five to 10 seconds, but even as long as 30 seconds during which, guess what? Your hippocampus, the neurons in your hippocampus, repeat information that you've been exposed to for the first time at a rate 20 to 30 times faster, just as it does during rapid eye movement sleep. So if you are a teacher and or if you are a learner periodically throughout an episode, a class or whatever of trying to learn new motor skills or music skills or whatever kind of learning, pause and let your hippocampus generate more repetitions of that material than it would otherwise if you just tried to barrel through. There's one other point that I wanted to pass along from this really nice study on the study habits of highly effective medical students. And that is when one examined or these people were asked about their motivation for studying, the best performing students had an interesting answer. They had a very long-term understanding of how, or belief rather, about how their success in medical school would impact their family, how it would impact their life arc, how it would change them. And they weren't particular about the ways in which it would change them or their family.  In fact, it was a rather broad, abstract, aspirational way of thinking about their study efforts. So the high-level aspirational stuff within you, whatever that is for you, it's going to be highly individual, is certainly important. And it offers a bookend to the nuts and bolts-y kind of stuff that you're going to do, I would hope, in order to best study and learn the specific material. So the specific actions that you're going to take each day to learn specific bits of information that will pull you toward those important aspirations.",
  "chunks": [
    {
      "timestamp": [
        0.0,
        13.58
      ],
      "text": " Today we are discussing how to study and learn, that is, what the scientific data say is the best way to study in order to remember information and to be able to use that information effectively in different areas of your life."
    },
    {
      "timestamp": [
        13.82,
        18.48
      ],
      "text": " Most of what we believe about the best ways to study are absolutely false."
    },
    {
      "timestamp": [
        18.74,
        21.5
      ],
      "text": " Fortunately, today you will learn the best ways to study."
    },
    {
      "timestamp": [
        25.46,
        28.8
      ],
      "text": " Now let's talk about how the best students structure their days."
    },
    {
      "timestamp": [
        28.8,
        42.12
      ],
      "text": " There's a really nice paper, in fact, that surveyed close to 700 students, these were medical students, approximately equal number of male and female students, and analyzed the most useful learning habits."
    },
    {
      "timestamp": [
        42.38,
        46.04
      ],
      "text": " There are at least 10 study habits that the highly effective students use."
    },
    {
      "timestamp": [
        46.14,
        56.04
      ],
      "text": " I'm going to focus on the top five or six because it turns out that most of the effect, it appears, of being a better student can be attributed to these top five or six habits."
    },
    {
      "timestamp": [
        56.88,
        57.0
      ],
      "text": ""
    },
    {
      "timestamp": [
        59.6,
        59.7
      ],
      "text": " First of all, they set aside time to study."
    },
    {
      "timestamp": [
        61.58,
        61.68
      ],
      "text": " They literally schedule time to study."
    },
    {
      "timestamp": [
        63.54,
        63.66
      ],
      "text": " Now, this probably serves several roles."
    },
    {
      "timestamp": [
        65.78,
        67.3
      ],
      "text": " The first one is that they are able to clear out other distractions."
    },
    {
      "timestamp": [
        67.62,
        69.9
      ],
      "text": " And in fact, that's the second thing that they do."
    },
    {
      "timestamp": [
        70.12,
        72.56
      ],
      "text": " They are very effective where they make it a point"
    },
    {
      "timestamp": [
        72.56,
        74.5
      ],
      "text": " of putting their phone away and off,"
    },
    {
      "timestamp": [
        74.7,
        76.02
      ],
      "text": " of isolating themselves."
    },
    {
      "timestamp": [
        76.16,
        76.52
      ],
      "text": " That's right."
    },
    {
      "timestamp": [
        76.6,
        78.28
      ],
      "text": " They're not studying with other people."
    },
    {
      "timestamp": [
        78.36,
        79.28
      ],
      "text": " They study alone."
    },
    {
      "timestamp": [
        79.66,
        80.52
      ],
      "text": " They put their phone away."
    },
    {
      "timestamp": [
        80.88,
        83.06
      ],
      "text": " They tell their friends and families"
    },
    {
      "timestamp": [
        83.06,
        85.28
      ],
      "text": " that they are not going to be able to be reached"
    },
    {
      "timestamp": [
        85.28,
        90.06
      ],
      "text": " during that time. Yes, they study for three or four hours per day, but they break that up into"
    },
    {
      "timestamp": [
        90.06,
        94.02
      ],
      "text": " a couple of different sessions typically, two or three sessions. So they're not doing a three or"
    },
    {
      "timestamp": [
        94.02,
        98.5
      ],
      "text": " four hour studying about all in one shot. So they're managing their time. They're eliminating"
    },
    {
      "timestamp": [
        98.5,
        103.4
      ],
      "text": " distractions. That is sure to help them anchor their focus and attention. They know that they're"
    },
    {
      "timestamp": [
        103.4,
        108.28
      ],
      "text": " going to need to use their focus and attention during that time. Scheduling time where you know"
    },
    {
      "timestamp": [
        108.28,
        114.26
      ],
      "text": " you're going to need to be focused and attending is perhaps one of the most important things toward"
    },
    {
      "timestamp": [
        114.26,
        119.02
      ],
      "text": " being able to focus and attend to the material. To the extent that you have any control over the"
    },
    {
      "timestamp": [
        119.02,
        123.84
      ],
      "text": " time in which you're going to study, keeping that at a regular time or times, perhaps one block early"
    },
    {
      "timestamp": [
        123.84,
        128.28
      ],
      "text": " in the day, one block later in the day, perhaps two blocks early in the day, and so on, is going"
    },
    {
      "timestamp": [
        128.28,
        132.14
      ],
      "text": " to be beneficial. It turns out that's also supported by the research literature. If you"
    },
    {
      "timestamp": [
        132.14,
        136.78
      ],
      "text": " regularly, meaning for the course of about three days, make it a point to focus and study at"
    },
    {
      "timestamp": [
        136.78,
        140.72
      ],
      "text": " particular times, again, pulling your attention back, it's not an automatic process, but pulling"
    },
    {
      "timestamp": [
        140.72,
        145.3
      ],
      "text": " your attention back to a specific location, perhaps on a page or that you're listening to"
    },
    {
      "timestamp": [
        145.3,
        151.04
      ],
      "text": " in a lecture, your body and brain will start to entrain to that rhythm such that you will be able"
    },
    {
      "timestamp": [
        151.04,
        156.94
      ],
      "text": " to focus and attend better simply by virtue of the regularity of the timing of the exposure to"
    },
    {
      "timestamp": [
        156.94,
        162.26
      ],
      "text": " the material. Okay. So you probably need about two or three days to break into a regular schedule"
    },
    {
      "timestamp": [
        162.26,
        166.98
      ],
      "text": " of focusing and attending and studying at a given time, allow yourself that transition period,"
    },
    {
      "timestamp": [
        166.98,
        170.6
      ],
      "text": " but then make it a point to schedule those times to study,"
    },
    {
      "timestamp": [
        170.88,
        173.92
      ],
      "text": " set aside your phone, tell people you're going offline,"
    },
    {
      "timestamp": [
        174.22,
        176.36
      ],
      "text": " turn off the wifi if you need to or have to."
    },
    {
      "timestamp": [
        176.46,
        177.62
      ],
      "text": " You may need it for your studying."
    },
    {
      "timestamp": [
        177.7,
        179.4
      ],
      "text": " I don't know, depends on what you're studying,"
    },
    {
      "timestamp": [
        179.82,
        181.66
      ],
      "text": " but limit distractions at all costs"
    },
    {
      "timestamp": [
        181.66,
        183.94
      ],
      "text": " and learn to just focus on the material."
    },
    {
      "timestamp": [
        184.18,
        185.34
      ],
      "text": " And this is a skill."
    },
    {
      "timestamp": [
        185.46,
        186.78
      ],
      "text": " This is the most important thing to understand."
    },
    {
      "timestamp": [
        186.9,
        189.36
      ],
      "text": " It's a skill to be able to focus and study."
    },
    {
      "timestamp": [
        189.62,
        191.6
      ],
      "text": " And it's a skill that you can learn very quickly,"
    },
    {
      "timestamp": [
        192.04,
        194.34
      ],
      "text": " especially if you schedule it for regular times"
    },
    {
      "timestamp": [
        194.34,
        196.16
      ],
      "text": " and you give yourself two or three days"
    },
    {
      "timestamp": [
        196.16,
        198.46
      ],
      "text": " in which to adapt to those schedules and times"
    },
    {
      "timestamp": [
        198.46,
        201.1
      ],
      "text": " and then try and stick to them as regularly as possible."
    },
    {
      "timestamp": [
        201.24,
        202.42
      ],
      "text": " Perhaps even on the weekends,"
    },
    {
      "timestamp": [
        202.42,
        204.74
      ],
      "text": " if you're approaching the end of the quarter or semester,"
    },
    {
      "timestamp": [
        205.16,
        206.18
      ],
      "text": " keeping those regular times"
    },
    {
      "timestamp": [
        206.18,
        207.78
      ],
      "text": " will entrain your nervous system"
    },
    {
      "timestamp": [
        207.78,
        211.9
      ],
      "text": " to study and learn at its best at those particular times."
    },
    {
      "timestamp": [
        214.72,
        218.28
      ],
      "text": " If ever there was a strongly research-supported tool"
    },
    {
      "timestamp": [
        218.28,
        220.62
      ],
      "text": " in the literature, in the peer-reviewed literature"
    },
    {
      "timestamp": [
        220.62,
        223.1
      ],
      "text": " about how students can learn information better,"
    },
    {
      "timestamp": [
        223.58,
        224.66
      ],
      "text": " it's testing."
    },
    {
      "timestamp": [
        224.92,
        224.66
      ],
      "text": ""
    },
    {
      "timestamp": [
        237.14,
        237.36
      ],
      "text": " I know, I know, I know we think of tests as a way to evaluate our knowledge, but it turns out that testing is one of the best ways to build our knowledge, to retain our knowledge, and again, to offset forgetting."
    },
    {
      "timestamp": [
        245.3,
        245.46
      ],
      "text": " The study of testing as a learning tool, not just as a way to evaluate how much information we've learned, goes back over a hundred years."
    },
    {
      "timestamp": [
        250.62,
        274.28
      ],
      "text": " There's a classic study that was done in 1917 where grade school aged children read biographies. So they read biographies and then the kids were divided into different groups. One group read and reread and reread those biographies over and over. Another group read the biographies once and then were tested on those biographies. But get this, they tested themselves on those biographies simply by having to think about the information that they had read and trying to remember the information."
    },
    {
      "timestamp": [
        274.28,
        275.26
      ],
      "text": " Like, what was the biography?"
    },
    {
      "timestamp": [
        275.42,
        276.04
      ],
      "text": " Who was the person?"
    },
    {
      "timestamp": [
        276.1,
        276.8
      ],
      "text": " Who were they married to?"
    },
    {
      "timestamp": [
        276.86,
        277.5
      ],
      "text": " What did they do?"
    },
    {
      "timestamp": [
        277.62,
        279.18
      ],
      "text": " When did they go to school?"
    },
    {
      "timestamp": [
        279.42,
        280.44
      ],
      "text": " What did they do in school?"
    },
    {
      "timestamp": [
        280.54,
        281.64
      ],
      "text": " What did they do in the world?"
    },
    {
      "timestamp": [
        281.8,
        283.6
      ],
      "text": " What role did they play in life?"
    },
    {
      "timestamp": [
        283.82,
        286.5
      ],
      "text": " So they essentially tested their own knowledge"
    },
    {
      "timestamp": [
        286.5,
        288.02
      ],
      "text": " simply by going into their own head"
    },
    {
      "timestamp": [
        288.02,
        289.78
      ],
      "text": " and asking themselves what they could remember"
    },
    {
      "timestamp": [
        289.78,
        290.94
      ],
      "text": " about those biographies."
    },
    {
      "timestamp": [
        291.1,
        295.04
      ],
      "text": " Now, keep in mind here that even though it's fairly apparent"
    },
    {
      "timestamp": [
        295.04,
        298.66
      ],
      "text": " that reading a biography two, three, four times"
    },
    {
      "timestamp": [
        298.66,
        301.42
      ],
      "text": " might seem more passive than testing oneself"
    },
    {
      "timestamp": [
        301.42,
        303.9
      ],
      "text": " on a biography that they had read just once, right?"
    },
    {
      "timestamp": [
        303.9,
        308.64
      ],
      "text": " You could imagine that thinking about the biography involves more effort, and indeed it does."
    },
    {
      "timestamp": [
        308.76,
        313.04
      ],
      "text": " But keep in mind also that kids in the second group were only exposed to the biography once."
    },
    {
      "timestamp": [
        313.52,
        319.74
      ],
      "text": " And yet, when you look at the percent of accurate recall of information from those biographies,"
    },
    {
      "timestamp": [
        320.08,
        326.48
      ],
      "text": " the children that read the biography once and then made a deliberate point to think about that biography in their own mind"
    },
    {
      "timestamp": [
        326.48,
        330.82
      ],
      "text": " to effectively test themselves on that material just within their heads over and over,"
    },
    {
      "timestamp": [
        330.82,
        333.94
      ],
      "text": " vastly outperformed the kids that read the biographies"
    },
    {
      "timestamp": [
        333.94,
        334.48
      ],
      "text": " over and over."
    },
    {
      "timestamp": [
        334.6,
        337.22
      ],
      "text": " Put differently, reading and rereading material"
    },
    {
      "timestamp": [
        337.22,
        340.92
      ],
      "text": " and rereading material is far less effective"
    },
    {
      "timestamp": [
        340.92,
        343.84
      ],
      "text": " than reading material and then thinking about that material,"
    },
    {
      "timestamp": [
        344.2,
        345.46
      ],
      "text": " testing yourself on that material,"
    },
    {
      "timestamp": [
        345.84,
        347.74
      ],
      "text": " forcing yourself to bring that material to mind"
    },
    {
      "timestamp": [
        347.74,
        348.84
      ],
      "text": " in your own mind."
    },
    {
      "timestamp": [
        349.0,
        351.7
      ],
      "text": " And this is not just for sake of remembering"
    },
    {
      "timestamp": [
        351.7,
        353.64
      ],
      "text": " more volume of material,"
    },
    {
      "timestamp": [
        353.64,
        357.68
      ],
      "text": " but also accuracy of recall of that material."
    },
    {
      "timestamp": [
        357.84,
        359.06
      ],
      "text": " The more times you test yourself"
    },
    {
      "timestamp": [
        359.06,
        360.54
      ],
      "text": " or that you are tested on material,"
    },
    {
      "timestamp": [
        360.7,
        360.54
      ],
      "text": ""
    },
    {
      "timestamp": [
        362.64,
        362.82
      ],
      "text": " the better your retention of that material."
    },
    {
      "timestamp": [
        364.28,
        364.74
      ],
      "text": " Now, some people will immediately say,"
    },
    {
      "timestamp": [
        367.62,
        370.32
      ],
      "text": " well, goodness, what if I learned it and then I'm tested and I'm somehow consolidating the wrong"
    },
    {
      "timestamp": [
        370.32,
        373.04
      ],
      "text": " or inaccurate material, but it doesn't appear to be the case."
    },
    {
      "timestamp": [
        373.06,
        375.24
      ],
      "text": " As long as you learn what the correct answers"
    },
    {
      "timestamp": [
        375.24,
        377.46
      ],
      "text": " to the tests are, even if you're getting, you know,"
    },
    {
      "timestamp": [
        377.54,
        380.76
      ],
      "text": " 40 or 50% or less accurate on those tests"
    },
    {
      "timestamp": [
        380.76,
        383.02
      ],
      "text": " that you take immediately after the studying period,"
    },
    {
      "timestamp": [
        383.26,
        384.94
      ],
      "text": " that's still going to be a better strategy"
    },
    {
      "timestamp": [
        384.94,
        386.26
      ],
      "text": " than rereading the material,"
    },
    {
      "timestamp": [
        386.56,
        388.76
      ],
      "text": " which ought to be somewhat surprising."
    },
    {
      "timestamp": [
        388.76,
        390.34
      ],
      "text": " It certainly was surprising to me,"
    },
    {
      "timestamp": [
        390.4,
        390.34
      ],
      "text": ""
    },
    {
      "timestamp": [
        411.56,
        416.42
      ],
      "text": " But you know what's even more surprising and a little scary and that we all should know and I wish I had learned when I was like in the second grade is that if you ask students how confident are you in the material that you just learned the students who studied the material that is who were exposed to the material four times think that they are going to perform best on the ultimate exam. However, the students that study the material once and then are tested three times on that"
    },
    {
      "timestamp": [
        416.42,
        420.74
      ],
      "text": " material, they think that ultimately they're going to perform least well."
    },
    {
      "timestamp": [
        420.98,
        421.46
      ],
      "text": " And guess what?"
    },
    {
      "timestamp": [
        421.54,
        422.98
      ],
      "text": " The exact opposite is true."
    },
    {
      "timestamp": [
        423.34,
        428.34
      ],
      "text": " Put differently, when you're exposed to material over and over and over again, you think you've"
    },
    {
      "timestamp": [
        428.34,
        429.04
      ],
      "text": " learned the material."
    },
    {
      "timestamp": [
        429.26,
        433.44
      ],
      "text": " In fact, your confidence that you've learned the material increases with each subsequent"
    },
    {
      "timestamp": [
        433.44,
        434.74
      ],
      "text": " exposure to the material."
    },
    {
      "timestamp": [
        434.9,
        440.14
      ],
      "text": " But actually, you haven't learned it at all compared to the people that are exposed to"
    },
    {
      "timestamp": [
        440.14,
        442.72
      ],
      "text": " of the material and then take tests on the material,"
    },
    {
      "timestamp": [
        442.72,
        445.06
      ],
      "text": " oftentimes straining to get the answers right"
    },
    {
      "timestamp": [
        445.06,
        445.9
      ],
      "text": " on those tests."
    },
    {
      "timestamp": [
        445.9,
        448.68
      ],
      "text": " In fact, sometimes getting those answers dead wrong"
    },
    {
      "timestamp": [
        448.68,
        450.76
      ],
      "text": " and then realizing they get those answers dead wrong"
    },
    {
      "timestamp": [
        450.76,
        452.26
      ],
      "text": " or sometimes they just sense it."
    },
    {
      "timestamp": [
        452.26,
        453.18
      ],
      "text": " But guess what?"
    },
    {
      "timestamp": [
        453.18,
        456.52
      ],
      "text": " Testing yourself once, twice, maybe three times"
    },
    {
      "timestamp": [
        456.52,
        459.02
      ],
      "text": " prior to the ultimate test of your knowledge"
    },
    {
      "timestamp": [
        459.02,
        462.44
      ],
      "text": " of that material is far and away the best way"
    },
    {
      "timestamp": [
        462.44,
        465.48
      ],
      "text": " to lock that material into those neural circuits."
    },
    {
      "timestamp": [
        468.64,
        469.54
      ],
      "text": " The other thing that they do,"
    },
    {
      "timestamp": [
        469.54,
        470.6
      ],
      "text": " and this is very important,"
    },
    {
      "timestamp": [
        470.6,
        473.66
      ],
      "text": " is that they make an effort to then teach their peers"
    },
    {
      "timestamp": [
        473.66,
        475.68
      ],
      "text": " to teach other students in the class."
    },
    {
      "timestamp": [
        475.68,
        477.14
      ],
      "text": " Now, some of you may be thinking"
    },
    {
      "timestamp": [
        477.14,
        479.34
      ],
      "text": " that if you spend all this time learning the information"
    },
    {
      "timestamp": [
        479.34,
        481.08
      ],
      "text": " and you are in a competitive scenario"
    },
    {
      "timestamp": [
        481.08,
        482.18
      ],
      "text": " with the other students,"
    },
    {
      "timestamp": [
        482.18,
        483.72
      ],
      "text": " that teaching them the information"
    },
    {
      "timestamp": [
        483.72,
        486.4
      ],
      "text": " is kind of a freebie for them and it's harder for you,"
    },
    {
      "timestamp": [
        486.4,
        489.08
      ],
      "text": " meaning you're putting yourself at a competitive disadvantage"
    },
    {
      "timestamp": [
        489.08,
        491.12
      ],
      "text": " or you're giving them an unfair advantage"
    },
    {
      "timestamp": [
        491.12,
        492.38
      ],
      "text": " for not having done the work."
    },
    {
      "timestamp": [
        492.38,
        495.92
      ],
      "text": " It's very clear that students who make it a point"
    },
    {
      "timestamp": [
        495.92,
        497.66
      ],
      "text": " to learn material in isolation,"
    },
    {
      "timestamp": [
        497.66,
        499.54
      ],
      "text": " then bring that material to other students"
    },
    {
      "timestamp": [
        499.54,
        501.36
      ],
      "text": " in the same course and teach them,"
    },
    {
      "timestamp": [
        501.36,
        504.78
      ],
      "text": " perform exceedingly well in comparison to the other students."
    },
    {
      "timestamp": [
        504.78,
        507.28
      ],
      "text": " So don't be afraid to be a teacher of your peers"
    },
    {
      "timestamp": [
        507.28,
        509.26
      ],
      "text": " in order to test, this is key,"
    },
    {
      "timestamp": [
        509.26,
        512.42
      ],
      "text": " to test and develop mastery of the material."
    },
    {
      "timestamp": [
        515.54,
        516.74
      ],
      "text": " Now, there are other components"
    },
    {
      "timestamp": [
        516.74,
        518.04
      ],
      "text": " to learning and neuroplasticity"
    },
    {
      "timestamp": [
        518.04,
        519.7
      ],
      "text": " that I've talked about on previous podcasts"
    },
    {
      "timestamp": [
        519.7,
        521.3
      ],
      "text": " that are just too interesting not to mention,"
    },
    {
      "timestamp": [
        521.3,
        522.86
      ],
      "text": " but I'm just going to mention them in brief,"
    },
    {
      "timestamp": [
        522.86,
        524.58
      ],
      "text": " things like gap effects."
    },
    {
      "timestamp": [
        524.58,
        526.02
      ],
      "text": " Gap effects are oh so cool,"
    },
    {
      "timestamp": [
        526.02,
        527.08
      ],
      "text": " and they've been demonstrated"
    },
    {
      "timestamp": [
        527.08,
        528.78
      ],
      "text": " for lots of different forms of learning."
    },
    {
      "timestamp": [
        528.78,
        532.04
      ],
      "text": " Gap effects are what I just did,"
    },
    {
      "timestamp": [
        532.04,
        534.38
      ],
      "text": " which is to take periodic pauses"
    },
    {
      "timestamp": [
        534.38,
        537.84
      ],
      "text": " in the learning of material as short as five to 10 seconds,"
    },
    {
      "timestamp": [
        537.84,
        540.64
      ],
      "text": " but even as long as 30 seconds during which, guess what?"
    },
    {
      "timestamp": [
        540.64,
        543.68
      ],
      "text": " Your hippocampus, the neurons in your hippocampus,"
    },
    {
      "timestamp": [
        543.68,
        545.96
      ],
      "text": " repeat information that you've been exposed to"
    },
    {
      "timestamp": [
        545.96,
        549.56
      ],
      "text": " for the first time at a rate 20 to 30 times faster,"
    },
    {
      "timestamp": [
        549.56,
        552.46
      ],
      "text": " just as it does during rapid eye movement sleep."
    },
    {
      "timestamp": [
        552.46,
        556.2
      ],
      "text": " So if you are a teacher and or if you are a learner"
    },
    {
      "timestamp": [
        556.2,
        559.84
      ],
      "text": " periodically throughout an episode, a class or whatever"
    },
    {
      "timestamp": [
        559.84,
        562.06
      ],
      "text": " of trying to learn new motor skills or music skills"
    },
    {
      "timestamp": [
        562.06,
        563.4
      ],
      "text": " or whatever kind of learning,"
    },
    {
      "timestamp": [
        564.72,
        568.38
      ],
      "text": " pause and let your hippocampus generate more repetitions"
    },
    {
      "timestamp": [
        568.38,
        570.32
      ],
      "text": " of that material than it would otherwise"
    },
    {
      "timestamp": [
        570.32,
        571.92
      ],
      "text": " if you just tried to barrel through."
    },
    {
      "timestamp": [
        573.56,
        575.9
      ],
      "text": " There's one other point that I wanted to pass along"
    },
    {
      "timestamp": [
        575.9,
        578.44
      ],
      "text": " from this really nice study on the study habits"
    },
    {
      "timestamp": [
        578.44,
        580.12
      ],
      "text": " of highly effective medical students."
    },
    {
      "timestamp": [
        580.12,
        585.74
      ],
      "text": " And that is when one examined or these people were asked about their motivation for studying,"
    },
    {
      "timestamp": [
        585.9,
        588.74
      ],
      "text": " the best performing students had an interesting answer."
    },
    {
      "timestamp": [
        588.74,
        595.88
      ],
      "text": " They had a very long-term understanding of how, or belief rather, about how their success"
    },
    {
      "timestamp": [
        595.88,
        600.96
      ],
      "text": " in medical school would impact their family, how it would impact their life arc, how it"
    },
    {
      "timestamp": [
        600.96,
        601.84
      ],
      "text": " would change them."
    },
    {
      "timestamp": [
        601.98,
        605.68
      ],
      "text": " And they weren't particular about the ways in which it would change them or their family."
    },
    {
      "timestamp": [
        605.96,
        605.68
      ],
      "text": ""
    },
    {
      "timestamp": [
        611.14,
        617.64
      ],
      "text": " In fact, it was a rather broad, abstract, aspirational way of thinking about their study efforts. So the high-level aspirational stuff within you, whatever that is for you,"
    },
    {
      "timestamp": [
        617.72,
        622.94
      ],
      "text": " it's going to be highly individual, is certainly important. And it offers a bookend to the nuts"
    },
    {
      "timestamp": [
        622.94,
        627.02
      ],
      "text": " and bolts-y kind of stuff that you're going to do, I would hope, in order to best study and learn the"
    },
    {
      "timestamp": [
        627.02,
        631.54
      ],
      "text": " specific material. So the specific actions that you're going to take each day to learn specific"
    },
    {
      "timestamp": [
        631.54,
        647.46
      ],
      "text": " bits of information that will pull you toward those important aspirations."
    }
  ]
}