{
  "language": "id",
  "text": "Oke, jadi kan tadi sebenarnya ada simpulan yang menurut saya yang enggak terluki yaitu LHCMA itu saya enggak lupa, itu bilangnya memberikan peringatan paling tinggi. Iya, Pak. Nah, ini yang LHCMA, Pak. LHCMA, ya. Nah, maksudnya peringatan tinggi itu kan belum tertutup itu benar-benar. Masa, berarti early warning pasti benar-benar kan enggak juga terlalu tinggi? Jadi memang maksudnya early warning terlalu gini tuh, apakah pada data point yang dideteksi LSTMI disitu emang udah terjadi anomali, kan enggak Kan bisa aja di data point setelahnya, karena memang maksudnya early warning tuh ya, jaga-jaga dulu, karena bisa aja di data point setelahnya anomalinya gitu Nah tapi maksudnya kalau terlalu early warning tuh juga gak perlu sih? Betul, iya Nah itu maksudnya, kan kayak kata-kata ini tuh bisa lebih dulu gitu loh kan kamu bilangnya karena memberikan peringatan paling gini jadi kayak paling dingin nih tapi dipastikan itu tepat gitu jadi kayak intinya lengkapnya benar misalkan tadi kamu timestamp, misalkan timestamp 100 terus dia 99 atau ini adalah lengkap-lengkap itu sudah benar kan itu benar tapi kalo tempelnya, tempelnya 100 tapi dari 50 dari 20 kan salah Jadi maksudnya biar gak terkesan bahwa early warning yang dimaksud itu benar-benar benar.",
  "chunks": [
    {
      "timestamp": [
        0.0,
        15.0
      ],
      "text": " Oke, jadi kan tadi sebenarnya ada simpulan yang menurut saya yang enggak terluki yaitu LHCMA itu saya enggak lupa, itu bilangnya memberikan peringatan paling tinggi."
    },
    {
      "timestamp": [
        15.0,
        16.0
      ],
      "text": " Iya, Pak."
    },
    {
      "timestamp": [
        16.0,
        17.0
      ],
      "text": " Nah, ini yang LHCMA, Pak."
    },
    {
      "timestamp": [
        17.0,
        18.0
      ],
      "text": " LHCMA, ya."
    },
    {
      "timestamp": [
        18.0,
        26.0
      ],
      "text": " Nah, maksudnya peringatan tinggi itu kan belum tertutup itu benar-benar. Masa, berarti early warning pasti benar-benar kan enggak juga terlalu tinggi?"
    },
    {
      "timestamp": [
        26.0,
        37.0
      ],
      "text": " Jadi memang maksudnya early warning terlalu gini tuh, apakah pada data point yang dideteksi LSTMI disitu emang udah terjadi anomali, kan enggak"
    },
    {
      "timestamp": [
        37.0,
        47.0
      ],
      "text": " Kan bisa aja di data point setelahnya, karena memang maksudnya early warning tuh ya, jaga-jaga dulu, karena bisa aja di data point setelahnya anomalinya gitu"
    },
    {
      "timestamp": [
        47.0,
        50.0
      ],
      "text": " Nah tapi maksudnya kalau terlalu early warning tuh juga gak perlu sih?"
    },
    {
      "timestamp": [
        50.0,
        51.0
      ],
      "text": " Betul, iya"
    },
    {
      "timestamp": [
        51.0,
        54.0
      ],
      "text": " Nah itu maksudnya, kan kayak kata-kata ini tuh bisa lebih dulu gitu loh"
    },
    {
      "timestamp": [
        54.0,
        58.0
      ],
      "text": " kan kamu bilangnya karena memberikan peringatan paling gini"
    },
    {
      "timestamp": [
        58.0,
        62.0
      ],
      "text": " jadi kayak paling dingin nih tapi dipastikan itu tepat gitu"
    },
    {
      "timestamp": [
        62.0,
        64.0
      ],
      "text": " jadi kayak intinya lengkapnya benar"
    },
    {
      "timestamp": [
        64.0,
        67.0
      ],
      "text": " misalkan tadi kamu timestamp, misalkan timestamp 100"
    },
    {
      "timestamp": [
        67.0,
        72.0
      ],
      "text": " terus dia 99 atau ini adalah lengkap-lengkap itu sudah benar kan itu benar"
    },
    {
      "timestamp": [
        72.0,
        79.0
      ],
      "text": " tapi kalo tempelnya, tempelnya 100 tapi dari 50 dari 20 kan salah"
    },
    {
      "timestamp": [
        79.0,
        90.0
      ],
      "text": " Jadi maksudnya biar gak terkesan bahwa early warning yang dimaksud itu benar-benar benar."
    }
  ]
}