{
  "language": "id",
  "text": "Oh iya iya Oke Di abstract Di sini kan dijelaskan datanya itu pakai data set IMS di ring set ketiga ya? Iya betul Oke, tapi ada 4 data di dalamnya gitu ya? Di ring 1, 2, 3, 4 gitu Iya betul, itu variable-nya Variable-nya ada 4 Di ring 1, 2, 3, 4 Oke, kemudian disini dijelaskan satu-satu hasilnya dari AI, PAI, dan GAN gitu ya. Terus di kalimat terakhirnya itu, di kalimat temuan ini menegaskan kepekaan rekonstruksi murni AI sebagai alat peringatan dini, sementara pendekatan probabilistik PAI dan GAN menawarkan generasi lebih kuat, tetapi dengan konsekuensi berkurangnya kecepatan deteksi awal.  ini melihatnya dari mana ini? Kecepatan deteksi awal maksudnya bagaimana? Oh, jadi kecepatan deteksi awal itu maksudnya adalah yang tadi saya jelaskan di evaluasi hasil anomaly detection yang mana di bapak 4 yaitu kalau tadi LCM Ganyu kan pertama kali mereteksi anomali itu di data point ke 1263 Sementara kalau yang Ae sama Fae, kalau yang Ae itu dia pertama kali berdeteksi anomali, itu digagak oleh ke 1134 Tapi kalau yang Fae itu 1136 Jadi Ae sama Fae ini tidak berbeda jauh, tapi yang berbeda sangat jauh itu adalah yang si Higan Jadi maksudnya berkurangnya kecepatan deteksi awal itu adalah deteksi yang kita sambungkan atau deteksi yang berkaitan dengan early warning karena deteksi ini anomali, seperti itu Oke, berarti kecepatan deteksi awalnya maksudnya titik menemukannya tadi itu? Iya, betul. Titik pertama kali si model menemukan anomali di data point pertama Oke, mungkin bisa dijelaskan yang FFT-nya aja Disini kan datanya ada 4 ya Variable-nya Terus menjadi tertransformasi itu gimana? Berarti X yang di persamaan 2.1 halaman 18 X-nya itu X-1, terus-2, 3, 4 gitu ya Coba ke halaman 18 Berarti itu adalah, X ini adalah nilai di biring 1, 2, 3, 4 gitu maksudnya Iya, jadi X yang dimasuk di situ adalah X yang row-nya Yang mana tiap row-nya itu kan memiliki data nilai untuk biring 1, biring 2, biring 3, biring 4 Nah, X tersebutlah yaitu value-value yang dimasukkan ke dalam promis FFT yang tersebut Terus XN itu diisi apa XN? XN, nah untuk yang XN ini dia di isinya dengan data point, jadi seperti itu Misalkan X0 Yang mana itu berarti X0 Kan kalau dibuat tiga nya azal itu X0 itu berarti yang 4 Maret 2020 Ya salah ya Ya 4 Maret 2024 itu X0 berarti X nolnya ini adalah yang mana? nah berarti untuk X nolnya ini sendiri untuk X nolnya ini sendiri itu yang data set yang timestamp yang pertama yang pertama tuh, tension yang pertama kali, pertama kali ribu sendiri yang mana itu? 0,06 aja atau semua ke kanan itu? nah itu jadi satu-satu 0,06 itu ditransformasi, dikonversi terus yang 0,07 dikonversi, sampai yang dari keempat oke, terus dikalikan E itu ya eksponen, J nya ini diisi apa? Nah untuk J, untuk J-nya itu, J-nya itu I. Apa yang ada keterangannya? Iya, sepertinya saya uang tuliskan keterangan dulu, untuk J-nya. Eh, dua P, P ada nilainya K, K itu nanti diisi dengan apa? Untuk K-nya itu diisinya dengan itu, yang mana K adalah 0,1 sampai N-1, yang mana itu adalah urutan datanya. Atau urutan dia data keberapa, atau pada data set yang saya itu, dia true keberapa, dia yang mau ditransformasi Berarti kalau saya mau yang data 4 Maret 2024, 9, 2, 7, 4, 6 itu berarti K nya adalah 0 gitu? Iya betul lho, seperti itu Oke K nya 0, N kecilnya 0, dibagi N besar, N besarnya berarti apa? Untuk yang besarnya ini, dia seharusnya atau seingat saya total keseluruhannya? Berarti 6.324 itu dikurangi satu, eh nggak ya, 6.324 itu, N besarnya. Seharusnya seperti itu. Terobat nanti kalau ditampilkan tuh perhitungannya sama enggak ya, sampai nanti diberikan perhitungannya gitu ya Terus yang menjadikannya ini, kan itu ada diskret sama ini fast flow ya, apa bedanya berarti, GFT sama FFT ini Jadi kalau misalkan, kalau FFT ini kan adalah algoritma yang diberikan untuk menghitung transformasi Fourier diskret Nah, kalau yang dibedanya dengan FFT ini, dia algoritmanya membuat perfeksi sinyal dari domain waktu ke domain frekuensinya itu Itu lebih cepat dibandingkan metode BFT Di sini ada tulisannya, sehingga spectrum frekuensi sinyal dapat diperoleh dalam waktu yang singkat Jadi perbedaannya hanya di masalah waktu atau time computation Nah disini kan sudah ditransform terus dilanjutkan lagi dengan min-max scalar ya Kenapa enggak salah satu aja? Boleh enggak misal FFT aja atau langsung min-max action? Kenapa harus dua tahap itu?  Oh, sebenarnya kalau serta aku juga gak apa-apa, cuman saya ada tunjukan dari paper sebelumnya Dia itu melakukan deteksi anomali 3 di data bearing, cuman bearing yang set kedua Dia itu preparasinya adalah efekte sama minimax, sebenarnya kalau misalkan minimax luar gak apa-apa Gak apa-apa? Iya, malah gak apa-apa Tapi kenapa perlu dilakukan? Lebih ribet kan gitu Karena paper yang menjadi tunjukan saya melakukan dua-duanya apa alasannya? alasannya adalah karena kalau misalnya FFT yang seperti ini kan kalau dilihat tuh udah lurus semua terus di normasa sih jadi balik kayak bentuk aslinya laki gitu kan kalau tadi lihat secara visualnya sih nah sebenernya gini Bu, kalau FFT itu kan berdasarkan penjelasan itu kan pengen melihat kalau misalkan ada penyimakan kecil itu kan kelihatan ya dari sini karena berbeda banget dengan yang sebelumnya Nah, kalau minima scalar, alasannya adalah apa? Biar skala pada seluruh datanya itu sama semua. Jadi, apa tujuannya biar sama semua, itu pada saat nanti model di-training, itu dapat men-stabilikan pelatihan. Jadi, stabilitas pelatihannya itu lebih stabil pada saat dilakukan model training. Jadi, sebenarnya alasannya adalah men-stabilikan data untuk apa? Biar membantu modelnya dalam stabilitas pelatihan. Oke, sudah dijelaskan alasannya ditambahkan normalisasinya tadi? Yang dilaparannya. Sudah. Di bab? Di bab, ini di halaman 21. Oh bab 2? Iya, betul. Oke, berarti alasannya supaya tadi skalanya sama gitu ya, ditambahkan min-max. Oke, mungkin bisa dijelaskan kan datanya yang tadi kan ribuan ya, dari TXT kemudian diubah menjadi CSV. Iya betul. Gimana itu, ada mungkin datanya. Oh, jadi sebentar saya coba. Jadi sebenarnya itu kan di VS Code gitu. Atau data yang kamu dapatkan pasti di folder gitu DTXT nya tuh gimana tertulis Seperti ibu, jadi awalnya DTXT seperti ini Lalu kalau kita klik, misalkan untuk yang timestamp pertama Nah, dia totalnya ada 4 fitur, dari 1 sampai dari 4, yang mana total seluruh datanya ini adalah 20.490, yang sudah saya diselesaikan di bank 4. Oke, timestamp 1 ya? Iya, itu untuk timestamp 1, betul. Coba yang di timestamp 2, panjangnya berarti beda lagi? Oh, panjangnya sama semua. Panjangnya sama terus? Iya, betul. Oke. Sama semua. Oke, terus ini kamu ekspor atau diubah ke CSV gitu ya, terus yang dimaksudkan di rata-rata absolu tadi itu yang mana? Oh, yang di rata absolu itu adalah yang setiap ini, misalkan ini untuk yang kancen pertama mungkin, kancen pertama, jadi rata-rata absolu itu untuk setiap fitur. Ke bawah ini berarti? Iya ke bawah, betul. Dirata-retakan sampai bering 4 dan jadilah seperti yang di rata-retakan. Oh sampai bering 4, nggak per bering gitu? Iya, maksud saya per bering, namun maksudnya itu dirata-retakan itu bering 1 dirata-retakan di bawah, bering 2 juga sampai bering 4. Sehingga menjadi setiap timestamp hanya ada satu data. Itu kamu ulangi sampai semua timestamp tadi? Sampai semua timestamp, betul. Terus yang divisualisasikan ini berarti yang hasil rata-ratanya gitu? Iya betul. Jadi yang divisualisasikan itu yang hasil rata-rata dan itulah yang dipakai untuk analisis, yang di-datable. Berarti setelah di rata-rata, terus di transform tadi FFT, terus di min-max gitu ya? Iya, sebelum di min-max. Terus tadi kan ada statement, oh iya, coba ke halaman 57 di bab 3, itu kan tahap modeling pendekatan hyperparameter tuning menggunakan metode hyperband Hyperband tuh gimana? Di bab 2 apakah ada? Saya pada saat itu sebenarnya udah kepikiran ngisi hyperband umat, saya belum lakukan sih tapi ga ada step ini? ga ada menggunakan metode hyperband? oh, hyperband nya saya pake di codingan cuman belum saya tulis di 2 nya ga ada jadi apa? metode hyperband itu seperti apa? jadi, bentar ini ada segitu lagi ga ada papan lagi oh, ada disitu papan oh, ada disitu tunjukkan nano nya aja ya, apa step nya atau apa itu?  Oh kutbulah boleh ya atau referensinya boleh kamu ngapain aja deh pertengung Hai nah jadi Hai ntar jadi atau saya pakai ini Seperti ini harusnya kalau di bawah dua itu masuk kemana, hyperparameter tuh nih stepnya Seharusnya iya Bu Jadi hyperband itu yang di sini Nah di sini itu  nah disini itu, dia kan ada max epox nya 100 gue ya nah cuman misalkan saya mengambil skenario biar menghitungnya gampang jadi menghitungnya gampang ini bukan gini misalkan max epox nya saya tentukan misalkan 81 disini ada variable atau yang namanya faktor ya Faktor di objek hyperband nya itu adalah 3. Nah jadi hyperband itu step by step nya adalah dia itu melakukan berparameter plumbing untuk setiap istilahnya itu batch. Jadi misalkan seperti ini. Untuk yang batch pertama, untuk yang batch pertama ini dia bakalan mencoba 81 model. itu bermaksudnya kombinasi hyperparameter sampai 21 cuman dia datang satu kali epok dia dalam satu kali epok nah terus setelah itu setelah itu dia selanjutnya bakalan mencoba 27 Cuma disini dia dalam tiga tali Epoch Nah, jadi maksudnya gimana dari 81 ke 27 Jadi dari 81 kombinasi percobaan model yang dalam satu Epoch itu Jadi tiap model itu hanya dicoba secara Epoch Nah, dipilih 27 model yang terbaik dari 81 Nanti setelah dipilih 27 model yang terbaik 27 model itu dilatih sebanyak 3 epoch setiap model, lalu lanjut lagi ke 39 model, sampai menghasilkan satu model yang terbaik. Nanti ditambahkan ya hasilnya Dan mungkin kalau ada step yang kamu masukkan disini Sesuaikan dengan data itu ya enggak apa-apa sih di BUB3 nya Mungkin biar lebih jelas Nah disini kan di BUB3 itu ada pernyataan Kalau Phi itu hyperparameter nya sama dengan I gitu ya? Iya betul Kenapa? Dibuat sama Oh itu yang BUB3 ya? Yang ketiga saya buat sama karena memang biar adil aja gitu Karena memang yang di duni itu hanya neuron sama yang lain-lainnya itu Karena kan perbedaannya AI sama FI itu kalau AI itu kan dia merekonstruksi data dari input terus yaudah gak ada pendekatan probabilistik Kalau FI itu ada pendekatan probabilistik jadi bedanya itu luang Tapi sebenarnya dalam perlakihan parameternya itu dalam hyperparameternya itu sebenarnya sama aja Jadi biar seimbang di sini yang saya buat sekarang ini. Terus, oh ya mungkin saran berarti di judul caption-nya ditambahkan aja. Berarti haber parameter untuk AI dan VAI. Caption-nya kan kamu hanya AI. Terus di halaman 61, di kalimat awal atas sendiri, Sekaligus mempertahankan dinamika adversarial yang sehat antara generator dan diskriminator Maksudnya yang sehat disini itu? Itu yang mana? Yang atas sendiri, baris kedua, halaman 61 Oh maksudnya, maksudnya yang sehat itu yang baik gitu loh Jadi mempertahankan dinamika adversarial itu kan pokoknya generator sama diskriminator Istilahnya kayak saling perang gitu kan sampai menghasilkan generator yang terbaik, generator yang terbaik. Jadi yang sehat itu maksudnya yang bagus itu, yang benar-benar proper. Oke, mungkin nanti kalimatnya disesuaikan aja ya, maksudnya apa. Ya, sehat di sini. Oke, ke halaman 64. Di situ ada anomali threshold ya, dihitung ya ini berarti. Bagaimana? Yang Anomaly Threshold Calculation Sudah ketemu Nah disitu ada yang mana threshold yang dipilih adalah nilai maksimum dari bar paling kanan yang berdekatan secara kontinu tanpa jeda atau patahan Kenapa milihnya bar paling kanan dan seperti itu Nah itu sebenarnya ada di paper referensi Jadi kalau di paper referensi itu yang ini Sebentar Itu yang ini Nah, jadi ini tuh merupakan hasil penelitian dari si Sulayman Dia di sini menghasilkan result anomali itu sebesar 0,126 Yang mana itu 0,126? Nah, 0,126 ini kalau dilihat dari sini, itu adalah berada di sini Yang mana di sini itu adalah merupakan bar yang paling kanan dari sepatu, dari histogram ini Nah, dia seharusnya kan bisa-bisa aja ngambil yang disini Karena kan distribusinya masih sampai disini kan Cuman penelitian ini itu ngambilnya di yang berpalingan 6,126 Karena biar tidak terlalu outlier Karena kalau yang disini kan ngambilnya terlalu outlier banget gitu Jadi nanti kalau terlalu outlier banget, takutnya modelnya itu dalam mendeteksi anomali secara dini itu kurang proper Jadi oleh karena itu di penelitian ini mengambilnya yang di sini. 0,126 itu berarti apakah nilai yang sudah di FFT kan tadi di transform dan di min-max scalar? Nah 0,126 itu adalah hasil recursion error, hasil recursion error nya. Jadi setelah memodelkan, terus hasil prediksi data dikurangi dengan hasil input awal Soalnya kalau histogram, itu kan kita bisa menentukan binnya atau kotaknya Nah tergantung kita kalau banyak, eh kita mau tentukan kotaknya banyak atau sedikit Gimana kita justifikasinya, itu kotak yang terakhir itu kan tergantung dari kita menentukan seberapa banyak bin yang mau kita buat jadi apakah mungkin ada ukuran tertentu misal kayak di boxplot di boxplot itu kan misal ada berapa kali IKR atau seperti apa itu dikatakan supplier misalnya nah apakah mungkin ada justifikasi lain bar nya ini seperti apa seberapa banyak bin yang dibuat itu kan juga mempengaruhi nanti karena Instagram kan tergantung dari bin yang mau kita buat juga Nah sebenarnya saya memang kenapa kok menentukan thresholdnya pakai metode seperti ini Jadi sebenarnya saya di codingan itu sudah mencoba 3 metode thresholdnya Jadi yang pertama itu adalah saya menggunakan K dikali standard deviasi dari data reconciliation errorsnya Nah itu ternyata di awal-awal itu kalau banyaknya anomali Padahal harusnya tidak anomali gitu, jadi sangat-sangat tidak make sense Terus metode yang kedua, dari paper juga sama, itu metodenya adalah karena yang awalnya tadi K x standard deviation aja, ini ditambahin MEAN tambah K x standard deviation Yang mana kalau dari saya setika itu sebutannya adalah Trisigma Itu saya juga sudah coba, namun masih di tengah-tengah itu masih banyak yang anomali juga Dan misal saya coba ini, ini yang merupakan paling make sense dari hasilnya. Kenapa nggak pakai 6 sigma? 6 sigma berarti 6 standard deviasi. Oh itu saya belum coba sih, karena memang referensi paper saya itu kebanyakan selalu kanya itu 3. Sebenarnya 3, kalau 2 itu biasanya dari 1,96. coba aja nanti dicari sebenernya tiga standar deviasi itu berarti berapa tingkat kepercayaannya kan kamu udah belajar seperti normal itu loh kalau 95% berarti kan 1,96 ya kan 5% dan kanan kiri berarti kan itu kalau biasanya didekatinnya memang 2 sigma nah kalau 3 sigma itu berarti berapa berarti artinya lebih lebar lagi ke kanan ya berarti 2 koma atau 3 koma 6, berarti itu sebenarnya, biasanya kalau di industri saya ingat saya, kalau stigma itu berarti 0 defect, jadi nggak ada defect, itu sangat kecil, ya mungkin tadi itu, jadi ke outlier-nya, mungkin bisa dikurangin lagi ke 5 stigma, misal, soalnya, nah apa justifikasi bar yang terakhir itu, ini apakah bar-nya itu ber-default-nya atau kamu tentukan BIM yang dibentuk, gimana, Azal? Kalau saya, sebentar. Jadi saya tentukan NBIC-nya 20 Kenapa kok 20? NBIC-nya 20 itu sebenarnya saya juga tidak ingin sih Cuma meskipun saya tentukan NBIC-nya 20 Cuma yang dihasilkan juga NBIC-nya juga enggak 20 Berapa itu berarti? Jadi dari sini Yang lainnya saat kecil itu Iya makanya Nah, sebenarnya kan English yang paling kanan itu yang ini Jadi maksud saya tadi tidak ada patahan Patahan itu berarti kan dia menandakan sebenarnya garis Garis yang sama kayak tadi di PPT itu Itu sebenarnya kan kalau kamu belajar histogram itu kan kelas kan Kelas interval, masuk kelas interval berapa gitu kan Nah itu nanti harus menunjukkan, kenapa jasifrasinya 20 atau seperti apa membentuk binnya itu Karena itu kan nanti sebagai patokan, bukan thresholdnya Kalau diperkecil berarti kan bisa jadi lebih ke kiri atau seperti apa Oke, terus Nah kalau dari gambar, itu kok yang orange tiba-tiba tidak ada itu apakah ketutupan dengan warna yang lain ya? Yang biring kedua, yang di gambar 4.6 Atau ada informasi yang belum saya baca Di halaman 70, itu kan warnanya yang ada, sisa biru, hijau, hitam Jadi memang data hasil transformasinya, saya cek lagi, itu sama Berarti yang oranye sama dengan apa? ini Bu, disini nah ini kalau saya cuma klik berarti hitam ya bearing 4 sama dengan yang hitam bearing 2 sama dengan si bearing 4 nah itu sepertinya belum dimasukkan ke sini ya di narasinya sudah dijelaskan belum?  Maksudnya kan enggak ada. Yang dijelaskan hanya di piring satu, dia tuh paling di atas gitu kan indenya, paling stagel. Ngarit ditambahkan ya, karena kok enggak ada yang orange, sama dengan warna yang mana gitu. Baik ya. Oke. Terus ke halaman 74, di bagian atasnya tabel 4.2.  Nah, disitu kan ada statement nilai latent dimension yang cukup besar membantu model menangkap pola kompleks dalam data Sedangkan learning rate yang moderat memastikan model tidak terjebak pada lokal minimum dan cepat konvergen Yang disini learning rate yang moderat itu yang sebesar berapa Jadi kalau learning rate yang moderat itu, ini kan saya mencoba skenario-nya kan 0,01 tadi ada yang 0,01 terus ada yang 0,005 maksudnya moderate itu yang tidak terlalu kecil dan juga tidak terlalu besar gitu yang mana itu maksudnya di tengah-tengah gitu moderate di tengah-tengah berarti yang mana 0,005 tadi? 0,0 Oh kalau kecil kan berarti yang 0,001 itu ya kecil? 0,001 itu dia paling besar ya? Yang paling besar apa yang kecil? 0,001 itu besar-besar paling besar Ya paling besar Terus 0,005 itu dia yang paling kecil ya terus yang 0,0001 dia yang paling tengah-tengah bener, tengah-tengahnya 0,0001 nah ini berarti tengah-tengahnya tergantung kita dong kalau saya settingnya 0,01 0,05 0,1 berarti yang moderatnya beda lagi ini bukan secara umum iya karena secara umum gimana menentukan modelnya terus terjebak pada lokal minimum maksudnya, gimana lokal minimum disini tuh? maksudnya lokal, jadi kan kalo misalkan apa namanya, bentar, saya lupa, oh ini, apa namanya, optimizer nah optimizer itu kan adalah Adam dan lain-lainnya nah kan karena model dilatih, karena ada optimizer nya itu berarti ada lokal minimum dan juga global minimum maksudnya tidak terlibat di lokal minimum itu artinya model lu tidak hanya Maksudnya, ngetrain-nya itu tidak di lokal minimum beruang Apa yang terjadi kalau di lokal minimum beruang? Maka modelnya hanya menghasilkan itu-itu aja Modelnya tidak meng-improve, artinya errornya tidak menurun Dan terjebak di itu-itu aja Berarti harapannya dia jadi global minimum gitu? Dia harapannya lebih ke.. ya pokoknya hasilnya itu modelnya itu mengalami penurunan errornya bener-bener proper, bener-bener menurun, tidak pada suatu saat itu dia apa ya, loss sama pallidation loss nya itu, si error nya itu tidak stabil doang, tapi dia bener-bener menurun ini kan sebenernya di istilah, kayaknya jika kulus ya total minimum, ini optimasi kan oke, jadi harapannya dia itu bener-bener yang paling minimum secara seluruhan di semua nilai iya betul Oke Kemudian terus, ini yang di bagian visualisasi yang Car Donat Kenapa kamu pakai donat? Pai car juga ya? Bukan pai, donat bukan Kan ada yang gak ada tengahnya, ada yang ada tengahnya Kenapa pakai yang itu? Karena cuma melihat 2 desi data dari 2 proporsi kan ada yang gak ada tengahnya oh maksudnya yang gitu ya sudah itu baik, terima kasih oke, terima kasih selanjutnya silahkan terima kasih karena beberapa pertanyaan saya sudah ditadak jadi silahkan dengan presisi Bu Indah nanti ke Bu Indah hahaha udah usah kesayang gak saya ulang lagi pertanyaannya eee oke eee sebelum saya membahas ini sebenarnya saya lebih suka membaca laporan kamu terdapatnya melihat presentasi kamu sejujurnya aku terlalu kecil Oke, nanti beberapa minor revisi nanti silahkan baca yang sudah saya tandai di sini. Nanti ketika bimbingan revisi, kalau dinyatakan lulus oleh Pak Ajis nanti silahkan ini dibawa ketika saya.  Oke, secara keseluruhan, bab 1 sudah sangat baik, sudah jelas apa tujuannya, kemudian organisinya apa di PPT, jadi tadi juga sudah ada. Kemudian tadi sudah dibahas juga oleh Bu Indah pertanyaan tentang FFT, kemudian Minmak Skyler juga sudah dibahas tadi. Nah, untuk LSTM saya rasa tidak masalah karena kamu sebenarnya kan hanya membandingkan LSTM AE, VAE, dan segala-galanya gitu. Kemudian kamu menambah sedikit kontribusi baru di anomaly detection, ya kan ya. Saya mau dijelaskan dong tentang anomaly detection. Sebenarnya apa sih yang dikatakan anomaly di sini, normal itu seperti apa, anomal itu seperti apa, dan prosesnya kamu untuk mendapatkan anomali dari data kamu ya jadi sebenarnya kalau dari anomali detection itu sendiri bagaimana kita bisa mereteksi apa ya, kayak penjimpangan suatu data, maksudnya penjimpangan suatu data itu ketika kita sudah tahu suatu threshold anomali maka ketika ada data point yang di atas threshold anomali maka disitulah terjadi anomali detection artinya ada anomali Oke, saya tolong dulu. Berarti dari awal kamu sudah mengetahui kalau ada anomali di data kamu? Ya, jadi seperti ini Bu. Jadi pada dataset EMS Bearing ini, yang di set 3, itu memang pada dokumentasi dataset EMS Bearing, yang mana nih dokumentasinya ada di NASA dan juga ada perhatiannya juga, itu bilang bahwa memang di akhir-akhir. Jadi kan data set image bearing ini merupakan data set yang dilakukan eksperimen test to failure Artinya, si bearing itu dijalankan eksperimennya sampai menuju tahap dia mengalami kegagalan, failure Memang di dokumentasinya, sama penelitian-penelitian yang saya baca, di akhir-akhir pengujian itu memang si data set EMS Bearing ini ada kendala faulty yaitu kendala anomali pada si data set EMS Bearing ini Jadi kita mengetahui bahwa suatu data set EMS Bearing ini anomali atau faulty itu dari dokumentasinya itu sendiri Jadi sebenarnya sudah tahu ya kalau ada kategori termasuk faulty atau failure di data tersebut Betul, tapi tidak diketahui label ground root nya Oh oke, jadi tujuan kamu untuk mendeteksi anomali setelah selesai proses LSTM adalah? Selesai proses LSTM adalah saya dapat benar-benar mengetahui di data yang mana suatu sinyal ini atau suatu sinyal itu benar-benar mengalami anomali di timestamp keberapa, suatu data musim ini yang C3 ini benar-benar mengalami kegagalan secara penuh, gitu, seperti itu Oke, untuk skenario anomalinya, karena disini kan ditabatil suatu data IMS1 itu kan ada timestamp, bering 1, bering 2, bering 3, bering 4 berarti yang kamu jadikan patokan adalah timestampnya, atau bering 1, 2, 3, 4? Maksudnya patokan bagaimana? Yang melandasi kamu, oh ini tuh anomali, faulty atau failure Oh iya, jadi emang yang saya jadikan patokan adalah si time time-nya Karena kan nilai data pada setiap beding itu, itu nilai sinyalnya Apakah sinyal yang mengalami kenaikan di time-time segini? Nah jadi seperti itu patokannya Oh iya, sebelum saya balik ke anomalization Tabel 3.1 itu kan ini sebenarnya hasil konversi kamu enggak sih? Iya. Datang mentahnya enggak ada? Datang mentahnya yang teksin. Iya udah, tapi yang teksin aja dulu untuk yang tabel 3.1. Karena kalau 3.1 ini salah persis dengan gambar 4.2. Jadi kamu masukkan saja misalnya potongan teksin itu, ini data mentahnya. Kemudian bentuk setelah di rekonstruksi atau dikonsersi itu seperti ini Oke, kemudian lanjut bentuk anomalinya kamu apa-apa setelah kamu mengetahui dari itu ada faulty, normal, atau failurenya Kemudian dengan metode apa approach-nya anomalinya itu bisa dijelaskan Untuk operasinya sendiri, ini maksudnya adalah untuk menentukan model terbaik dalam melakukan deteksi anomali atau bagaimana? Ya, jadi untuk melakukan deteksi anomali pada perhentian saya itu adalah dilakukan berdasarkan evaluasi early warning atau deteksi secara diri yang mana di sini evaluasinya adalah di sini itu yang LSTM-IU LSTM-IU dia berhasil mereteksi anomali pertama kali pada data point ke 1134 dengan threshold sebesar 0,25an nah data point 1134 ini kita selisihkan dengan thresholdnya Lalu, untuk yang LSTM point juga sama, dia pertama kali mendeteksi data point ke, eh, dia pertama kali mendeteksi anomali di data point ke 1136, dan yang terakhir dibentuk di 1293. Nah, dalam hal ini, saya melihatnya adalah evaluasinya berdasarkan early warning. Early warning itu, pokoknya bagaimana si mobil mendeteksi anomali secara gigi.  Nah disini evaluasi yang terbaik itu adalah berdasarkan yang si LSTMI Karena dibandingkan ke dua model lainnya, itu LSTMI berhasil meroteksi amali lebih gini daripada yang di dua model lainnya Seperti itu untuk Jadi target kamu adalah early warningnya itu Iya betul early warningnya Karena apa, jadi sebenarnya pada paper paper yang sudah saya baca itu bisa kita meminimalkan fase positif Tapi hanya untuk data yang berlihat dulu Kebetulan disini tidak ada lagi gonggur, jadi tidak bisa Oleh karena itu evaluasinya berdasarkan lagi gonggur Kemudian nanti itu penjelasannya antara normal dengan anomali faulty failure itu nanti kamu tambahkan ya? Ketika kamu membahas anomali protection Karena belum ada Tapi ada bahasa normal anomali itu yang tadi sudah dibahas keindah ya, di gambar 16 dan seterusnya Karena kita harus membedakan dulu normal itu bagaimana, kemudian anomali itu bagaimana Beberapa citasi itu masih salah, jadi nanti coba pastikan bagaimana citasi yang benar itu seharusnya kalau ada di dalam teks Karena ada ketidak konsistenan, contohnya nih, ZANG DKK DOR, kemudian dalam tahun, tahunnya baru dikasih kurung, kemudian ada yang lain itu, LI DKK 2023 itu di dalam kurung, nanti coba dipastikan lihat petunjuk yang benar itu seperti apa.  Selain itu Kalau dia tadi, oh tadi Bu Indah belum sempat nyinggung ya Yang tempat penelitian Nah tempat penelitian ini kamu korjian dirumah? Iya, saya dirumah Tapi untuk buku skripsi kayaknya di jadi lab ini, lab TSD, atau dikerjakan di STMM karena kalau rumah sangat riset sekali, karena kan kamu LSTM ya bisa sih dirumahkan ya dengan laptop masing-masing, cuma kan gimana ya? nanti diganti saja, supaya lebih formal melakukan penelitian Kemudian di gambar 3.1 flowchartnya kan ada kamu kasih gambar untuk data processing dan anomaly detection itu ada subprosesnya, kalau itu notasinya kan ya. Kemudian yang subprosesnya itu, yang gambar 3.2 kan maksudnya?  Subprosesnya di situ, itu subproses dari data preprocessing Berarti nanti kamu mention ya di 3.32 itu kalau gambar 3.2 itu adalah subproses dari 3.1 Gambar 3.2, data preprocessing ini kan merupakan subproses dari ini kan ya Nah nanti jangan lupa kamu mention dulu Karena kan enggak boleh miss kan ya? Kita kan harus menjelaskan kalau data preprocessing itu subprosesnya adalah yang gambar 3.2, begitu juga dengan anomaly detection. Nah ibu panggil. Oke. Saya mau proses dulu untuk jumlah data setiap file, data set, biring set ketiganya itu memang sama ya? Apa setelah di preprocess? Apa data collection langsung halaman 67? Halaman 67. 4.1 data collection. kan txt nya total filenya 6,3,2,4 setiap file berisi 24,80 data getaran untuk setiap biring berarti memang sama bingin 1,2,3,4 nya jadi 1,2,3,4 itu memang saya pakai ini aja jadi misalkan untuk timestamp yang pertama ya timestamp yang pertama itu memang total data atau total row Untuk setiap variable, itu Rp20.000 semua, begitu juga dengan plan step yang lainnya. Itu memang dari datasetnya ya? Iya, dari datasetnya pada saat saya download di komponisar. Sekarang ada range waktu ya? Iya, betul. Oke, terima kasih Ibu Yutika. Selanjutnya silahkan Bumar Yama. Oke, jadi kan tadi sebenernya ada ini ya, ada simpulannya menurut saya yang enggak terluki, yaitu LHCMA itu saya enggak lupa, itu bilangnya memberikan peringatan paling tinggi. Iya, Pak. Nah, ini yang LHCMA, Pak. LHCMA itu. Nah, maksudnya peringatan tinggi itu kan belum tentu itu benar-benar. Masa, jadi early warning pasti benar-benar kan enggak juga terlalu tinggi. Jadi memang early warning terlalu tinggi, apakah pada data point yang dideteksi LSCMI disitu memang sudah terjadi anomali, kan enggak. Kan bisa saja di data point setelahnya, karena memang early warning itu ya jaga-jaga dulu, karena bisa saja di data point setelahnya anomalinya. Nah tapi maksudnya kalau terlalu early warning itu juga gak bagus Betul, iya Maksudnya kan kata-kata ini tuh bisa lebih dulu gitu loh Kan kamu bilangnya karena memberikan peringatan ke paling ini Jadi kayak paling dingin nih tapi dipastikan itu tepat gitu Jadi kayak intinya lengkapnya benar kan Misalnya tadi kamu timestamp, misalkan timestamp 100 Terus dia 99 atau ini ada lengkap-lengkap itu sudah benar itu benar, tapi kalau pertanyaannya, pertanyaannya 100, tapi dari 50, dari 20, kan salah? Iya betul. Jadi maksudnya, biar gak terkesan bahwa early warning yang dimaksud itu benar-benar. Benar gitu. Tadi sebenarnya sudah dibahas banyak ya, sama Bu Ika, sama Bu Ida. Kalau saya beberapa penulisan tadi lomong saya menemukan beberapa, tinggal di-check saja. Silahkan, terima kasih banyak mas. Oke, terima kasih Bu Mariama. Oke, dari saya ini aja mungkin yang pertama untuk tinjauan bustaka yang tabelnya itu kasih nomor ya. Nah tabel IP, mas. Jadi biar gampang kalau mau menunjukkan kamu pakai bagaimana, pakai yang mana. Ya oke terus, ya ini yang halaman 64, coba dilihat, yang paling bawah paragraf terakhir, itu kan kamu bilang berdasarkan visualisasi simulatif pada gambar 3.8 pada model pertama diketahui bahwa titik pertama kali terjadinya anomali ditandai dengan lonjakan nilai reconstruction error yang melewati batas threshold, garis putus-putus berwarna hijau. Terus, dia kan yang merah. Aduh, ketinggalan. Ya, makanya saya tadi baca kelewatan ya. Oke, terus di halaman selanjutnya itu, kamu bilang apabila suatu model mendeteksi mendeteksi anomali pertama kali pada data point ke-100 dengan threshold 20 padahal 20 nya ini kan tadi ya pakai histogram gitu ya itu mungkin perlu kamu refer gitu ke mana kamu dapat 20 nya itu maksudnya cara menghitungnya aja kamu refer aja oh berarti saya tuliskan 20 ini berdasarkan? ya misal dengan perhitungan ini 20 ini kamu hitung beneran ya? Enggak, saya random aja Enggak, maksudnya kamu jelaskan berdasarkan misalnya persamaan 2 titik berapa gitu Menghasilkan suatu threshold yang contohnya misal disini 20 Nah itu baru kamu jelaskan gitu Oke, terus sama yang ini ya juga Kamu menghitungnya dari data point ke 79 dan threshold ke 15 Itu kamu kurangi gitu kan ya Itu kamu dapatnya dari mana? Itu kamu refer juga. Oh, mendapatnya dari mana itu maksudnya? Maksudnya perhitungannya. Di persamaan berapa itu kamu perlu menjaga. Soalnya kan itu core-nya yang kamu kerjakan. Nah, ini kan sesuai dengan penelitian sebelumnya kan sebenarnya. Iya. Itu 9 minus 15, terus 100 minus 20, ini apa-apa. Iya, itu paper-nya yang ini juga? Ya, ada kan, kalau misalnya di bab 2 belum kamu tulis, tema pada yang hitungnya kayak gitu, berarti kamu penulis Berarti itu untuk menentukan apa yang ini? Yang paling bagus kan ya, kan kamu bilang deviasinya lebih kecil gitu kan Sebenarnya kok bisa kamu, itu masa nyebutnya deviasi sih? kan 79 itu datapoint ke 79 iya, datapoint 9 time-time ke 79 tapi kan terus resultnya kan 15 sama 20 ini kan ya kan masa deviasi melitung kayak gitu lah bukan selisih dong selisih ya? bukan lah ya enggak tahu kamu tanya minda, tanya minda enggak maksudnya kalau deviasi itu kan biasanya nilainya segini segini, terus ada yang sampai segini, ada yang sampai segini, itu deviasi, standar deviasinya. Ini kan kayaknya, harusnya istilahnya bukan deviasi maksud saya. Deviasi biasanya, deviasi itu jarak sih, jarak nilai. Tapi kan 79 sama 15 ini kan bukan nilai yang sama maksudnya. Oh iya, tanpa perbandingan yang ini. Oke, dari saya itu aja. Mungkin itu aja Azal ya, boleh keluar dulu kita akan berdiskusi untuk menentukannya lagi ya.",
  "chunks": [
    {
      "timestamp": [
        0.0,
        3.0
      ],
      "text": " Oh iya iya"
    },
    {
      "timestamp": [
        3.0,
        6.0
      ],
      "text": " Oke"
    },
    {
      "timestamp": [
        6.0,
        13.0
      ],
      "text": " Di abstract"
    },
    {
      "timestamp": [
        13.0,
        20.0
      ],
      "text": " Di sini kan dijelaskan datanya itu pakai data set IMS di ring set ketiga ya?"
    },
    {
      "timestamp": [
        20.0,
        21.0
      ],
      "text": " Iya betul"
    },
    {
      "timestamp": [
        21.0,
        24.0
      ],
      "text": " Oke, tapi ada 4 data di dalamnya gitu ya?"
    },
    {
      "timestamp": [
        24.0,
        25.0
      ],
      "text": " Di ring 1, 2, 3, 4 gitu"
    },
    {
      "timestamp": [
        25.0,
        27.0
      ],
      "text": " Iya betul, itu variable-nya"
    },
    {
      "timestamp": [
        27.0,
        28.0
      ],
      "text": " Variable-nya ada 4"
    },
    {
      "timestamp": [
        28.0,
        29.0
      ],
      "text": " Di ring 1, 2, 3, 4"
    },
    {
      "timestamp": [
        29.0,
        36.54
      ],
      "text": " Oke, kemudian disini dijelaskan satu-satu hasilnya dari AI, PAI, dan GAN gitu ya."
    },
    {
      "timestamp": [
        37.42,
        48.1
      ],
      "text": " Terus di kalimat terakhirnya itu, di kalimat temuan ini menegaskan kepekaan rekonstruksi murni AI sebagai alat peringatan dini,"
    },
    {
      "timestamp": [
        48.1,
        55.34
      ],
      "text": " sementara pendekatan probabilistik PAI dan GAN menawarkan generasi lebih kuat, tetapi dengan konsekuensi berkurangnya kecepatan deteksi awal."
    },
    {
      "timestamp": [
        55.52,
        55.34
      ],
      "text": ""
    },
    {
      "timestamp": [
        60.34,
        67.34
      ],
      "text": " ini melihatnya dari mana ini? Kecepatan deteksi awal maksudnya bagaimana? Oh, jadi kecepatan deteksi awal itu maksudnya adalah yang tadi saya jelaskan di evaluasi hasil anomaly detection"
    },
    {
      "timestamp": [
        67.34,
        77.34
      ],
      "text": " yang mana di bapak 4 yaitu kalau tadi LCM Ganyu kan pertama kali mereteksi anomali itu di data point ke 1263"
    },
    {
      "timestamp": [
        77.34,
        86.34
      ],
      "text": " Sementara kalau yang Ae sama Fae, kalau yang Ae itu dia pertama kali berdeteksi anomali, itu digagak oleh ke 1134"
    },
    {
      "timestamp": [
        86.34,
        91.34
      ],
      "text": " Tapi kalau yang Fae itu 1136"
    },
    {
      "timestamp": [
        91.34,
        97.34
      ],
      "text": " Jadi Ae sama Fae ini tidak berbeda jauh, tapi yang berbeda sangat jauh itu adalah yang si Higan"
    },
    {
      "timestamp": [
        97.34,
        105.34
      ],
      "text": " Jadi maksudnya berkurangnya kecepatan deteksi awal itu adalah deteksi yang kita sambungkan atau deteksi yang berkaitan dengan early warning"
    },
    {
      "timestamp": [
        105.34,
        107.94
      ],
      "text": " karena deteksi ini anomali, seperti itu"
    },
    {
      "timestamp": [
        107.94,
        113.34
      ],
      "text": " Oke, berarti kecepatan deteksi awalnya maksudnya titik menemukannya tadi itu?"
    },
    {
      "timestamp": [
        113.34,
        118.84
      ],
      "text": " Iya, betul. Titik pertama kali si model menemukan anomali di data point pertama"
    },
    {
      "timestamp": [
        135.34,
        143.94
      ],
      "text": " Oke, mungkin bisa dijelaskan yang FFT-nya aja"
    },
    {
      "timestamp": [
        143.94,
        145.94
      ],
      "text": " Disini kan datanya ada 4 ya"
    },
    {
      "timestamp": [
        145.94,
        147.56
      ],
      "text": " Variable-nya"
    },
    {
      "timestamp": [
        147.56,
        151.24
      ],
      "text": " Terus menjadi tertransformasi itu gimana?"
    },
    {
      "timestamp": [
        151.74,
        155.64
      ],
      "text": " Berarti X yang di persamaan 2.1 halaman 18"
    },
    {
      "timestamp": [
        155.64,
        161.26
      ],
      "text": " X-nya itu X-1, terus-2, 3, 4 gitu ya"
    },
    {
      "timestamp": [
        161.26,
        163.96
      ],
      "text": " Coba ke halaman 18"
    },
    {
      "timestamp": [
        163.96,
        171.96
      ],
      "text": " Berarti itu adalah, X ini adalah nilai di biring 1, 2, 3, 4 gitu maksudnya"
    },
    {
      "timestamp": [
        171.96,
        176.96
      ],
      "text": " Iya, jadi X yang dimasuk di situ adalah X yang row-nya"
    },
    {
      "timestamp": [
        176.96,
        182.96
      ],
      "text": " Yang mana tiap row-nya itu kan memiliki data nilai untuk biring 1, biring 2, biring 3, biring 4"
    },
    {
      "timestamp": [
        182.96,
        189.96
      ],
      "text": " Nah, X tersebutlah yaitu value-value yang dimasukkan ke dalam promis FFT yang tersebut"
    },
    {
      "timestamp": [
        189.96,
        192.96
      ],
      "text": " Terus XN itu diisi apa XN?"
    },
    {
      "timestamp": [
        192.96,
        201.96
      ],
      "text": " XN, nah untuk yang XN ini dia di isinya dengan data point, jadi seperti itu"
    },
    {
      "timestamp": [
        201.96,
        204.96
      ],
      "text": " Misalkan X0"
    },
    {
      "timestamp": [
        204.96,
        206.96
      ],
      "text": " Yang mana itu berarti X0"
    },
    {
      "timestamp": [
        206.96,
        211.96
      ],
      "text": " Kan kalau dibuat tiga nya azal itu"
    },
    {
      "timestamp": [
        211.96,
        216.96
      ],
      "text": " X0 itu berarti yang 4 Maret 2020"
    },
    {
      "timestamp": [
        216.96,
        218.96
      ],
      "text": " Ya salah ya"
    },
    {
      "timestamp": [
        218.96,
        220.96
      ],
      "text": " Ya 4 Maret 2024 itu X0"
    },
    {
      "timestamp": [
        220.96,
        233.96
      ],
      "text": " berarti X nolnya ini adalah yang mana?"
    },
    {
      "timestamp": [
        233.96,
        238.96
      ],
      "text": " nah berarti untuk X nolnya ini sendiri"
    },
    {
      "timestamp": [
        238.96,
        245.96
      ],
      "text": " untuk X nolnya ini sendiri itu yang data set yang timestamp yang pertama"
    },
    {
      "timestamp": [
        245.96,
        252.36
      ],
      "text": " yang pertama tuh, tension yang pertama kali, pertama kali ribu sendiri"
    },
    {
      "timestamp": [
        252.36,
        256.36
      ],
      "text": " yang mana itu? 0,06 aja atau semua ke kanan itu?"
    },
    {
      "timestamp": [
        256.36,
        263.36
      ],
      "text": " nah itu jadi satu-satu 0,06 itu ditransformasi, dikonversi"
    },
    {
      "timestamp": [
        263.36,
        268.96
      ],
      "text": " terus yang 0,07 dikonversi, sampai yang dari keempat"
    },
    {
      "timestamp": [
        268.96,
        273.96
      ],
      "text": " oke, terus dikalikan E itu ya eksponen, J nya ini diisi apa?"
    },
    {
      "timestamp": [
        273.96,
        280.42
      ],
      "text": " Nah untuk J, untuk J-nya itu, J-nya itu I."
    },
    {
      "timestamp": [
        281.16,
        282.76
      ],
      "text": " Apa yang ada keterangannya?"
    },
    {
      "timestamp": [
        282.82,
        286.86
      ],
      "text": " Iya, sepertinya saya uang tuliskan keterangan dulu, untuk J-nya."
    },
    {
      "timestamp": [
        287.02,
        290.9
      ],
      "text": " Eh, dua P, P ada nilainya K, K itu nanti diisi dengan apa?"
    },
    {
      "timestamp": [
        291.84,
        300.08
      ],
      "text": " Untuk K-nya itu diisinya dengan itu, yang mana K adalah 0,1 sampai N-1,"
    },
    {
      "timestamp": [
        300.08,
        303.64
      ],
      "text": " yang mana itu adalah urutan datanya."
    },
    {
      "timestamp": [
        303.96,
        313.56
      ],
      "text": " Atau urutan dia data keberapa, atau pada data set yang saya itu, dia true keberapa, dia yang mau ditransformasi"
    },
    {
      "timestamp": [
        313.56,
        320.56
      ],
      "text": " Berarti kalau saya mau yang data 4 Maret 2024, 9, 2, 7, 4, 6 itu berarti K nya adalah 0 gitu?"
    },
    {
      "timestamp": [
        320.56,
        323.06
      ],
      "text": " Iya betul lho, seperti itu"
    },
    {
      "timestamp": [
        323.06,
        328.56
      ],
      "text": " Oke K nya 0, N kecilnya 0, dibagi N besar, N besarnya berarti apa?"
    },
    {
      "timestamp": [
        328.56,
        337.56
      ],
      "text": " Untuk yang besarnya ini, dia seharusnya atau seingat saya total keseluruhannya?"
    },
    {
      "timestamp": [
        337.56,
        348.56
      ],
      "text": " Berarti 6.324 itu dikurangi satu, eh nggak ya, 6.324 itu, N besarnya."
    },
    {
      "timestamp": [
        348.56,
        350.56
      ],
      "text": " Seharusnya seperti itu."
    },
    {
      "timestamp": [
        350.56,
        358.56
      ],
      "text": " Terobat nanti kalau ditampilkan tuh perhitungannya sama enggak ya, sampai nanti diberikan perhitungannya gitu ya"
    },
    {
      "timestamp": [
        358.56,
        372.56
      ],
      "text": " Terus yang menjadikannya ini, kan itu ada diskret sama ini fast flow ya, apa bedanya berarti, GFT sama FFT ini"
    },
    {
      "timestamp": [
        372.56,
        381.92
      ],
      "text": " Jadi kalau misalkan, kalau FFT ini kan adalah algoritma yang diberikan untuk menghitung transformasi Fourier diskret"
    },
    {
      "timestamp": [
        381.92,
        392.04
      ],
      "text": " Nah, kalau yang dibedanya dengan FFT ini, dia algoritmanya membuat perfeksi sinyal dari domain waktu ke domain frekuensinya itu"
    },
    {
      "timestamp": [
        392.04,
        395.02
      ],
      "text": " Itu lebih cepat dibandingkan metode BFT"
    },
    {
      "timestamp": [
        395.02,
        401.86
      ],
      "text": " Di sini ada tulisannya, sehingga spectrum frekuensi sinyal dapat diperoleh dalam waktu yang singkat"
    },
    {
      "timestamp": [
        401.86,
        407.72
      ],
      "text": " Jadi perbedaannya hanya di masalah waktu atau time computation"
    },
    {
      "timestamp": [
        407.72,
        420.0
      ],
      "text": " Nah disini kan sudah ditransform terus dilanjutkan lagi dengan min-max scalar ya"
    },
    {
      "timestamp": [
        420.0,
        422.06
      ],
      "text": " Kenapa enggak salah satu aja?"
    },
    {
      "timestamp": [
        423.14,
        426.04
      ],
      "text": " Boleh enggak misal FFT aja atau langsung min-max action?"
    },
    {
      "timestamp": [
        426.04,
        427.58
      ],
      "text": " Kenapa harus dua tahap itu?"
    },
    {
      "timestamp": [
        428.06,
        427.58
      ],
      "text": ""
    },
    {
      "timestamp": [
        434.58,
        440.58
      ],
      "text": " Oh, sebenarnya kalau serta aku juga gak apa-apa, cuman saya ada tunjukan dari paper sebelumnya Dia itu melakukan deteksi anomali 3 di data bearing, cuman bearing yang set kedua"
    },
    {
      "timestamp": [
        440.58,
        446.58
      ],
      "text": " Dia itu preparasinya adalah efekte sama minimax, sebenarnya kalau misalkan minimax luar gak apa-apa"
    },
    {
      "timestamp": [
        446.58,
        448.58
      ],
      "text": " Gak apa-apa?"
    },
    {
      "timestamp": [
        448.58,
        449.58
      ],
      "text": " Iya, malah gak apa-apa"
    },
    {
      "timestamp": [
        449.58,
        451.58
      ],
      "text": " Tapi kenapa perlu dilakukan?"
    },
    {
      "timestamp": [
        451.58,
        452.58
      ],
      "text": " Lebih ribet kan gitu"
    },
    {
      "timestamp": [
        452.58,
        456.58
      ],
      "text": " Karena paper yang menjadi tunjukan saya melakukan dua-duanya"
    },
    {
      "timestamp": [
        456.58,
        458.58
      ],
      "text": " apa alasannya?"
    },
    {
      "timestamp": [
        458.58,
        461.58
      ],
      "text": " alasannya adalah karena kalau misalnya FFT"
    },
    {
      "timestamp": [
        461.58,
        463.58
      ],
      "text": " yang seperti ini"
    },
    {
      "timestamp": [
        463.58,
        466.58
      ],
      "text": " kan kalau dilihat tuh udah lurus semua"
    },
    {
      "timestamp": [
        466.58,
        469.58
      ],
      "text": " terus di normasa sih jadi balik kayak bentuk aslinya laki gitu kan"
    },
    {
      "timestamp": [
        469.58,
        472.58
      ],
      "text": " kalau tadi lihat secara visualnya sih"
    },
    {
      "timestamp": [
        472.58,
        474.58
      ],
      "text": " nah sebenernya gini Bu, kalau FFT itu kan"
    },
    {
      "timestamp": [
        474.58,
        476.58
      ],
      "text": " berdasarkan penjelasan itu kan"
    },
    {
      "timestamp": [
        476.58,
        478.58
      ],
      "text": " pengen melihat kalau misalkan ada penyimakan kecil"
    },
    {
      "timestamp": [
        478.58,
        480.58
      ],
      "text": " itu kan kelihatan ya dari sini"
    },
    {
      "timestamp": [
        480.58,
        482.58
      ],
      "text": " karena berbeda banget dengan yang sebelumnya"
    },
    {
      "timestamp": [
        482.58,
        498.54
      ],
      "text": " Nah, kalau minima scalar, alasannya adalah apa? Biar skala pada seluruh datanya itu sama semua. Jadi, apa tujuannya biar sama semua, itu pada saat nanti model di-training, itu dapat men-stabilikan pelatihan."
    },
    {
      "timestamp": [
        498.66,
        511.4
      ],
      "text": " Jadi, stabilitas pelatihannya itu lebih stabil pada saat dilakukan model training. Jadi, sebenarnya alasannya adalah men-stabilikan data untuk apa? Biar membantu modelnya dalam stabilitas pelatihan."
    },
    {
      "timestamp": [
        512.58,
        523.58
      ],
      "text": " Oke, sudah dijelaskan alasannya ditambahkan normalisasinya tadi?"
    },
    {
      "timestamp": [
        523.58,
        526.58
      ],
      "text": " Yang dilaparannya. Sudah."
    },
    {
      "timestamp": [
        526.58,
        527.58
      ],
      "text": " Di bab?"
    },
    {
      "timestamp": [
        527.58,
        532.58
      ],
      "text": " Di bab, ini di halaman 21."
    },
    {
      "timestamp": [
        532.58,
        534.58
      ],
      "text": " Oh bab 2?"
    },
    {
      "timestamp": [
        534.58,
        536.58
      ],
      "text": " Iya, betul."
    },
    {
      "timestamp": [
        542.58,
        551.58
      ],
      "text": " Oke, berarti alasannya supaya tadi skalanya sama gitu ya, ditambahkan min-max."
    },
    {
      "timestamp": [
        551.58,
        561.58
      ],
      "text": " Oke, mungkin bisa dijelaskan kan datanya yang tadi kan ribuan ya, dari TXT kemudian diubah menjadi CSV."
    },
    {
      "timestamp": [
        561.58,
        562.58
      ],
      "text": " Iya betul."
    },
    {
      "timestamp": [
        562.58,
        564.58
      ],
      "text": " Gimana itu, ada mungkin datanya."
    },
    {
      "timestamp": [
        564.58,
        569.58
      ],
      "text": " Oh, jadi sebentar saya coba. Jadi sebenarnya itu kan di VS Code gitu."
    },
    {
      "timestamp": [
        569.58,
        575.58
      ],
      "text": " Atau data yang kamu dapatkan pasti di folder gitu"
    },
    {
      "timestamp": [
        579.58,
        581.58
      ],
      "text": " DTXT nya tuh gimana tertulis"
    },
    {
      "timestamp": [
        587.58,
        591.58
      ],
      "text": " Seperti ibu, jadi awalnya DTXT seperti ini"
    },
    {
      "timestamp": [
        591.58,
        595.58
      ],
      "text": " Lalu kalau kita klik, misalkan untuk yang timestamp pertama"
    },
    {
      "timestamp": [
        595.58,
        611.58
      ],
      "text": " Nah, dia totalnya ada 4 fitur, dari 1 sampai dari 4, yang mana total seluruh datanya ini adalah 20.490, yang sudah saya diselesaikan di bank 4."
    },
    {
      "timestamp": [
        611.58,
        613.58
      ],
      "text": " Oke, timestamp 1 ya?"
    },
    {
      "timestamp": [
        613.58,
        615.58
      ],
      "text": " Iya, itu untuk timestamp 1, betul."
    },
    {
      "timestamp": [
        615.58,
        618.58
      ],
      "text": " Coba yang di timestamp 2, panjangnya berarti beda lagi?"
    },
    {
      "timestamp": [
        618.58,
        619.58
      ],
      "text": " Oh, panjangnya sama semua."
    },
    {
      "timestamp": [
        619.58,
        620.58
      ],
      "text": " Panjangnya sama terus?"
    },
    {
      "timestamp": [
        620.58,
        621.58
      ],
      "text": " Iya, betul."
    },
    {
      "timestamp": [
        621.58,
        622.58
      ],
      "text": " Oke."
    },
    {
      "timestamp": [
        622.58,
        623.58
      ],
      "text": " Sama semua."
    },
    {
      "timestamp": [
        623.58,
        631.98
      ],
      "text": " Oke, terus ini kamu ekspor atau diubah ke CSV gitu ya, terus yang dimaksudkan di rata-rata absolu tadi itu yang mana?"
    },
    {
      "timestamp": [
        631.98,
        645.38
      ],
      "text": " Oh, yang di rata absolu itu adalah yang setiap ini, misalkan ini untuk yang kancen pertama mungkin, kancen pertama, jadi rata-rata absolu itu untuk setiap fitur."
    },
    {
      "timestamp": [
        645.38,
        647.38
      ],
      "text": " Ke bawah ini berarti?"
    },
    {
      "timestamp": [
        647.38,
        649.38
      ],
      "text": " Iya ke bawah, betul."
    },
    {
      "timestamp": [
        649.38,
        658.38
      ],
      "text": " Dirata-retakan sampai bering 4 dan jadilah seperti yang di rata-retakan."
    },
    {
      "timestamp": [
        658.38,
        662.38
      ],
      "text": " Oh sampai bering 4, nggak per bering gitu?"
    },
    {
      "timestamp": [
        662.38,
        672.38
      ],
      "text": " Iya, maksud saya per bering, namun maksudnya itu dirata-retakan itu bering 1 dirata-retakan di bawah, bering 2 juga sampai bering 4."
    },
    {
      "timestamp": [
        672.38,
        677.38
      ],
      "text": " Sehingga menjadi setiap timestamp hanya ada satu data."
    },
    {
      "timestamp": [
        677.38,
        680.38
      ],
      "text": " Itu kamu ulangi sampai semua timestamp tadi?"
    },
    {
      "timestamp": [
        680.38,
        682.38
      ],
      "text": " Sampai semua timestamp, betul."
    },
    {
      "timestamp": [
        682.38,
        685.38
      ],
      "text": " Terus yang divisualisasikan ini berarti yang hasil rata-ratanya gitu?"
    },
    {
      "timestamp": [
        685.38,
        693.38
      ],
      "text": " Iya betul. Jadi yang divisualisasikan itu yang hasil rata-rata dan itulah yang dipakai untuk analisis, yang di-datable."
    },
    {
      "timestamp": [
        695.38,
        700.38
      ],
      "text": " Berarti setelah di rata-rata, terus di transform tadi FFT, terus di min-max gitu ya?"
    },
    {
      "timestamp": [
        700.38,
        701.38
      ],
      "text": " Iya, sebelum di min-max."
    },
    {
      "timestamp": [
        702.38,
        719.38
      ],
      "text": " Terus tadi kan ada statement, oh iya, coba ke halaman 57 di bab 3, itu kan tahap modeling pendekatan hyperparameter tuning menggunakan metode hyperband"
    },
    {
      "timestamp": [
        719.38,
        723.38
      ],
      "text": " Hyperband tuh gimana? Di bab 2 apakah ada?"
    },
    {
      "timestamp": [
        723.38,
        729.38
      ],
      "text": " Saya pada saat itu sebenarnya udah kepikiran ngisi hyperband umat, saya belum lakukan sih"
    },
    {
      "timestamp": [
        729.38,
        731.38
      ],
      "text": " tapi ga ada step ini?"
    },
    {
      "timestamp": [
        731.38,
        733.38
      ],
      "text": " ga ada menggunakan metode hyperband?"
    },
    {
      "timestamp": [
        733.38,
        735.38
      ],
      "text": " oh, hyperband nya saya pake di codingan"
    },
    {
      "timestamp": [
        735.38,
        737.38
      ],
      "text": " cuman belum saya tulis di"
    },
    {
      "timestamp": [
        737.38,
        739.38
      ],
      "text": " 2 nya ga ada"
    },
    {
      "timestamp": [
        739.38,
        741.38
      ],
      "text": " jadi apa?"
    },
    {
      "timestamp": [
        741.38,
        743.38
      ],
      "text": " metode hyperband itu seperti apa?"
    },
    {
      "timestamp": [
        743.38,
        745.38
      ],
      "text": " jadi, bentar ini ada segitu lagi"
    },
    {
      "timestamp": [
        745.38,
        747.38
      ],
      "text": " ga ada papan lagi"
    },
    {
      "timestamp": [
        747.38,
        749.38
      ],
      "text": " oh, ada disitu papan"
    },
    {
      "timestamp": [
        749.38,
        751.38
      ],
      "text": " oh, ada disitu"
    },
    {
      "timestamp": [
        751.38,
        753.38
      ],
      "text": " tunjukkan nano nya aja"
    },
    {
      "timestamp": [
        753.38,
        755.38
      ],
      "text": " ya, apa step nya atau apa itu?"
    },
    {
      "timestamp": [
        757.38,
        755.38
      ],
      "text": ""
    },
    {
      "timestamp": [
        762.86,
        773.38
      ],
      "text": " Oh kutbulah boleh ya atau referensinya boleh kamu ngapain aja deh pertengung Hai nah jadi Hai ntar jadi atau saya pakai ini"
    },
    {
      "timestamp": [
        773.38,
        787.38
      ],
      "text": " Seperti ini harusnya kalau di bawah dua itu masuk kemana, hyperparameter tuh nih stepnya"
    },
    {
      "timestamp": [
        787.38,
        789.38
      ],
      "text": " Seharusnya iya Bu"
    },
    {
      "timestamp": [
        789.38,
        795.38
      ],
      "text": " Jadi hyperband itu yang di sini"
    },
    {
      "timestamp": [
        795.38,
        798.38
      ],
      "text": " Nah di sini itu"
    },
    {
      "timestamp": [
        802.38,
        798.38
      ],
      "text": ""
    },
    {
      "timestamp": [
        806.38,
        811.38
      ],
      "text": " nah disini itu, dia kan ada max epox nya 100 gue ya nah cuman misalkan saya mengambil skenario biar menghitungnya gampang"
    },
    {
      "timestamp": [
        811.38,
        813.38
      ],
      "text": " jadi menghitungnya gampang ini bukan gini"
    },
    {
      "timestamp": [
        813.38,
        818.38
      ],
      "text": " misalkan max epox nya saya tentukan misalkan 81"
    },
    {
      "timestamp": [
        818.38,
        823.38
      ],
      "text": " disini ada variable atau yang namanya faktor ya"
    },
    {
      "timestamp": [
        823.38,
        837.38
      ],
      "text": " Faktor di objek hyperband nya itu adalah 3. Nah jadi hyperband itu step by step nya adalah dia itu melakukan berparameter plumbing untuk setiap istilahnya itu batch."
    },
    {
      "timestamp": [
        837.38,
        851.38
      ],
      "text": " Jadi misalkan seperti ini. Untuk yang batch pertama, untuk yang batch pertama ini dia bakalan mencoba 81 model."
    },
    {
      "timestamp": [
        851.38,
        861.52
      ],
      "text": " itu bermaksudnya kombinasi hyperparameter sampai 21 cuman dia datang satu kali epok"
    },
    {
      "timestamp": [
        864.46,
        876.28
      ],
      "text": " dia dalam satu kali epok nah terus setelah itu setelah itu dia selanjutnya bakalan mencoba 27"
    },
    {
      "timestamp": [
        876.28,
        883.28
      ],
      "text": " Cuma disini dia dalam tiga tali Epoch"
    },
    {
      "timestamp": [
        883.28,
        887.28
      ],
      "text": " Nah, jadi maksudnya gimana dari 81 ke 27"
    },
    {
      "timestamp": [
        887.28,
        893.28
      ],
      "text": " Jadi dari 81 kombinasi percobaan model yang dalam satu Epoch itu"
    },
    {
      "timestamp": [
        893.28,
        896.28
      ],
      "text": " Jadi tiap model itu hanya dicoba secara Epoch"
    },
    {
      "timestamp": [
        896.28,
        901.28
      ],
      "text": " Nah, dipilih 27 model yang terbaik dari 81"
    },
    {
      "timestamp": [
        901.28,
        904.28
      ],
      "text": " Nanti setelah dipilih 27 model yang terbaik"
    },
    {
      "timestamp": [
        904.28,
        925.28
      ],
      "text": " 27 model itu dilatih sebanyak 3 epoch setiap model, lalu lanjut lagi ke 39 model, sampai menghasilkan satu model yang terbaik."
    },
    {
      "timestamp": [
        925.28,
        927.28
      ],
      "text": " Nanti ditambahkan ya hasilnya"
    },
    {
      "timestamp": [
        929.28,
        932.28
      ],
      "text": " Dan mungkin kalau ada step yang kamu masukkan disini"
    },
    {
      "timestamp": [
        932.28,
        935.28
      ],
      "text": " Sesuaikan dengan data itu ya enggak apa-apa sih di BUB3 nya"
    },
    {
      "timestamp": [
        935.28,
        937.28
      ],
      "text": " Mungkin biar lebih jelas"
    },
    {
      "timestamp": [
        941.28,
        945.28
      ],
      "text": " Nah disini kan di BUB3 itu ada pernyataan"
    },
    {
      "timestamp": [
        945.28,
        949.28
      ],
      "text": " Kalau Phi itu hyperparameter nya sama dengan I gitu ya?"
    },
    {
      "timestamp": [
        949.28,
        950.28
      ],
      "text": " Iya betul"
    },
    {
      "timestamp": [
        950.28,
        951.28
      ],
      "text": " Kenapa?"
    },
    {
      "timestamp": [
        952.28,
        953.28
      ],
      "text": " Dibuat sama"
    },
    {
      "timestamp": [
        953.28,
        954.28
      ],
      "text": " Oh itu yang BUB3 ya?"
    },
    {
      "timestamp": [
        954.28,
        959.04
      ],
      "text": " Yang ketiga saya buat sama karena memang biar adil aja gitu"
    },
    {
      "timestamp": [
        959.04,
        964.64
      ],
      "text": " Karena memang yang di duni itu hanya neuron sama yang lain-lainnya itu"
    },
    {
      "timestamp": [
        964.64,
        972.56
      ],
      "text": " Karena kan perbedaannya AI sama FI itu kalau AI itu kan dia merekonstruksi data dari input terus yaudah gak ada pendekatan probabilistik"
    },
    {
      "timestamp": [
        972.56,
        976.48
      ],
      "text": " Kalau FI itu ada pendekatan probabilistik jadi bedanya itu luang"
    },
    {
      "timestamp": [
        976.48,
        983.08
      ],
      "text": " Tapi sebenarnya dalam perlakihan parameternya itu dalam hyperparameternya itu sebenarnya sama aja"
    },
    {
      "timestamp": [
        983.08,
        989.08
      ],
      "text": " Jadi biar seimbang di sini yang saya buat sekarang ini."
    },
    {
      "timestamp": [
        993.08,
        998.08
      ],
      "text": " Terus, oh ya mungkin saran berarti di judul caption-nya ditambahkan aja."
    },
    {
      "timestamp": [
        998.08,
        1001.08
      ],
      "text": " Berarti haber parameter untuk AI dan VAI."
    },
    {
      "timestamp": [
        1001.08,
        1004.08
      ],
      "text": " Caption-nya kan kamu hanya AI."
    },
    {
      "timestamp": [
        1006.08,
        1011.08
      ],
      "text": " Terus di halaman 61, di kalimat awal atas sendiri,"
    },
    {
      "timestamp": [
        1011.08,
        1018.68
      ],
      "text": " Sekaligus mempertahankan dinamika adversarial yang sehat antara generator dan diskriminator"
    },
    {
      "timestamp": [
        1018.68,
        1020.08
      ],
      "text": " Maksudnya yang sehat disini itu?"
    },
    {
      "timestamp": [
        1020.08,
        1022.08
      ],
      "text": " Itu yang mana?"
    },
    {
      "timestamp": [
        1022.08,
        1026.08
      ],
      "text": " Yang atas sendiri, baris kedua, halaman 61"
    },
    {
      "timestamp": [
        1026.08,
        1030.08
      ],
      "text": " Oh maksudnya, maksudnya yang sehat itu yang baik gitu loh"
    },
    {
      "timestamp": [
        1030.08,
        1036.08
      ],
      "text": " Jadi mempertahankan dinamika adversarial itu kan pokoknya generator sama diskriminator"
    },
    {
      "timestamp": [
        1036.08,
        1038.08
      ],
      "text": " Istilahnya kayak saling perang gitu kan"
    },
    {
      "timestamp": [
        1038.08,
        1042.08
      ],
      "text": " sampai menghasilkan generator yang terbaik, generator yang terbaik."
    },
    {
      "timestamp": [
        1042.08,
        1047.08
      ],
      "text": " Jadi yang sehat itu maksudnya yang bagus itu, yang benar-benar proper."
    },
    {
      "timestamp": [
        1048.08,
        1051.08
      ],
      "text": " Oke, mungkin nanti kalimatnya disesuaikan aja ya, maksudnya apa."
    },
    {
      "timestamp": [
        1051.08,
        1052.08
      ],
      "text": " Ya, sehat di sini."
    },
    {
      "timestamp": [
        1059.08,
        1060.08
      ],
      "text": " Oke, ke halaman 64."
    },
    {
      "timestamp": [
        1060.08,
        1064.08
      ],
      "text": " Di situ ada anomali threshold ya, dihitung ya ini berarti."
    },
    {
      "timestamp": [
        1064.08,
        1065.08
      ],
      "text": " Bagaimana?"
    },
    {
      "timestamp": [
        1065.08,
        1068.38
      ],
      "text": " Yang Anomaly Threshold Calculation"
    },
    {
      "timestamp": [
        1068.38,
        1069.22
      ],
      "text": " Sudah ketemu"
    },
    {
      "timestamp": [
        1069.22,
        1077.72
      ],
      "text": " Nah disitu ada yang mana threshold yang dipilih adalah nilai maksimum dari bar paling kanan yang berdekatan secara kontinu tanpa jeda atau patahan"
    },
    {
      "timestamp": [
        1077.72,
        1081.82
      ],
      "text": " Kenapa milihnya bar paling kanan dan seperti itu"
    },
    {
      "timestamp": [
        1081.82,
        1086.74
      ],
      "text": " Nah itu sebenarnya ada di paper referensi"
    },
    {
      "timestamp": [
        1086.74,
        1089.16
      ],
      "text": " Jadi kalau di paper referensi itu yang ini"
    },
    {
      "timestamp": [
        1089.16,
        1089.76
      ],
      "text": " Sebentar"
    },
    {
      "timestamp": [
        1089.76,
        1092.12
      ],
      "text": " Itu yang ini"
    },
    {
      "timestamp": [
        1092.12,
        1098.12
      ],
      "text": " Nah, jadi ini tuh merupakan hasil penelitian dari si Sulayman"
    },
    {
      "timestamp": [
        1098.12,
        1103.12
      ],
      "text": " Dia di sini menghasilkan result anomali itu sebesar 0,126"
    },
    {
      "timestamp": [
        1103.12,
        1105.12
      ],
      "text": " Yang mana itu 0,126?"
    },
    {
      "timestamp": [
        1105.12,
        1111.12
      ],
      "text": " Nah, 0,126 ini kalau dilihat dari sini, itu adalah berada di sini"
    },
    {
      "timestamp": [
        1111.12,
        1117.12
      ],
      "text": " Yang mana di sini itu adalah merupakan bar yang paling kanan dari sepatu, dari histogram ini"
    },
    {
      "timestamp": [
        1117.12,
        1123.52
      ],
      "text": " Nah, dia seharusnya kan bisa-bisa aja ngambil yang disini"
    },
    {
      "timestamp": [
        1123.52,
        1126.52
      ],
      "text": " Karena kan distribusinya masih sampai disini kan"
    },
    {
      "timestamp": [
        1126.52,
        1131.72
      ],
      "text": " Cuman penelitian ini itu ngambilnya di yang berpalingan 6,126"
    },
    {
      "timestamp": [
        1131.72,
        1134.52
      ],
      "text": " Karena biar tidak terlalu outlier"
    },
    {
      "timestamp": [
        1134.52,
        1137.92
      ],
      "text": " Karena kalau yang disini kan ngambilnya terlalu outlier banget gitu"
    },
    {
      "timestamp": [
        1137.92,
        1146.52
      ],
      "text": " Jadi nanti kalau terlalu outlier banget, takutnya modelnya itu dalam mendeteksi anomali secara dini itu kurang proper"
    },
    {
      "timestamp": [
        1146.52,
        1153.52
      ],
      "text": " Jadi oleh karena itu di penelitian ini mengambilnya yang di sini."
    },
    {
      "timestamp": [
        1153.52,
        1160.52
      ],
      "text": " 0,126 itu berarti apakah nilai yang sudah di FFT kan tadi di transform dan di min-max scalar?"
    },
    {
      "timestamp": [
        1160.52,
        1167.52
      ],
      "text": " Nah 0,126 itu adalah hasil recursion error, hasil recursion error nya."
    },
    {
      "timestamp": [
        1167.52,
        1178.52
      ],
      "text": " Jadi setelah memodelkan, terus hasil prediksi data dikurangi dengan hasil input awal"
    },
    {
      "timestamp": [
        1178.52,
        1185.52
      ],
      "text": " Soalnya kalau histogram, itu kan kita bisa menentukan binnya atau kotaknya"
    },
    {
      "timestamp": [
        1185.52,
        1190.52
      ],
      "text": " Nah tergantung kita kalau banyak, eh kita mau tentukan kotaknya banyak atau sedikit"
    },
    {
      "timestamp": [
        1190.52,
        1193.52
      ],
      "text": " Gimana kita justifikasinya, itu kotak yang terakhir"
    },
    {
      "timestamp": [
        1193.52,
        1197.52
      ],
      "text": " itu kan tergantung dari kita menentukan seberapa banyak bin yang mau kita buat"
    },
    {
      "timestamp": [
        1197.52,
        1201.02
      ],
      "text": " jadi apakah mungkin ada ukuran tertentu misal kayak di boxplot"
    },
    {
      "timestamp": [
        1201.02,
        1207.02
      ],
      "text": " di boxplot itu kan misal ada berapa kali IKR atau seperti apa itu dikatakan supplier misalnya"
    },
    {
      "timestamp": [
        1207.02,
        1213.02
      ],
      "text": " nah apakah mungkin ada justifikasi lain bar nya ini seperti apa"
    },
    {
      "timestamp": [
        1213.02,
        1216.02
      ],
      "text": " seberapa banyak bin yang dibuat itu kan juga mempengaruhi nanti"
    },
    {
      "timestamp": [
        1216.02,
        1219.52
      ],
      "text": " karena Instagram kan tergantung dari bin yang mau kita buat juga"
    },
    {
      "timestamp": [
        1219.52,
        1225.52
      ],
      "text": " Nah sebenarnya saya memang kenapa kok menentukan thresholdnya pakai metode seperti ini"
    },
    {
      "timestamp": [
        1225.52,
        1229.52
      ],
      "text": " Jadi sebenarnya saya di codingan itu sudah mencoba 3 metode thresholdnya"
    },
    {
      "timestamp": [
        1229.52,
        1238.52
      ],
      "text": " Jadi yang pertama itu adalah saya menggunakan K dikali standard deviasi dari data reconciliation errorsnya"
    },
    {
      "timestamp": [
        1238.52,
        1242.52
      ],
      "text": " Nah itu ternyata di awal-awal itu kalau banyaknya anomali"
    },
    {
      "timestamp": [
        1242.52,
        1245.52
      ],
      "text": " Padahal harusnya tidak anomali gitu, jadi sangat-sangat tidak make sense"
    },
    {
      "timestamp": [
        1245.52,
        1256.52
      ],
      "text": " Terus metode yang kedua, dari paper juga sama, itu metodenya adalah karena yang awalnya tadi K x standard deviation aja, ini ditambahin MEAN tambah K x standard deviation"
    },
    {
      "timestamp": [
        1256.52,
        1264.52
      ],
      "text": " Yang mana kalau dari saya setika itu sebutannya adalah Trisigma"
    },
    {
      "timestamp": [
        1264.52,
        1273.52
      ],
      "text": " Itu saya juga sudah coba, namun masih di tengah-tengah itu masih banyak yang anomali juga"
    },
    {
      "timestamp": [
        1273.52,
        1279.12
      ],
      "text": " Dan misal saya coba ini, ini yang merupakan paling make sense dari hasilnya."
    },
    {
      "timestamp": [
        1279.12,
        1285.72
      ],
      "text": " Kenapa nggak pakai 6 sigma? 6 sigma berarti 6 standard deviasi."
    },
    {
      "timestamp": [
        1285.72,
        1292.92
      ],
      "text": " Oh itu saya belum coba sih, karena memang referensi paper saya itu kebanyakan selalu kanya itu 3."
    },
    {
      "timestamp": [
        1292.92,
        1300.32
      ],
      "text": " Sebenarnya 3, kalau 2 itu biasanya dari 1,96."
    },
    {
      "timestamp": [
        1300.32,
        1305.32
      ],
      "text": " coba aja nanti dicari sebenernya tiga standar deviasi itu berarti berapa tingkat kepercayaannya"
    },
    {
      "timestamp": [
        1305.32,
        1310.32
      ],
      "text": " kan kamu udah belajar seperti normal itu loh kalau 95% berarti kan 1,96"
    },
    {
      "timestamp": [
        1310.32,
        1318.32
      ],
      "text": " ya kan 5% dan kanan kiri berarti kan itu kalau biasanya didekatinnya memang 2 sigma"
    },
    {
      "timestamp": [
        1318.32,
        1326.32
      ],
      "text": " nah kalau 3 sigma itu berarti berapa berarti artinya lebih lebar lagi ke kanan ya berarti 2 koma atau 3 koma"
    },
    {
      "timestamp": [
        1326.32,
        1350.58
      ],
      "text": " 6, berarti itu sebenarnya, biasanya kalau di industri saya ingat saya, kalau stigma itu berarti 0 defect, jadi nggak ada defect, itu sangat kecil, ya mungkin tadi itu, jadi ke outlier-nya, mungkin bisa dikurangin lagi ke 5 stigma, misal, soalnya, nah apa justifikasi bar yang terakhir itu, ini apakah bar-nya itu ber-default-nya atau kamu tentukan BIM yang dibentuk, gimana, Azal?"
    },
    {
      "timestamp": [
        1350.58,
        1351.74
      ],
      "text": " Kalau saya, sebentar."
    },
    {
      "timestamp": [
        1356.32,
        1365.66
      ],
      "text": " Jadi saya tentukan NBIC-nya 20"
    },
    {
      "timestamp": [
        1365.66,
        1367.06
      ],
      "text": " Kenapa kok 20?"
    },
    {
      "timestamp": [
        1367.98,
        1372.06
      ],
      "text": " NBIC-nya 20 itu sebenarnya saya juga tidak ingin sih"
    },
    {
      "timestamp": [
        1372.06,
        1374.96
      ],
      "text": " Cuma meskipun saya tentukan NBIC-nya 20"
    },
    {
      "timestamp": [
        1374.96,
        1378.82
      ],
      "text": " Cuma yang dihasilkan juga NBIC-nya juga enggak 20"
    },
    {
      "timestamp": [
        1378.82,
        1381.12
      ],
      "text": " Berapa itu berarti?"
    },
    {
      "timestamp": [
        1382.12,
        1384.1
      ],
      "text": " Jadi dari sini"
    },
    {
      "timestamp": [
        1384.1,
        1388.1
      ],
      "text": " Yang lainnya saat kecil itu"
    },
    {
      "timestamp": [
        1388.1,
        1390.1
      ],
      "text": " Iya makanya"
    },
    {
      "timestamp": [
        1390.1,
        1392.1
      ],
      "text": " Nah, sebenarnya kan"
    },
    {
      "timestamp": [
        1392.1,
        1395.1
      ],
      "text": " English yang paling kanan itu yang ini"
    },
    {
      "timestamp": [
        1395.1,
        1397.1
      ],
      "text": " Jadi maksud saya tadi tidak ada patahan"
    },
    {
      "timestamp": [
        1397.1,
        1401.1
      ],
      "text": " Patahan itu berarti kan dia menandakan sebenarnya garis"
    },
    {
      "timestamp": [
        1401.1,
        1404.1
      ],
      "text": " Garis yang sama kayak tadi di PPT itu"
    },
    {
      "timestamp": [
        1404.1,
        1408.1
      ],
      "text": " Itu sebenarnya kan kalau kamu belajar histogram itu kan kelas kan"
    },
    {
      "timestamp": [
        1408.1,
        1411.1
      ],
      "text": " Kelas interval, masuk kelas interval berapa gitu kan"
    },
    {
      "timestamp": [
        1411.1,
        1419.1
      ],
      "text": " Nah itu nanti harus menunjukkan, kenapa jasifrasinya 20 atau seperti apa membentuk binnya itu"
    },
    {
      "timestamp": [
        1419.1,
        1422.1
      ],
      "text": " Karena itu kan nanti sebagai patokan, bukan thresholdnya"
    },
    {
      "timestamp": [
        1422.1,
        1426.1
      ],
      "text": " Kalau diperkecil berarti kan bisa jadi lebih ke kiri atau seperti apa"
    },
    {
      "timestamp": [
        1426.1,
        1430.1
      ],
      "text": " Oke, terus"
    },
    {
      "timestamp": [
        1430.1,
        1437.1
      ],
      "text": " Nah kalau dari gambar, itu kok yang orange tiba-tiba tidak ada itu apakah ketutupan dengan warna yang lain ya?"
    },
    {
      "timestamp": [
        1437.1,
        1442.34
      ],
      "text": " Yang biring kedua, yang di gambar 4.6"
    },
    {
      "timestamp": [
        1442.34,
        1446.96
      ],
      "text": " Atau ada informasi yang belum saya baca"
    },
    {
      "timestamp": [
        1446.96,
        1453.94
      ],
      "text": " Di halaman 70, itu kan warnanya yang ada, sisa biru, hijau, hitam"
    },
    {
      "timestamp": [
        1453.94,
        1460.84
      ],
      "text": " Jadi memang data hasil transformasinya, saya cek lagi, itu sama"
    },
    {
      "timestamp": [
        1460.84,
        1463.5
      ],
      "text": " Berarti yang oranye sama dengan apa?"
    },
    {
      "timestamp": [
        1463.5,
        1465.88
      ],
      "text": " ini Bu, disini"
    },
    {
      "timestamp": [
        1465.88,
        1475.0
      ],
      "text": " nah ini"
    },
    {
      "timestamp": [
        1475.0,
        1477.52
      ],
      "text": " kalau saya cuma klik"
    },
    {
      "timestamp": [
        1477.52,
        1481.5
      ],
      "text": " berarti hitam ya"
    },
    {
      "timestamp": [
        1481.5,
        1482.08
      ],
      "text": " bearing 4"
    },
    {
      "timestamp": [
        1482.08,
        1483.6
      ],
      "text": " sama dengan yang hitam"
    },
    {
      "timestamp": [
        1483.6,
        1486.18
      ],
      "text": " bearing 2 sama dengan si bearing 4"
    },
    {
      "timestamp": [
        1486.18,
        1487.12
      ],
      "text": " nah itu"
    },
    {
      "timestamp": [
        1487.12,
        1489.98
      ],
      "text": " sepertinya belum dimasukkan ke sini ya"
    },
    {
      "timestamp": [
        1489.98,
        1491.76
      ],
      "text": " di narasinya"
    },
    {
      "timestamp": [
        1491.76,
        1493.02
      ],
      "text": " sudah dijelaskan belum?"
    },
    {
      "timestamp": [
        1493.14,
        1493.02
      ],
      "text": ""
    },
    {
      "timestamp": [
        1501.34,
        1505.38
      ],
      "text": " Maksudnya kan enggak ada. Yang dijelaskan hanya di piring satu, dia tuh paling di atas gitu kan indenya, paling stagel. Ngarit ditambahkan ya, karena kok enggak ada yang orange, sama dengan warna yang mana gitu."
    },
    {
      "timestamp": [
        1505.38,
        1506.38
      ],
      "text": " Baik ya."
    },
    {
      "timestamp": [
        1506.38,
        1507.38
      ],
      "text": " Oke."
    },
    {
      "timestamp": [
        1512.78,
        1520.22
      ],
      "text": " Terus ke halaman 74, di bagian atasnya tabel 4.2."
    },
    {
      "timestamp": [
        1521.74,
        1520.22
      ],
      "text": ""
    },
    {
      "timestamp": [
        1529.3,
        1535.76
      ],
      "text": " Nah, disitu kan ada statement nilai latent dimension yang cukup besar membantu model menangkap pola kompleks dalam data Sedangkan learning rate yang moderat memastikan model tidak terjebak pada lokal minimum dan cepat konvergen"
    },
    {
      "timestamp": [
        1535.76,
        1540.4
      ],
      "text": " Yang disini learning rate yang moderat itu yang sebesar berapa"
    },
    {
      "timestamp": [
        1540.4,
        1547.4
      ],
      "text": " Jadi kalau learning rate yang moderat itu, ini kan saya mencoba skenario-nya kan"
    },
    {
      "timestamp": [
        1547.4,
        1561.4
      ],
      "text": " 0,01 tadi ada yang 0,01 terus ada yang 0,005 maksudnya moderate itu yang tidak terlalu kecil dan juga tidak terlalu besar gitu"
    },
    {
      "timestamp": [
        1561.4,
        1565.4
      ],
      "text": " yang mana itu maksudnya di tengah-tengah gitu moderate"
    },
    {
      "timestamp": [
        1565.4,
        1572.4
      ],
      "text": " di tengah-tengah berarti yang mana 0,005 tadi? 0,0"
    },
    {
      "timestamp": [
        1572.4,
        1582.4
      ],
      "text": " Oh kalau kecil kan berarti yang 0,001 itu ya kecil?"
    },
    {
      "timestamp": [
        1582.4,
        1585.4
      ],
      "text": " 0,001 itu dia paling besar ya?"
    },
    {
      "timestamp": [
        1585.4,
        1588.4
      ],
      "text": " Yang paling besar apa yang kecil?"
    },
    {
      "timestamp": [
        1588.4,
        1591.4
      ],
      "text": " 0,001 itu besar-besar paling besar"
    },
    {
      "timestamp": [
        1591.4,
        1592.4
      ],
      "text": " Ya paling besar"
    },
    {
      "timestamp": [
        1592.4,
        1597.4
      ],
      "text": " Terus 0,005 itu dia yang paling kecil"
    },
    {
      "timestamp": [
        1597.4,
        1608.4
      ],
      "text": " ya terus yang 0,0001 dia yang paling tengah-tengah"
    },
    {
      "timestamp": [
        1608.4,
        1614.4
      ],
      "text": " bener, tengah-tengahnya 0,0001"
    },
    {
      "timestamp": [
        1614.4,
        1617.4
      ],
      "text": " nah ini berarti tengah-tengahnya tergantung kita dong"
    },
    {
      "timestamp": [
        1617.4,
        1623.4
      ],
      "text": " kalau saya settingnya 0,01 0,05 0,1 berarti yang moderatnya beda lagi"
    },
    {
      "timestamp": [
        1623.4,
        1649.5
      ],
      "text": " ini bukan secara umum iya karena secara umum gimana menentukan modelnya terus terjebak pada"
    },
    {
      "timestamp": [
        1649.5,
        1652.5
      ],
      "text": " lokal minimum maksudnya, gimana lokal minimum disini tuh?"
    },
    {
      "timestamp": [
        1652.5,
        1656.5
      ],
      "text": " maksudnya lokal, jadi kan kalo misalkan"
    },
    {
      "timestamp": [
        1656.5,
        1660.5
      ],
      "text": " apa namanya, bentar, saya lupa, oh ini, apa namanya, optimizer"
    },
    {
      "timestamp": [
        1660.5,
        1663.5
      ],
      "text": " nah optimizer itu kan adalah Adam dan lain-lainnya"
    },
    {
      "timestamp": [
        1663.5,
        1667.5
      ],
      "text": " nah kan karena model dilatih, karena ada optimizer nya itu"
    },
    {
      "timestamp": [
        1667.5,
        1672.5
      ],
      "text": " berarti ada lokal minimum dan juga global minimum"
    },
    {
      "timestamp": [
        1672.5,
        1675.5
      ],
      "text": " maksudnya tidak terlibat di lokal minimum itu"
    },
    {
      "timestamp": [
        1675.5,
        1678.5
      ],
      "text": " artinya model lu tidak hanya"
    },
    {
      "timestamp": [
        1678.5,
        1682.0
      ],
      "text": " Maksudnya, ngetrain-nya itu tidak di lokal minimum beruang"
    },
    {
      "timestamp": [
        1682.0,
        1684.1
      ],
      "text": " Apa yang terjadi kalau di lokal minimum beruang?"
    },
    {
      "timestamp": [
        1684.1,
        1686.4
      ],
      "text": " Maka modelnya hanya menghasilkan itu-itu aja"
    },
    {
      "timestamp": [
        1686.4,
        1690.0
      ],
      "text": " Modelnya tidak meng-improve, artinya errornya tidak menurun"
    },
    {
      "timestamp": [
        1690.0,
        1692.5
      ],
      "text": " Dan terjebak di itu-itu aja"
    },
    {
      "timestamp": [
        1692.5,
        1696.0
      ],
      "text": " Berarti harapannya dia jadi global minimum gitu?"
    },
    {
      "timestamp": [
        1696.0,
        1704.0
      ],
      "text": " Dia harapannya lebih ke.. ya pokoknya hasilnya itu modelnya itu mengalami penurunan errornya"
    },
    {
      "timestamp": [
        1704.0,
        1711.0
      ],
      "text": " bener-bener proper, bener-bener menurun, tidak pada suatu saat itu dia"
    },
    {
      "timestamp": [
        1711.0,
        1718.0
      ],
      "text": " apa ya, loss sama pallidation loss nya itu, si error nya itu tidak stabil doang, tapi dia bener-bener menurun"
    },
    {
      "timestamp": [
        1718.0,
        1723.0
      ],
      "text": " ini kan sebenernya di istilah, kayaknya jika kulus ya"
    },
    {
      "timestamp": [
        1723.0,
        1727.0
      ],
      "text": " total minimum, ini optimasi kan"
    },
    {
      "timestamp": [
        1727.0,
        1732.0
      ],
      "text": " oke, jadi harapannya dia itu bener-bener yang paling minimum secara seluruhan di semua nilai"
    },
    {
      "timestamp": [
        1732.0,
        1733.0
      ],
      "text": " iya betul"
    },
    {
      "timestamp": [
        1733.0,
        1735.0
      ],
      "text": " Oke"
    },
    {
      "timestamp": [
        1738.0,
        1741.0
      ],
      "text": " Kemudian terus, ini yang di bagian visualisasi yang"
    },
    {
      "timestamp": [
        1741.0,
        1743.0
      ],
      "text": " Car"
    },
    {
      "timestamp": [
        1744.0,
        1746.0
      ],
      "text": " Donat"
    },
    {
      "timestamp": [
        1746.0,
        1748.0
      ],
      "text": " Kenapa kamu pakai donat?"
    },
    {
      "timestamp": [
        1748.0,
        1750.0
      ],
      "text": " Pai car juga ya?"
    },
    {
      "timestamp": [
        1750.0,
        1752.0
      ],
      "text": " Bukan pai, donat bukan"
    },
    {
      "timestamp": [
        1752.0,
        1756.0
      ],
      "text": " Kan ada yang gak ada tengahnya, ada yang ada tengahnya"
    },
    {
      "timestamp": [
        1756.0,
        1758.0
      ],
      "text": " Kenapa pakai yang itu?"
    },
    {
      "timestamp": [
        1758.0,
        1762.0
      ],
      "text": " Karena cuma melihat 2 desi data dari 2 proporsi"
    },
    {
      "timestamp": [
        1762.0,
        1768.98
      ],
      "text": " kan ada yang gak ada tengahnya"
    },
    {
      "timestamp": [
        1768.98,
        1770.84
      ],
      "text": " oh maksudnya yang gitu"
    },
    {
      "timestamp": [
        1770.84,
        1775.02
      ],
      "text": " ya sudah itu"
    },
    {
      "timestamp": [
        1775.02,
        1776.82
      ],
      "text": " baik, terima kasih"
    },
    {
      "timestamp": [
        1776.82,
        1781.68
      ],
      "text": " oke, terima kasih"
    },
    {
      "timestamp": [
        1781.68,
        1783.76
      ],
      "text": " selanjutnya silahkan"
    },
    {
      "timestamp": [
        1783.76,
        1786.46
      ],
      "text": " terima kasih"
    },
    {
      "timestamp": [
        1786.46,
        1788.94
      ],
      "text": " karena beberapa pertanyaan saya sudah ditadak"
    },
    {
      "timestamp": [
        1788.94,
        1790.86
      ],
      "text": " jadi silahkan"
    },
    {
      "timestamp": [
        1790.86,
        1793.86
      ],
      "text": " dengan presisi Bu Indah nanti ke Bu Indah"
    },
    {
      "timestamp": [
        1793.86,
        1794.86
      ],
      "text": " hahaha"
    },
    {
      "timestamp": [
        1794.86,
        1795.86
      ],
      "text": " udah usah kesayang"
    },
    {
      "timestamp": [
        1795.86,
        1797.86
      ],
      "text": " gak saya ulang lagi pertanyaannya"
    },
    {
      "timestamp": [
        1797.86,
        1798.86
      ],
      "text": " eee"
    },
    {
      "timestamp": [
        1801.86,
        1802.86
      ],
      "text": " oke"
    },
    {
      "timestamp": [
        1802.86,
        1803.86
      ],
      "text": " eee"
    },
    {
      "timestamp": [
        1807.86,
        1809.86
      ],
      "text": " sebelum saya membahas ini"
    },
    {
      "timestamp": [
        1809.86,
        1812.86
      ],
      "text": " sebenarnya saya lebih suka membaca laporan kamu"
    },
    {
      "timestamp": [
        1812.86,
        1814.86
      ],
      "text": " terdapatnya melihat presentasi kamu"
    },
    {
      "timestamp": [
        1814.86,
        1815.86
      ],
      "text": " sejujurnya"
    },
    {
      "timestamp": [
        1815.86,
        1817.86
      ],
      "text": " aku terlalu kecil"
    },
    {
      "timestamp": [
        1817.86,
        1831.2
      ],
      "text": " Oke, nanti beberapa minor revisi nanti silahkan baca yang sudah saya tandai di sini."
    },
    {
      "timestamp": [
        1831.2,
        1838.38
      ],
      "text": " Nanti ketika bimbingan revisi, kalau dinyatakan lulus oleh Pak Ajis nanti silahkan ini dibawa ketika saya."
    },
    {
      "timestamp": [
        1839.38,
        1838.38
      ],
      "text": ""
    },
    {
      "timestamp": [
        1852.04,
        1852.82
      ],
      "text": " Oke, secara keseluruhan, bab 1 sudah sangat baik, sudah jelas apa tujuannya, kemudian organisinya apa di PPT, jadi tadi juga sudah ada."
    },
    {
      "timestamp": [
        1860.12,
        1871.04
      ],
      "text": " Kemudian tadi sudah dibahas juga oleh Bu Indah pertanyaan tentang FFT, kemudian Minmak Skyler juga sudah dibahas tadi. Nah, untuk LSTM saya rasa tidak masalah karena kamu sebenarnya kan hanya membandingkan LSTM AE, VAE, dan segala-galanya gitu."
    },
    {
      "timestamp": [
        1871.62,
        1877.1
      ],
      "text": " Kemudian kamu menambah sedikit kontribusi baru di anomaly detection, ya kan ya."
    },
    {
      "timestamp": [
        1877.9,
        1880.62
      ],
      "text": " Saya mau dijelaskan dong tentang anomaly detection."
    },
    {
      "timestamp": [
        1881.58,
        1889.0
      ],
      "text": " Sebenarnya apa sih yang dikatakan anomaly di sini, normal itu seperti apa, anomal itu seperti apa,"
    },
    {
      "timestamp": [
        1889.0,
        1891.6
      ],
      "text": " dan prosesnya kamu untuk mendapatkan"
    },
    {
      "timestamp": [
        1891.6,
        1892.88
      ],
      "text": " anomali dari data kamu"
    },
    {
      "timestamp": [
        1892.88,
        1895.36
      ],
      "text": " ya jadi sebenarnya"
    },
    {
      "timestamp": [
        1895.36,
        1897.2
      ],
      "text": " kalau dari anomali detection itu sendiri"
    },
    {
      "timestamp": [
        1897.2,
        1899.2
      ],
      "text": " bagaimana kita bisa mereteksi"
    },
    {
      "timestamp": [
        1899.2,
        1901.46
      ],
      "text": " apa ya, kayak penjimpangan"
    },
    {
      "timestamp": [
        1901.46,
        1903.18
      ],
      "text": " suatu data, maksudnya penjimpangan"
    },
    {
      "timestamp": [
        1903.18,
        1904.74
      ],
      "text": " suatu data itu ketika"
    },
    {
      "timestamp": [
        1904.74,
        1907.54
      ],
      "text": " kita sudah tahu suatu threshold anomali"
    },
    {
      "timestamp": [
        1907.54,
        1909.52
      ],
      "text": " maka ketika ada data point"
    },
    {
      "timestamp": [
        1909.52,
        1911.42
      ],
      "text": " yang di atas threshold anomali"
    },
    {
      "timestamp": [
        1911.42,
        1913.18
      ],
      "text": " maka disitulah"
    },
    {
      "timestamp": [
        1913.18,
        1915.72
      ],
      "text": " terjadi anomali detection"
    },
    {
      "timestamp": [
        1915.72,
        1917.12
      ],
      "text": " artinya ada anomali"
    },
    {
      "timestamp": [
        1917.12,
        1923.12
      ],
      "text": " Oke, saya tolong dulu. Berarti dari awal kamu sudah mengetahui kalau ada anomali di data kamu?"
    },
    {
      "timestamp": [
        1923.12,
        1933.12
      ],
      "text": " Ya, jadi seperti ini Bu. Jadi pada dataset EMS Bearing ini, yang di set 3, itu memang pada dokumentasi dataset EMS Bearing,"
    },
    {
      "timestamp": [
        1933.12,
        1941.12
      ],
      "text": " yang mana nih dokumentasinya ada di NASA dan juga ada perhatiannya juga, itu bilang bahwa memang di akhir-akhir."
    },
    {
      "timestamp": [
        1941.12,
        1949.12
      ],
      "text": " Jadi kan data set image bearing ini merupakan data set yang dilakukan eksperimen test to failure"
    },
    {
      "timestamp": [
        1949.12,
        1959.12
      ],
      "text": " Artinya, si bearing itu dijalankan eksperimennya sampai menuju tahap dia mengalami kegagalan, failure"
    },
    {
      "timestamp": [
        1959.12,
        1968.12
      ],
      "text": " Memang di dokumentasinya, sama penelitian-penelitian yang saya baca, di akhir-akhir pengujian"
    },
    {
      "timestamp": [
        1968.12,
        1973.22
      ],
      "text": " itu memang si data set EMS Bearing ini ada kendala faulty"
    },
    {
      "timestamp": [
        1973.22,
        1977.22
      ],
      "text": " yaitu kendala anomali pada si data set EMS Bearing ini"
    },
    {
      "timestamp": [
        1977.22,
        1985.52
      ],
      "text": " Jadi kita mengetahui bahwa suatu data set EMS Bearing ini anomali atau faulty itu dari dokumentasinya itu sendiri"
    },
    {
      "timestamp": [
        1985.52,
        1994.12
      ],
      "text": " Jadi sebenarnya sudah tahu ya kalau ada kategori termasuk faulty atau failure di data tersebut"
    },
    {
      "timestamp": [
        1994.12,
        1998.12
      ],
      "text": " Betul, tapi tidak diketahui label ground root nya"
    },
    {
      "timestamp": [
        1998.12,
        2007.12
      ],
      "text": " Oh oke, jadi tujuan kamu untuk mendeteksi anomali setelah selesai proses LSTM adalah?"
    },
    {
      "timestamp": [
        2007.12,
        2021.12
      ],
      "text": " Selesai proses LSTM adalah saya dapat benar-benar mengetahui di data yang mana suatu sinyal ini atau suatu sinyal itu benar-benar mengalami anomali"
    },
    {
      "timestamp": [
        2021.12,
        2030.12
      ],
      "text": " di timestamp keberapa, suatu data musim ini yang C3 ini benar-benar mengalami kegagalan secara penuh, gitu, seperti itu"
    },
    {
      "timestamp": [
        2030.12,
        2040.12
      ],
      "text": " Oke, untuk skenario anomalinya, karena disini kan ditabatil suatu data IMS1 itu kan ada timestamp, bering 1, bering 2, bering 3, bering 4"
    },
    {
      "timestamp": [
        2040.12,
        2046.12
      ],
      "text": " berarti yang kamu jadikan patokan adalah timestampnya, atau bering 1, 2, 3, 4?"
    },
    {
      "timestamp": [
        2046.12,
        2048.12
      ],
      "text": " Maksudnya patokan bagaimana?"
    },
    {
      "timestamp": [
        2048.12,
        2055.12
      ],
      "text": " Yang melandasi kamu, oh ini tuh anomali, faulty atau failure"
    },
    {
      "timestamp": [
        2056.12,
        2060.12
      ],
      "text": " Oh iya, jadi emang yang saya jadikan patokan adalah si time time-nya"
    },
    {
      "timestamp": [
        2060.12,
        2064.12
      ],
      "text": " Karena kan nilai data pada setiap beding itu, itu nilai sinyalnya"
    },
    {
      "timestamp": [
        2064.12,
        2067.12
      ],
      "text": " Apakah sinyal yang mengalami kenaikan di time-time segini?"
    },
    {
      "timestamp": [
        2067.12,
        2069.12
      ],
      "text": " Nah jadi seperti itu patokannya"
    },
    {
      "timestamp": [
        2070.12,
        2074.12
      ],
      "text": " Oh iya, sebelum saya balik ke anomalization"
    },
    {
      "timestamp": [
        2074.12,
        2079.12
      ],
      "text": " Tabel 3.1 itu kan ini sebenarnya hasil konversi kamu enggak sih?"
    },
    {
      "timestamp": [
        2079.12,
        2080.12
      ],
      "text": " Iya."
    },
    {
      "timestamp": [
        2080.12,
        2081.12
      ],
      "text": " Datang mentahnya enggak ada?"
    },
    {
      "timestamp": [
        2081.12,
        2083.12
      ],
      "text": " Datang mentahnya yang teksin."
    },
    {
      "timestamp": [
        2083.12,
        2086.12
      ],
      "text": " Iya udah, tapi yang teksin aja dulu untuk yang tabel 3.1."
    },
    {
      "timestamp": [
        2086.12,
        2093.12
      ],
      "text": " Karena kalau 3.1 ini salah persis dengan gambar 4.2."
    },
    {
      "timestamp": [
        2093.12,
        2100.12
      ],
      "text": " Jadi kamu masukkan saja misalnya potongan teksin itu, ini data mentahnya."
    },
    {
      "timestamp": [
        2100.12,
        2105.38
      ],
      "text": " Kemudian bentuk setelah di rekonstruksi atau dikonsersi itu seperti ini"
    },
    {
      "timestamp": [
        2105.38,
        2118.14
      ],
      "text": " Oke, kemudian lanjut bentuk anomalinya kamu apa-apa setelah kamu mengetahui dari itu ada faulty, normal, atau failurenya"
    },
    {
      "timestamp": [
        2118.14,
        2125.64
      ],
      "text": " Kemudian dengan metode apa approach-nya anomalinya itu bisa dijelaskan"
    },
    {
      "timestamp": [
        2125.64,
        2132.24
      ],
      "text": " Untuk operasinya sendiri, ini maksudnya adalah untuk menentukan model terbaik dalam melakukan deteksi anomali atau bagaimana?"
    },
    {
      "timestamp": [
        2132.24,
        2144.94
      ],
      "text": " Ya, jadi untuk melakukan deteksi anomali pada perhentian saya itu adalah dilakukan berdasarkan evaluasi early warning atau deteksi secara diri"
    },
    {
      "timestamp": [
        2144.94,
        2151.74
      ],
      "text": " yang mana di sini evaluasinya adalah di sini itu yang LSTM-IU"
    },
    {
      "timestamp": [
        2151.74,
        2159.54
      ],
      "text": " LSTM-IU dia berhasil mereteksi anomali pertama kali pada data point ke 1134"
    },
    {
      "timestamp": [
        2159.54,
        2162.94
      ],
      "text": " dengan threshold sebesar 0,25an"
    },
    {
      "timestamp": [
        2162.94,
        2169.94
      ],
      "text": " nah data point 1134 ini kita selisihkan dengan thresholdnya"
    },
    {
      "timestamp": [
        2169.94,
        2183.88
      ],
      "text": " Lalu, untuk yang LSTM point juga sama, dia pertama kali mendeteksi data point ke, eh, dia pertama kali mendeteksi anomali di data point ke 1136, dan yang terakhir dibentuk di 1293."
    },
    {
      "timestamp": [
        2184.82,
        2190.5
      ],
      "text": " Nah, dalam hal ini, saya melihatnya adalah evaluasinya berdasarkan early warning."
    },
    {
      "timestamp": [
        2190.5,
        2195.56
      ],
      "text": " Early warning itu, pokoknya bagaimana si mobil mendeteksi anomali secara gigi."
    },
    {
      "timestamp": [
        2196.26,
        2195.56
      ],
      "text": ""
    },
    {
      "timestamp": [
        2200.16,
        2208.16
      ],
      "text": " Nah disini evaluasi yang terbaik itu adalah berdasarkan yang si LSTMI Karena dibandingkan ke dua model lainnya, itu LSTMI berhasil meroteksi amali lebih gini daripada yang di dua model lainnya"
    },
    {
      "timestamp": [
        2208.16,
        2209.76
      ],
      "text": " Seperti itu untuk"
    },
    {
      "timestamp": [
        2209.76,
        2212.36
      ],
      "text": " Jadi target kamu adalah early warningnya itu"
    },
    {
      "timestamp": [
        2212.36,
        2213.76
      ],
      "text": " Iya betul early warningnya"
    },
    {
      "timestamp": [
        2213.76,
        2221.76
      ],
      "text": " Karena apa, jadi sebenarnya pada paper paper yang sudah saya baca itu bisa kita meminimalkan fase positif"
    },
    {
      "timestamp": [
        2221.76,
        2224.76
      ],
      "text": " Tapi hanya untuk data yang berlihat dulu"
    },
    {
      "timestamp": [
        2224.76,
        2227.76
      ],
      "text": " Kebetulan disini tidak ada lagi gonggur, jadi tidak bisa"
    },
    {
      "timestamp": [
        2227.76,
        2230.76
      ],
      "text": " Oleh karena itu evaluasinya berdasarkan lagi gonggur"
    },
    {
      "timestamp": [
        2237.76,
        2244.76
      ],
      "text": " Kemudian nanti itu penjelasannya antara normal dengan anomali faulty failure itu nanti kamu tambahkan ya?"
    },
    {
      "timestamp": [
        2244.76,
        2247.76
      ],
      "text": " Ketika kamu membahas anomali protection"
    },
    {
      "timestamp": [
        2247.76,
        2248.76
      ],
      "text": " Karena belum ada"
    },
    {
      "timestamp": [
        2248.76,
        2255.36
      ],
      "text": " Tapi ada bahasa normal anomali itu yang tadi sudah dibahas keindah ya, di gambar 16 dan seterusnya"
    },
    {
      "timestamp": [
        2255.36,
        2260.66
      ],
      "text": " Karena kita harus membedakan dulu normal itu bagaimana, kemudian anomali itu bagaimana"
    },
    {
      "timestamp": [
        2260.66,
        2276.2
      ],
      "text": " Beberapa citasi itu masih salah, jadi nanti coba pastikan bagaimana citasi yang benar itu seharusnya kalau ada di dalam teks"
    },
    {
      "timestamp": [
        2276.2,
        2293.3
      ],
      "text": " Karena ada ketidak konsistenan, contohnya nih, ZANG DKK DOR, kemudian dalam tahun, tahunnya baru dikasih kurung, kemudian ada yang lain itu, LI DKK 2023 itu di dalam kurung, nanti coba dipastikan lihat petunjuk yang benar itu seperti apa."
    },
    {
      "timestamp": [
        2305.3,
        2293.3
      ],
      "text": ""
    },
    {
      "timestamp": [
        2294.3,
        2305.3
      ],
      "text": " Selain itu"
    },
    {
      "timestamp": [
        2308.3,
        2311.3
      ],
      "text": " Kalau dia tadi, oh tadi Bu Indah belum sempat nyinggung ya Yang tempat penelitian"
    },
    {
      "timestamp": [
        2311.3,
        2314.3
      ],
      "text": " Nah tempat penelitian ini kamu korjian dirumah?"
    },
    {
      "timestamp": [
        2314.3,
        2316.3
      ],
      "text": " Iya, saya dirumah"
    },
    {
      "timestamp": [
        2316.3,
        2319.3
      ],
      "text": " Tapi untuk buku skripsi kayaknya di"
    },
    {
      "timestamp": [
        2319.3,
        2328.3
      ],
      "text": " jadi lab ini, lab TSD, atau dikerjakan di STMM"
    },
    {
      "timestamp": [
        2328.3,
        2332.3
      ],
      "text": " karena kalau rumah sangat riset sekali, karena kan kamu LSTM ya"
    },
    {
      "timestamp": [
        2332.3,
        2337.3
      ],
      "text": " bisa sih dirumahkan ya dengan laptop masing-masing, cuma kan gimana ya?"
    },
    {
      "timestamp": [
        2337.3,
        2347.3
      ],
      "text": " nanti diganti saja, supaya lebih formal melakukan penelitian"
    },
    {
      "timestamp": [
        2349.3,
        2367.26
      ],
      "text": " Kemudian di gambar 3.1 flowchartnya kan ada kamu kasih gambar untuk data processing dan anomaly detection itu ada subprosesnya, kalau itu notasinya kan ya."
    },
    {
      "timestamp": [
        2368.86,
        2376.26
      ],
      "text": " Kemudian yang subprosesnya itu, yang gambar 3.2 kan maksudnya?"
    },
    {
      "timestamp": [
        2378.26,
        2376.26
      ],
      "text": ""
    },
    {
      "timestamp": [
        2383.26,
        2393.26
      ],
      "text": " Subprosesnya di situ, itu subproses dari data preprocessing Berarti nanti kamu mention ya di 3.32 itu kalau gambar 3.2 itu adalah subproses dari 3.1"
    },
    {
      "timestamp": [
        2393.26,
        2400.26
      ],
      "text": " Gambar 3.2, data preprocessing ini kan merupakan subproses dari ini kan ya"
    },
    {
      "timestamp": [
        2400.26,
        2403.26
      ],
      "text": " Nah nanti jangan lupa kamu mention dulu"
    },
    {
      "timestamp": [
        2403.26,
        2411.9
      ],
      "text": " Karena kan enggak boleh miss kan ya? Kita kan harus menjelaskan kalau data preprocessing itu subprosesnya adalah yang gambar 3.2, begitu juga dengan anomaly detection."
    },
    {
      "timestamp": [
        2411.9,
        2412.9
      ],
      "text": " Nah ibu panggil."
    },
    {
      "timestamp": [
        2413.68,
        2414.14
      ],
      "text": " Oke."
    },
    {
      "timestamp": [
        2433.26,
        2443.26
      ],
      "text": " Saya mau proses dulu untuk jumlah data setiap file, data set, biring set ketiganya itu memang sama ya?"
    },
    {
      "timestamp": [
        2443.26,
        2450.26
      ],
      "text": " Apa setelah di preprocess? Apa data collection langsung halaman 67?"
    },
    {
      "timestamp": [
        2450.26,
        2451.26
      ],
      "text": " Halaman 67."
    },
    {
      "timestamp": [
        2451.26,
        2454.26
      ],
      "text": " 4.1 data collection."
    },
    {
      "timestamp": [
        2454.26,
        2459.26
      ],
      "text": " kan txt nya total filenya 6,3,2,4"
    },
    {
      "timestamp": [
        2459.26,
        2465.26
      ],
      "text": " setiap file berisi 24,80 data getaran untuk setiap biring"
    },
    {
      "timestamp": [
        2465.26,
        2469.26
      ],
      "text": " berarti memang sama bingin 1,2,3,4 nya"
    },
    {
      "timestamp": [
        2469.26,
        2473.26
      ],
      "text": " jadi 1,2,3,4 itu memang saya pakai ini aja"
    },
    {
      "timestamp": [
        2475.26,
        2478.26
      ],
      "text": " jadi misalkan untuk timestamp yang pertama ya"
    },
    {
      "timestamp": [
        2478.26,
        2483.26
      ],
      "text": " timestamp yang pertama itu memang total data atau total row"
    },
    {
      "timestamp": [
        2483.26,
        2490.66
      ],
      "text": " Untuk setiap variable, itu Rp20.000 semua, begitu juga dengan plan step yang lainnya."
    },
    {
      "timestamp": [
        2492.66,
        2494.16
      ],
      "text": " Itu memang dari datasetnya ya?"
    },
    {
      "timestamp": [
        2494.16,
        2497.26
      ],
      "text": " Iya, dari datasetnya pada saat saya download di komponisar."
    },
    {
      "timestamp": [
        2497.26,
        2500.26
      ],
      "text": " Sekarang ada range waktu ya?"
    },
    {
      "timestamp": [
        2500.26,
        2501.26
      ],
      "text": " Iya, betul."
    },
    {
      "timestamp": [
        2506.26,
        2510.26
      ],
      "text": " Oke, terima kasih Ibu Yutika. Selanjutnya silahkan Bumar Yama."
    },
    {
      "timestamp": [
        2513.26,
        2529.26
      ],
      "text": " Oke, jadi kan tadi sebenernya ada ini ya, ada simpulannya menurut saya yang enggak terluki, yaitu LHCMA itu saya enggak lupa, itu bilangnya memberikan peringatan paling tinggi."
    },
    {
      "timestamp": [
        2529.26,
        2530.26
      ],
      "text": " Iya, Pak."
    },
    {
      "timestamp": [
        2530.26,
        2531.26
      ],
      "text": " Nah, ini yang LHCMA, Pak."
    },
    {
      "timestamp": [
        2531.26,
        2532.26
      ],
      "text": " LHCMA itu."
    },
    {
      "timestamp": [
        2532.26,
        2540.26
      ],
      "text": " Nah, maksudnya peringatan tinggi itu kan belum tentu itu benar-benar. Masa, jadi early warning pasti benar-benar kan enggak juga terlalu tinggi."
    },
    {
      "timestamp": [
        2540.26,
        2551.26
      ],
      "text": " Jadi memang early warning terlalu tinggi, apakah pada data point yang dideteksi LSCMI disitu memang sudah terjadi anomali, kan enggak."
    },
    {
      "timestamp": [
        2551.26,
        2561.26
      ],
      "text": " Kan bisa saja di data point setelahnya, karena memang early warning itu ya jaga-jaga dulu, karena bisa saja di data point setelahnya anomalinya."
    },
    {
      "timestamp": [
        2561.26,
        2565.26
      ],
      "text": " Nah tapi maksudnya kalau terlalu early warning itu juga gak bagus"
    },
    {
      "timestamp": [
        2565.26,
        2566.26
      ],
      "text": " Betul, iya"
    },
    {
      "timestamp": [
        2566.26,
        2569.26
      ],
      "text": " Maksudnya kan kata-kata ini tuh bisa lebih dulu gitu loh"
    },
    {
      "timestamp": [
        2569.26,
        2573.26
      ],
      "text": " Kan kamu bilangnya karena memberikan peringatan ke paling ini"
    },
    {
      "timestamp": [
        2573.26,
        2577.26
      ],
      "text": " Jadi kayak paling dingin nih tapi dipastikan itu tepat gitu"
    },
    {
      "timestamp": [
        2577.26,
        2579.26
      ],
      "text": " Jadi kayak intinya lengkapnya benar kan"
    },
    {
      "timestamp": [
        2579.26,
        2582.26
      ],
      "text": " Misalnya tadi kamu timestamp, misalkan timestamp 100"
    },
    {
      "timestamp": [
        2582.26,
        2586.26
      ],
      "text": " Terus dia 99 atau ini ada lengkap-lengkap itu sudah benar"
    },
    {
      "timestamp": [
        2586.26,
        2594.26
      ],
      "text": " itu benar, tapi kalau pertanyaannya, pertanyaannya 100, tapi dari 50, dari 20, kan salah?"
    },
    {
      "timestamp": [
        2594.26,
        2604.26
      ],
      "text": " Iya betul. Jadi maksudnya, biar gak terkesan bahwa early warning yang dimaksud itu benar-benar."
    },
    {
      "timestamp": [
        2604.26,
        2606.26
      ],
      "text": " Benar gitu."
    },
    {
      "timestamp": [
        2610.26,
        2615.26
      ],
      "text": " Tadi sebenarnya sudah dibahas banyak ya, sama Bu Ika, sama Bu Ida."
    },
    {
      "timestamp": [
        2615.26,
        2622.26
      ],
      "text": " Kalau saya beberapa penulisan tadi lomong saya menemukan beberapa, tinggal di-check saja. Silahkan, terima kasih banyak mas."
    },
    {
      "timestamp": [
        2622.26,
        2632.26
      ],
      "text": " Oke, terima kasih Bu Mariama. Oke, dari saya ini aja mungkin yang pertama untuk tinjauan bustaka yang tabelnya itu kasih nomor ya."
    },
    {
      "timestamp": [
        2632.26,
        2640.26
      ],
      "text": " Nah tabel IP, mas. Jadi biar gampang kalau mau menunjukkan kamu pakai bagaimana, pakai yang mana."
    },
    {
      "timestamp": [
        2640.26,
        2669.34
      ],
      "text": " Ya oke terus, ya ini yang halaman 64, coba dilihat, yang paling bawah paragraf terakhir, itu kan kamu bilang berdasarkan visualisasi simulatif pada gambar 3.8 pada model pertama diketahui bahwa titik pertama kali terjadinya anomali ditandai dengan lonjakan nilai reconstruction error"
    },
    {
      "timestamp": [
        2669.34,
        2674.34
      ],
      "text": " yang melewati batas threshold, garis putus-putus berwarna hijau."
    },
    {
      "timestamp": [
        2676.34,
        2678.34
      ],
      "text": " Terus, dia kan yang merah."
    },
    {
      "timestamp": [
        2682.34,
        2685.34
      ],
      "text": " Aduh, ketinggalan."
    },
    {
      "timestamp": [
        2686.34,
        2690.34
      ],
      "text": " Ya, makanya saya tadi baca kelewatan ya."
    },
    {
      "timestamp": [
        2690.34,
        2693.34
      ],
      "text": " Oke, terus di halaman selanjutnya itu,"
    },
    {
      "timestamp": [
        2694.34,
        2698.34
      ],
      "text": " kamu bilang apabila suatu model mendeteksi"
    },
    {
      "timestamp": [
        2698.34,
        2703.1
      ],
      "text": " mendeteksi anomali pertama kali pada data point ke-100 dengan threshold 20"
    },
    {
      "timestamp": [
        2703.1,
        2709.34
      ],
      "text": " padahal 20 nya ini kan tadi ya pakai histogram gitu ya"
    },
    {
      "timestamp": [
        2709.34,
        2716.34
      ],
      "text": " itu mungkin perlu kamu refer gitu ke mana kamu dapat 20 nya itu"
    },
    {
      "timestamp": [
        2716.34,
        2720.34
      ],
      "text": " maksudnya cara menghitungnya aja kamu refer aja"
    },
    {
      "timestamp": [
        2720.34,
        2723.34
      ],
      "text": " oh berarti saya tuliskan 20 ini berdasarkan?"
    },
    {
      "timestamp": [
        2723.34,
        2727.34
      ],
      "text": " ya misal dengan perhitungan ini 20 ini kamu hitung beneran ya?"
    },
    {
      "timestamp": [
        2727.34,
        2729.34
      ],
      "text": " Enggak, saya random aja"
    },
    {
      "timestamp": [
        2729.34,
        2738.34
      ],
      "text": " Enggak, maksudnya kamu jelaskan berdasarkan misalnya persamaan 2 titik berapa gitu"
    },
    {
      "timestamp": [
        2738.34,
        2743.34
      ],
      "text": " Menghasilkan suatu threshold yang contohnya misal disini 20"
    },
    {
      "timestamp": [
        2743.34,
        2746.34
      ],
      "text": " Nah itu baru kamu jelaskan gitu"
    },
    {
      "timestamp": [
        2747.34,
        2749.34
      ],
      "text": " Oke, terus sama yang ini ya juga"
    },
    {
      "timestamp": [
        2749.34,
        2754.34
      ],
      "text": " Kamu menghitungnya dari data point ke 79 dan threshold ke 15"
    },
    {
      "timestamp": [
        2754.34,
        2756.34
      ],
      "text": " Itu kamu kurangi gitu kan ya"
    },
    {
      "timestamp": [
        2756.34,
        2760.84
      ],
      "text": " Itu kamu dapatnya dari mana? Itu kamu refer juga."
    },
    {
      "timestamp": [
        2760.84,
        2762.84
      ],
      "text": " Oh, mendapatnya dari mana itu maksudnya?"
    },
    {
      "timestamp": [
        2762.84,
        2768.04
      ],
      "text": " Maksudnya perhitungannya. Di persamaan berapa itu kamu perlu menjaga."
    },
    {
      "timestamp": [
        2768.04,
        2772.34
      ],
      "text": " Soalnya kan itu core-nya yang kamu kerjakan."
    },
    {
      "timestamp": [
        2775.34,
        2778.64
      ],
      "text": " Nah, ini kan sesuai dengan penelitian sebelumnya kan sebenarnya."
    },
    {
      "timestamp": [
        2778.64,
        2779.14
      ],
      "text": " Iya."
    },
    {
      "timestamp": [
        2779.14,
        2783.34
      ],
      "text": " Itu 9 minus 15, terus 100 minus 20, ini apa-apa."
    },
    {
      "timestamp": [
        2783.34,
        2785.64
      ],
      "text": " Iya, itu paper-nya yang ini juga?"
    },
    {
      "timestamp": [
        2785.64,
        2794.64
      ],
      "text": " Ya, ada kan, kalau misalnya di bab 2 belum kamu tulis, tema pada yang hitungnya kayak gitu, berarti kamu penulis"
    },
    {
      "timestamp": [
        2794.64,
        2797.64
      ],
      "text": " Berarti itu untuk menentukan apa yang ini?"
    },
    {
      "timestamp": [
        2797.64,
        2804.64
      ],
      "text": " Yang paling bagus kan ya, kan kamu bilang deviasinya lebih kecil gitu kan"
    },
    {
      "timestamp": [
        2804.64,
        2810.64
      ],
      "text": " Sebenarnya kok bisa kamu, itu masa nyebutnya deviasi sih?"
    },
    {
      "timestamp": [
        2810.64,
        2813.64
      ],
      "text": " kan 79 itu datapoint ke 79"
    },
    {
      "timestamp": [
        2813.64,
        2814.64
      ],
      "text": " iya, datapoint 9"
    },
    {
      "timestamp": [
        2814.64,
        2817.64
      ],
      "text": " time-time ke 79"
    },
    {
      "timestamp": [
        2817.64,
        2819.64
      ],
      "text": " tapi kan terus"
    },
    {
      "timestamp": [
        2819.64,
        2823.64
      ],
      "text": " resultnya kan 15 sama 20 ini kan ya"
    },
    {
      "timestamp": [
        2823.64,
        2826.64
      ],
      "text": " kan masa deviasi melitung kayak gitu lah"
    },
    {
      "timestamp": [
        2826.64,
        2828.64
      ],
      "text": " bukan selisih dong"
    },
    {
      "timestamp": [
        2828.64,
        2829.64
      ],
      "text": " selisih ya?"
    },
    {
      "timestamp": [
        2829.64,
        2830.64
      ],
      "text": " bukan lah"
    },
    {
      "timestamp": [
        2830.64,
        2832.64
      ],
      "text": " ya enggak tahu kamu"
    },
    {
      "timestamp": [
        2832.64,
        2835.64
      ],
      "text": " tanya minda, tanya minda"
    },
    {
      "timestamp": [
        2835.64,
        2839.64
      ],
      "text": " enggak maksudnya kalau deviasi itu kan biasanya nilainya segini"
    },
    {
      "timestamp": [
        2839.64,
        2845.14
      ],
      "text": " segini, terus ada yang sampai segini, ada yang sampai segini, itu deviasi, standar deviasinya."
    },
    {
      "timestamp": [
        2846.14,
        2850.14
      ],
      "text": " Ini kan kayaknya, harusnya istilahnya bukan deviasi maksud saya."
    },
    {
      "timestamp": [
        2852.14,
        2857.14
      ],
      "text": " Deviasi biasanya, deviasi itu jarak sih, jarak nilai."
    },
    {
      "timestamp": [
        2857.14,
        2862.14
      ],
      "text": " Tapi kan 79 sama 15 ini kan bukan nilai yang sama maksudnya."
    },
    {
      "timestamp": [
        2862.14,
        2865.14
      ],
      "text": " Oh iya, tanpa perbandingan yang ini."
    },
    {
      "timestamp": [
        2865.14,
        2875.6
      ],
      "text": " Oke, dari saya itu aja. Mungkin itu aja Azal ya, boleh keluar dulu kita akan berdiskusi untuk menentukannya lagi ya."
    }
  ]
}