{
  "language": "id",
  "text": "Halo warga sipil sekalian kemarin gue baru aja ngerilis kaos ini kaos yang udah gua pakai selama tiga tahun yang temen-temen yang akhirnya gua jual kemarin dan dalam waktu 24 jam dengan cara pre-order untuk pertama kalinya juga gue pake sistem pre-order kaos ini pun habis terjual gitu dari stok yang udah kita sediakan dan bahkan di atas ekspetasi dengan harga 200 ribu Ya udah 200 ribu pre-order lagi ya kan Nah ada yang nanya bang kenapa harganya 200 ribu Itu kan mahal banget Terus gue jawab ya karena gue butuh duit Dan gue pengen lebih kaya Jadi yaudah itulah kenapa gue jual kaos ini gitu Untuk keuntungan pribadi gue Gue bilang kayak gitu Gue kira mereka bakal gentar Gue jawab kayak gitu Mereka bakal mundur ya kan Wah sangat-sangat self-centric sekali Alasemen menjual kaosnya Ternyata gue salah pak Kaos ini laku 2100 pieces Dan dipesan dalam waktu yang kurang dari 24 jam Artinya apa? Artinya dalam waktu satu hari Gue bisa muter uang sebesar 400 juta lebih di seluruh platform Hai media sosial Wow siapa pun tahu 400 juta bukan uang yang kecil Teman-teman itu udah bisa bikin lo punya rumah cash Di Kabupaten Bekasi Dan kalau di daerah yang lebih jauh lagi dari Jakarta Bisa dapat rumah yang lebih bagus lagi nah, sekarang karena pre-ordernya sudah kita tutup karena pemesannya sudah kita close sementara, karena gue bakal jual lagi selanjutnya ya, karena gue ngejar produksi juga Supaya mesen gak nunggu lebih lama Gue umumkan motif sebentar ya teman-teman Ya Gue kasih tau kepada kalian semua Sesuatu yang gue pikir harus gue kasih tau setelah orang memesan. Yaitu tujuan sebenarnya gue ngejual kaos ini. Langsung saja, tujuan sebenarnya dari gue ngejual kaos ini tak lain tak bukan adalah beasiswa ya sekali lagi hasil profit dari 400 juta itu akan gue gunakan sepenuhnya untuk beasiswa yang terbuka untuk seluruh mahasiswa di Republik Indonesia mau lu perguruan tinggi, mau lu swasta segala jurusan nah, kalau misalnya teman-teman tertarik silahkan tonton video ini sampai habis. Tapi nggak sayang bang, itu duit 400 juta banyak loh. Ya, memang banyak. Tapi, it's not about the money bro it's about sending message Sampai jumpa di video selanjutnya. Like it was nothing Ya jawabannya males Gue mau orang beli kaosnya karena memang suka sama kaosnya gitu Bukan karena mikir oh kalau gue beli kaos ini gue akan ngasih manfaat untuk orang dan lain sebagainya Gue gak suka jualan hal-hal seperti itu Dan kayaknya itu tanggung jawab yang terlalu besar nantinya Kalau dari awal gue bilang oke gue hasil penjualan kaos ini gue dedikasikan untuk beasiswa kepada seluruh masyarakat atau mahasiswa di Indonesia gitu Bukan tipikal gue lah jadi ya itu jawabannya Kenapa gue ngasih tahunya setelah Pre-ordernya kita tutup Setelah penjualannya kita tutup Terus apa gak sayang pak Duit 400 juta kan banyak banget Tapi gue pernah ngebuang duit lebih banyak lagi dan hidup gue baik-baik saja jadi ya sudah itu bukan jadi masalah buat gue dan terakhir gimana cara dapat beasiswanya bang yaudah dulu tinggal simak video ini sampai habis Jadi gini teman-teman, gue cuma minta Lu bikin video esay Entah itu di tiktok, instagram, ataupun youtube Durasinya enggak gue batasin bawah, enggak gue batasin atas Selama video itu bagus dan banyak yang nonton Maka lu akan mendapatkan full scholarship sampai lu lulus yes, mau lu kuliah di tempat paling mahal sekalipun gak masalah, karena ini basisnya bukan keadaan sosial dan ekonomi tapi emang kualitas dari esai Yang lu jelaskan dalam video gitu Nah kalau tertarik apa yang lu harus jelaskan Yang lu harus jelaskan adalah kritik dan masalah Dalam sistem perkuliahan Dan perguruan tinggi di Indonesia Lu sampaikan kritiknya, lu sampaikan masalahnya Lu identifikasi problemnya Lu nilai apa yang harus diperbaiki Apa yang harus diubah dan bagaimana Bentuk idealnya Nanti dari beberapa video yang sudah Kita tonton sampai tanggal 17 Agustus Nanti ya itu kita bakal Panggil 5 orang untuk presentasi langsung Untuk ngasih decknya langsung untuk memaparkan langsung proposal idenya, gagasannya di channelnya Malaka, jadi kayak lu pernah nonton pitching venture gak, ya kan dia ngebarin konsepnya, kenapa kayak gini kenapa kayak gini, kenapa kayak gini, kenapa kayak gini setelah kealian, identifikasi problemnya, jadi, kalau emang lu terpilih nantinya lu akan dipanggil ke Malaka untuk present the idea gitu dan siapa tahu itu membuka kesempatan yang lebih besar lagi untuk teman-teman semua sekali lagi gua terbuka bilang ke teman-teman semua ini terbuka untuk seluruh mahasiswa kalau lu ngerasa oke gue pengen deh nyobain gitu apa salahnya ya monggo silahkan gitu nah satu lagi kalau misalnya lu bisa dapetin 1 juta views di Youtube Atau lu bisa dapetin lebih dari 5 juta views di Tiktok Sampai tanggal 17 Agustus ini Maka otomatis lu akan terpilih Menjadi salah satu penerima Deasiswa revolusi ini Easy kan Tapi untuk mencapai view sebanyak itu Lu perlu strategi, lu perlu teknikal Lu perlu mempelajari bagaimana algoritm bekerja dan you deserve it gitu loh untuk mendapatkan full scholarship sampai di ataman jadi gitu, lo bikin aja videonya, buat lo yang kebiasaan nulis jurnal Sekarang, ya sama sebenarnya Kayak nulis jurnal, cuman ditonton lebih banyak orang aja Artinya apa? Ada dua elemen paling penting disini Yang pertama substansinya, yang kedua komunikasinya Jadi tinggal bagaimana memikirkan Jadi lu tinggal pikirin gimana bahan lu kuat dan gimana bahan itu disampaikan ketiga bonusnya ya visualnya kalau lu punya kemampuan visual yang lebih baik Atau lo punya temen yang bisa Membantu lo dalam membuat visual yang lebih baik Itu bakal lebih bagus Terus bagaimana gue menilai sebuah video Ada dua juga pertama substansinya Kedua, view-nya Jadi itu salah satu aspek menilai sebuah video? Ada dua juga. Pertama substansinya, kedua view-nya. Jadi, itu salah satu aspek menilai gue dan salah satu wildcard yang bisa lo pakai juga. Tapi kalau misalnya lo nggak sampai 5 juta atau lo nggak sampai 1 juta view di youtube it's okay juga selama konten lu bagus selama lu bisa bikin gua atau meyakinkan gua kalo lu layak, kalo lu emang pantas untuk dapet kesempatan why not, jadi silahkan dicoba dan kalau lu udah upload persyaratannya paling simple lah, standar gitu loh gak perlu nge-follow gue, gak perlu nge-like gak perlu apa yang penting, lu mention nama gue Satu, lu pake hashtag Beasiswa Revolusi Dua, lu pake hashtag Malaka 3 Udah, gitu aja Jadi sekali lagi mention nama gue Mention nama Malaka Hashtag beasiswa revolusi Hashtag Malaka Nah siapapun yang terpilih nantinya Akan mendapatkan Full beasiswa sampai di taman Terbuka untuk seluruh jurusan Itu sih Oke Apakah baju ini akan gue jual lagi? ya akan gue jual lagi, tapi gue selesaikan dulu produksi yang udah pesan, kasian mereka udah nunggu dan kalau kalian lihat ini sablonnya discharge ya yang nyatu sama serat kainnya emang agak ribet dan agak lama dan kalau kalian lihat ini sablonnya discharge ya yang nyatu sama serat kainnya emang agak ribet dan agak lama dan kalau kalian lihat disini ada kayak pudar-pudar itu emang art desainnya seperti itu jadi jangan kaget Dan ya bahannya cotton 24 Dan nyaman banget dipakai Kayak gue pake sekarang Jadi yang udah pesan selamat menunggu Jangan menilai terlalu tinggi juga temen-temen Gue melakukan ini untuk diri gue sendiri bukan untuk orang lain that's it untuk kaosnya sendiri yang sudah pesan silahkan ditunggu mungkin akan dikirimkan ke rumah kalian antara di atas tanggal 13 ya karena yang gue janjikan gue gak main-main dalam ngedesain kaos ini sablonnya discharge ya, yang nyatu sama kain, jadi kalau udah bertahun-tahun pun, itu bakal ngasih residu yang bagus banget untuk kaos lu gitu, jadi kelihatan vintage gitu ya dan emang kosli jadi mohon ditunggu tanggal 13 dari vendornya ngejanjiin udah bisa dikirimin mungkin sampai di rumah kalian ya di atas tanggal segitu tergantung lokasi dan posisi kalian langsung kita garap langsung kita kirim ke rumah kalian jadi mohon bersabar buat yang udah mesen Nah setelah yang udah mesen ini kita kirim Kita bakal buka lagi tapi bentuknya bukan pre-order Melainkan predis Nah itu aja konten kali ini Semoga bermanfaat Sampai jumpa di konten selanjutnya Selamat datang di masyarakat baru Nah, itu aja konten kali ini. Semoga bermanfaat. Sampai jumpa di konten selanjutnya. See ya. Selamat datang di Masyarakat Baru, teman-teman.",
  "chunks": [
    {
      "timestamp": [
        0.0,
        19.48
      ],
      "text": " Halo warga sipil sekalian kemarin gue baru aja ngerilis kaos ini kaos yang udah"
    },
    {
      "timestamp": [
        19.48,
        24.44
      ],
      "text": " gua pakai selama tiga tahun yang temen-temen yang akhirnya gua jual kemarin dan dalam"
    },
    {
      "timestamp": [
        24.44,
        26.1
      ],
      "text": " waktu 24 jam dengan cara pre-order"
    },
    {
      "timestamp": [
        26.1,
        28.26
      ],
      "text": " untuk pertama kalinya juga gue pake sistem pre-order"
    },
    {
      "timestamp": [
        28.26,
        29.48
      ],
      "text": " kaos ini pun"
    },
    {
      "timestamp": [
        29.48,
        31.88
      ],
      "text": " habis terjual gitu dari"
    },
    {
      "timestamp": [
        31.88,
        34.06
      ],
      "text": " stok yang udah kita sediakan dan bahkan di atas"
    },
    {
      "timestamp": [
        34.06,
        36.84
      ],
      "text": " ekspetasi dengan harga 200 ribu"
    },
    {
      "timestamp": [
        36.84,
        39.02
      ],
      "text": " Ya udah 200 ribu pre-order lagi ya kan"
    },
    {
      "timestamp": [
        39.02,
        41.44
      ],
      "text": " Nah ada yang nanya bang kenapa harganya 200 ribu"
    },
    {
      "timestamp": [
        41.44,
        42.18
      ],
      "text": " Itu kan mahal banget"
    },
    {
      "timestamp": [
        42.18,
        43.88
      ],
      "text": " Terus gue jawab ya karena gue butuh duit"
    },
    {
      "timestamp": [
        43.88,
        44.92
      ],
      "text": " Dan gue pengen lebih kaya"
    },
    {
      "timestamp": [
        44.92,
        47.64
      ],
      "text": " Jadi yaudah itulah kenapa gue jual kaos ini gitu"
    },
    {
      "timestamp": [
        47.64,
        49.92
      ],
      "text": " Untuk keuntungan pribadi gue"
    },
    {
      "timestamp": [
        49.92,
        50.66
      ],
      "text": " Gue bilang kayak gitu"
    },
    {
      "timestamp": [
        50.66,
        52.4
      ],
      "text": " Gue kira mereka bakal gentar"
    },
    {
      "timestamp": [
        52.4,
        53.06
      ],
      "text": " Gue jawab kayak gitu"
    },
    {
      "timestamp": [
        53.06,
        54.34
      ],
      "text": " Mereka bakal mundur ya kan"
    },
    {
      "timestamp": [
        54.34,
        55.96
      ],
      "text": " Wah sangat-sangat self-centric sekali"
    },
    {
      "timestamp": [
        55.96,
        56.92
      ],
      "text": " Alasemen menjual kaosnya"
    },
    {
      "timestamp": [
        56.92,
        57.92
      ],
      "text": " Ternyata gue salah pak"
    },
    {
      "timestamp": [
        57.92,
        60.72
      ],
      "text": " Kaos ini laku 2100 pieces"
    },
    {
      "timestamp": [
        60.72,
        63.98
      ],
      "text": " Dan dipesan dalam waktu yang kurang dari 24 jam"
    },
    {
      "timestamp": [
        63.98,
        64.78
      ],
      "text": " Artinya apa?"
    },
    {
      "timestamp": [
        71.16,
        72.06
      ],
      "text": " Artinya dalam waktu satu hari Gue bisa muter uang sebesar 400 juta lebih di seluruh platform"
    },
    {
      "timestamp": [
        76.96,
        80.2
      ],
      "text": " Hai media sosial Wow siapa pun tahu 400 juta bukan uang yang kecil Teman-teman itu udah bisa bikin lo punya rumah cash"
    },
    {
      "timestamp": [
        80.2,
        81.24
      ],
      "text": " Di Kabupaten Bekasi"
    },
    {
      "timestamp": [
        81.24,
        84.4
      ],
      "text": " Dan kalau di daerah yang lebih jauh lagi dari Jakarta"
    },
    {
      "timestamp": [
        84.4,
        86.3
      ],
      "text": " Bisa dapat rumah yang lebih bagus lagi"
    },
    {
      "timestamp": [
        86.3,
        87.98
      ],
      "text": " nah, sekarang"
    },
    {
      "timestamp": [
        87.98,
        89.96
      ],
      "text": " karena pre-ordernya sudah kita tutup"
    },
    {
      "timestamp": [
        89.96,
        91.98
      ],
      "text": " karena pemesannya sudah kita close"
    },
    {
      "timestamp": [
        91.98,
        94.16
      ],
      "text": " sementara, karena gue bakal jual lagi selanjutnya"
    },
    {
      "timestamp": [
        94.16,
        95.98
      ],
      "text": " ya, karena gue ngejar produksi juga"
    },
    {
      "timestamp": [
        95.98,
        97.46
      ],
      "text": " Supaya mesen gak nunggu lebih lama"
    },
    {
      "timestamp": [
        97.46,
        100.04
      ],
      "text": " Gue umumkan motif sebentar ya teman-teman"
    },
    {
      "timestamp": [
        100.04,
        101.06
      ],
      "text": " Ya"
    },
    {
      "timestamp": [
        101.06,
        103.48
      ],
      "text": " Gue kasih tau kepada kalian semua"
    },
    {
      "timestamp": [
        103.48,
        107.04
      ],
      "text": " Sesuatu yang gue pikir harus gue kasih tau setelah orang memesan."
    },
    {
      "timestamp": [
        107.22,
        110.14
      ],
      "text": " Yaitu tujuan sebenarnya gue ngejual kaos ini."
    },
    {
      "timestamp": [
        110.84,
        115.88
      ],
      "text": " Langsung saja, tujuan sebenarnya dari gue ngejual kaos ini tak lain tak bukan adalah beasiswa ya"
    },
    {
      "timestamp": [
        115.88,
        122.54
      ],
      "text": " sekali lagi hasil profit dari 400 juta itu akan gue gunakan sepenuhnya untuk beasiswa yang terbuka"
    },
    {
      "timestamp": [
        122.54,
        125.44
      ],
      "text": " untuk seluruh mahasiswa di Republik Indonesia"
    },
    {
      "timestamp": [
        125.44,
        127.98
      ],
      "text": " mau lu perguruan tinggi, mau lu swasta"
    },
    {
      "timestamp": [
        127.98,
        129.84
      ],
      "text": " segala jurusan"
    },
    {
      "timestamp": [
        129.84,
        132.48
      ],
      "text": " nah, kalau misalnya teman-teman tertarik"
    },
    {
      "timestamp": [
        132.48,
        133.92
      ],
      "text": " silahkan"
    },
    {
      "timestamp": [
        133.92,
        136.64
      ],
      "text": " tonton video ini sampai habis."
    },
    {
      "timestamp": [
        137.12,
        139.16
      ],
      "text": " Tapi nggak sayang bang, itu duit 400 juta banyak loh."
    },
    {
      "timestamp": [
        139.96,
        142.36
      ],
      "text": " Ya, memang banyak."
    },
    {
      "timestamp": [
        142.64,
        188.8
      ],
      "text": " Tapi, it's not about the money bro it's about sending message Sampai jumpa di video selanjutnya. Like it was nothing Ya jawabannya males Gue mau orang beli kaosnya karena memang suka sama kaosnya gitu Bukan karena mikir oh kalau gue beli kaos ini gue akan ngasih manfaat untuk orang dan lain sebagainya"
    },
    {
      "timestamp": [
        188.8,
        190.82
      ],
      "text": " Gue gak suka jualan hal-hal seperti itu"
    },
    {
      "timestamp": [
        190.82,
        193.7
      ],
      "text": " Dan kayaknya itu tanggung jawab yang terlalu besar nantinya"
    },
    {
      "timestamp": [
        193.7,
        200.56
      ],
      "text": " Kalau dari awal gue bilang oke gue hasil penjualan kaos ini gue dedikasikan untuk beasiswa kepada seluruh masyarakat atau mahasiswa di Indonesia gitu"
    },
    {
      "timestamp": [
        200.56,
        205.52
      ],
      "text": " Bukan tipikal gue lah jadi ya itu jawabannya Kenapa gue ngasih tahunya setelah"
    },
    {
      "timestamp": [
        205.52,
        207.24
      ],
      "text": " Pre-ordernya kita tutup"
    },
    {
      "timestamp": [
        207.24,
        210.24
      ],
      "text": " Setelah penjualannya kita tutup"
    },
    {
      "timestamp": [
        210.24,
        211.6
      ],
      "text": " Terus apa gak sayang pak"
    },
    {
      "timestamp": [
        211.6,
        213.02
      ],
      "text": " Duit 400 juta kan banyak banget"
    },
    {
      "timestamp": [
        213.02,
        215.66
      ],
      "text": " Tapi gue pernah ngebuang duit lebih banyak lagi"
    },
    {
      "timestamp": [
        215.66,
        216.78
      ],
      "text": " dan hidup gue baik-baik saja"
    },
    {
      "timestamp": [
        216.78,
        219.0
      ],
      "text": " jadi ya sudah itu bukan jadi masalah buat gue"
    },
    {
      "timestamp": [
        219.0,
        221.84
      ],
      "text": " dan terakhir gimana cara dapat beasiswanya bang"
    },
    {
      "timestamp": [
        221.84,
        224.1
      ],
      "text": " yaudah dulu tinggal simak video ini"
    },
    {
      "timestamp": [
        224.1,
        232.18
      ],
      "text": " sampai habis Jadi gini teman-teman, gue cuma minta"
    },
    {
      "timestamp": [
        232.18,
        233.34
      ],
      "text": " Lu bikin video esay"
    },
    {
      "timestamp": [
        233.34,
        236.18
      ],
      "text": " Entah itu di tiktok, instagram, ataupun youtube"
    },
    {
      "timestamp": [
        236.18,
        239.62
      ],
      "text": " Durasinya enggak gue batasin bawah, enggak gue batasin atas"
    },
    {
      "timestamp": [
        239.62,
        241.92
      ],
      "text": " Selama video itu bagus dan banyak yang nonton"
    },
    {
      "timestamp": [
        241.92,
        245.72
      ],
      "text": " Maka lu akan mendapatkan full scholarship sampai lu lulus"
    },
    {
      "timestamp": [
        245.72,
        247.92
      ],
      "text": " yes, mau lu"
    },
    {
      "timestamp": [
        247.92,
        249.72
      ],
      "text": " kuliah di tempat paling mahal sekalipun"
    },
    {
      "timestamp": [
        249.72,
        252.18
      ],
      "text": " gak masalah, karena ini basisnya bukan"
    },
    {
      "timestamp": [
        252.18,
        254.1
      ],
      "text": " keadaan sosial dan ekonomi"
    },
    {
      "timestamp": [
        254.1,
        255.92
      ],
      "text": " tapi emang kualitas dari esai"
    },
    {
      "timestamp": [
        255.92,
        257.34
      ],
      "text": " Yang lu jelaskan dalam video gitu"
    },
    {
      "timestamp": [
        257.34,
        259.24
      ],
      "text": " Nah kalau tertarik apa yang lu harus jelaskan"
    },
    {
      "timestamp": [
        259.24,
        261.78
      ],
      "text": " Yang lu harus jelaskan adalah kritik dan masalah"
    },
    {
      "timestamp": [
        261.78,
        263.92
      ],
      "text": " Dalam sistem perkuliahan"
    },
    {
      "timestamp": [
        263.92,
        265.58
      ],
      "text": " Dan perguruan tinggi di Indonesia"
    },
    {
      "timestamp": [
        265.58,
        268.18
      ],
      "text": " Lu sampaikan kritiknya, lu sampaikan masalahnya"
    },
    {
      "timestamp": [
        268.18,
        270.22
      ],
      "text": " Lu identifikasi problemnya"
    },
    {
      "timestamp": [
        270.22,
        272.32
      ],
      "text": " Lu nilai apa yang harus diperbaiki"
    },
    {
      "timestamp": [
        272.32,
        273.98
      ],
      "text": " Apa yang harus diubah dan bagaimana"
    },
    {
      "timestamp": [
        273.98,
        274.8
      ],
      "text": " Bentuk idealnya"
    },
    {
      "timestamp": [
        274.8,
        278.1
      ],
      "text": " Nanti dari beberapa video yang sudah"
    },
    {
      "timestamp": [
        278.1,
        280.36
      ],
      "text": " Kita tonton sampai tanggal 17 Agustus"
    },
    {
      "timestamp": [
        280.36,
        282.08
      ],
      "text": " Nanti ya itu kita bakal"
    },
    {
      "timestamp": [
        282.08,
        284.34
      ],
      "text": " Panggil 5 orang untuk presentasi langsung"
    },
    {
      "timestamp": [
        284.34,
        285.98
      ],
      "text": " Untuk ngasih decknya langsung"
    },
    {
      "timestamp": [
        285.98,
        288.28
      ],
      "text": " untuk memaparkan langsung proposal"
    },
    {
      "timestamp": [
        288.28,
        290.1
      ],
      "text": " idenya, gagasannya di"
    },
    {
      "timestamp": [
        290.1,
        292.02
      ],
      "text": " channelnya Malaka, jadi kayak"
    },
    {
      "timestamp": [
        292.02,
        293.04
      ],
      "text": " lu pernah nonton"
    },
    {
      "timestamp": [
        293.04,
        295.44
      ],
      "text": " pitching venture gak, ya kan"
    },
    {
      "timestamp": [
        295.44,
        297.74
      ],
      "text": " dia ngebarin konsepnya, kenapa kayak gini"
    },
    {
      "timestamp": [
        297.74,
        300.18
      ],
      "text": " kenapa kayak gini, kenapa kayak gini, kenapa kayak gini"
    },
    {
      "timestamp": [
        300.18,
        301.94
      ],
      "text": " setelah kealian, identifikasi"
    },
    {
      "timestamp": [
        301.94,
        304.2
      ],
      "text": " problemnya, jadi, kalau emang lu terpilih"
    },
    {
      "timestamp": [
        304.2,
        305.4
      ],
      "text": " nantinya lu akan dipanggil"
    },
    {
      "timestamp": [
        305.4,
        310.92
      ],
      "text": " ke Malaka untuk present the idea gitu dan siapa tahu itu membuka kesempatan yang lebih besar lagi"
    },
    {
      "timestamp": [
        310.92,
        316.66
      ],
      "text": " untuk teman-teman semua sekali lagi gua terbuka bilang ke teman-teman semua ini terbuka untuk seluruh mahasiswa"
    },
    {
      "timestamp": [
        316.66,
        317.36
      ],
      "text": " kalau lu ngerasa"
    },
    {
      "timestamp": [
        317.36,
        319.9
      ],
      "text": " oke gue pengen deh nyobain gitu"
    },
    {
      "timestamp": [
        319.9,
        321.8
      ],
      "text": " apa salahnya ya monggo silahkan gitu"
    },
    {
      "timestamp": [
        321.8,
        323.22
      ],
      "text": " nah satu lagi"
    },
    {
      "timestamp": [
        323.22,
        327.0
      ],
      "text": " kalau misalnya lu bisa dapetin 1 juta views di Youtube"
    },
    {
      "timestamp": [
        327.0,
        330.0
      ],
      "text": " Atau lu bisa dapetin lebih dari 5 juta views di Tiktok"
    },
    {
      "timestamp": [
        330.0,
        332.0
      ],
      "text": " Sampai tanggal 17 Agustus ini"
    },
    {
      "timestamp": [
        332.0,
        334.0
      ],
      "text": " Maka otomatis lu akan terpilih"
    },
    {
      "timestamp": [
        334.0,
        335.7
      ],
      "text": " Menjadi salah satu penerima"
    },
    {
      "timestamp": [
        335.7,
        338.02
      ],
      "text": " Deasiswa revolusi ini"
    },
    {
      "timestamp": [
        338.02,
        339.54
      ],
      "text": " Easy kan"
    },
    {
      "timestamp": [
        339.54,
        341.32
      ],
      "text": " Tapi untuk mencapai view sebanyak itu"
    },
    {
      "timestamp": [
        341.32,
        343.3
      ],
      "text": " Lu perlu strategi, lu perlu teknikal"
    },
    {
      "timestamp": [
        343.3,
        348.0
      ],
      "text": " Lu perlu mempelajari bagaimana algoritm bekerja dan you deserve it gitu loh"
    },
    {
      "timestamp": [
        348.0,
        351.0
      ],
      "text": " untuk mendapatkan full scholarship sampai di ataman"
    },
    {
      "timestamp": [
        351.0,
        356.1
      ],
      "text": " jadi gitu, lo bikin aja videonya, buat lo yang kebiasaan nulis jurnal Sekarang, ya sama sebenarnya"
    },
    {
      "timestamp": [
        356.1,
        358.34
      ],
      "text": " Kayak nulis jurnal, cuman ditonton lebih banyak orang aja"
    },
    {
      "timestamp": [
        358.34,
        359.72
      ],
      "text": " Artinya apa?"
    },
    {
      "timestamp": [
        359.82,
        361.14
      ],
      "text": " Ada dua elemen paling penting disini"
    },
    {
      "timestamp": [
        361.14,
        363.26
      ],
      "text": " Yang pertama substansinya, yang kedua komunikasinya"
    },
    {
      "timestamp": [
        363.26,
        370.08
      ],
      "text": " Jadi tinggal bagaimana memikirkan Jadi lu tinggal pikirin gimana bahan lu kuat dan gimana bahan itu disampaikan"
    },
    {
      "timestamp": [
        370.08,
        375.84
      ],
      "text": " ketiga bonusnya ya visualnya kalau lu punya kemampuan visual yang lebih baik Atau lo punya temen yang bisa"
    },
    {
      "timestamp": [
        375.84,
        378.94
      ],
      "text": " Membantu lo dalam membuat visual yang lebih baik"
    },
    {
      "timestamp": [
        378.94,
        380.2
      ],
      "text": " Itu bakal lebih bagus"
    },
    {
      "timestamp": [
        380.2,
        382.14
      ],
      "text": " Terus bagaimana gue menilai sebuah video"
    },
    {
      "timestamp": [
        382.14,
        383.6
      ],
      "text": " Ada dua juga pertama substansinya"
    },
    {
      "timestamp": [
        383.6,
        384.76
      ],
      "text": " Kedua, view-nya"
    },
    {
      "timestamp": [
        384.76,
        387.38
      ],
      "text": " Jadi itu salah satu aspek menilai sebuah video? Ada dua juga. Pertama substansinya, kedua view-nya."
    },
    {
      "timestamp": [
        387.78,
        388.04
      ],
      "text": " Jadi,"
    },
    {
      "timestamp": [
        389.94,
        392.02
      ],
      "text": " itu salah satu aspek menilai gue dan salah satu wildcard yang bisa lo pakai juga. Tapi kalau misalnya"
    },
    {
      "timestamp": [
        392.02,
        393.92
      ],
      "text": " lo nggak sampai 5 juta atau lo nggak sampai 1 juta"
    },
    {
      "timestamp": [
        393.92,
        396.0
      ],
      "text": " view di youtube"
    },
    {
      "timestamp": [
        396.0,
        398.0
      ],
      "text": " it's okay juga selama konten lu bagus"
    },
    {
      "timestamp": [
        398.0,
        400.0
      ],
      "text": " selama lu bisa bikin gua"
    },
    {
      "timestamp": [
        400.0,
        402.0
      ],
      "text": " atau meyakinkan gua kalo lu"
    },
    {
      "timestamp": [
        402.0,
        404.0
      ],
      "text": " layak, kalo lu emang pantas untuk dapet kesempatan"
    },
    {
      "timestamp": [
        404.0,
        405.72
      ],
      "text": " why not, jadi silahkan dicoba"
    },
    {
      "timestamp": [
        405.72,
        408.24
      ],
      "text": " dan kalau lu udah upload"
    },
    {
      "timestamp": [
        408.24,
        409.88
      ],
      "text": " persyaratannya"
    },
    {
      "timestamp": [
        409.88,
        411.9
      ],
      "text": " paling simple lah, standar gitu loh"
    },
    {
      "timestamp": [
        411.9,
        413.78
      ],
      "text": " gak perlu nge-follow gue, gak perlu nge-like"
    },
    {
      "timestamp": [
        413.78,
        415.88
      ],
      "text": " gak perlu apa yang penting, lu mention nama gue"
    },
    {
      "timestamp": [
        415.88,
        418.08
      ],
      "text": " Satu, lu pake hashtag"
    },
    {
      "timestamp": [
        418.08,
        419.48
      ],
      "text": " Beasiswa Revolusi"
    },
    {
      "timestamp": [
        419.48,
        421.56
      ],
      "text": " Dua, lu pake hashtag"
    },
    {
      "timestamp": [
        421.56,
        422.72
      ],
      "text": " Malaka 3"
    },
    {
      "timestamp": [
        422.72,
        424.2
      ],
      "text": " Udah, gitu aja"
    },
    {
      "timestamp": [
        424.2,
        427.3
      ],
      "text": " Jadi sekali lagi mention nama gue"
    },
    {
      "timestamp": [
        427.3,
        428.44
      ],
      "text": " Mention nama Malaka"
    },
    {
      "timestamp": [
        428.44,
        430.14
      ],
      "text": " Hashtag beasiswa revolusi"
    },
    {
      "timestamp": [
        430.14,
        431.7
      ],
      "text": " Hashtag Malaka"
    },
    {
      "timestamp": [
        431.7,
        434.82
      ],
      "text": " Nah siapapun yang terpilih nantinya"
    },
    {
      "timestamp": [
        434.82,
        436.16
      ],
      "text": " Akan mendapatkan"
    },
    {
      "timestamp": [
        436.16,
        438.4
      ],
      "text": " Full beasiswa sampai di taman"
    },
    {
      "timestamp": [
        438.4,
        440.38
      ],
      "text": " Terbuka untuk seluruh jurusan"
    },
    {
      "timestamp": [
        440.38,
        442.18
      ],
      "text": " Itu sih"
    },
    {
      "timestamp": [
        442.18,
        443.38
      ],
      "text": " Oke"
    },
    {
      "timestamp": [
        443.38,
        445.28
      ],
      "text": " Apakah baju ini akan gue jual lagi?"
    },
    {
      "timestamp": [
        445.62,
        447.74
      ],
      "text": " ya akan gue jual lagi, tapi gue selesaikan dulu"
    },
    {
      "timestamp": [
        447.74,
        449.72
      ],
      "text": " produksi yang udah pesan, kasian mereka udah nunggu"
    },
    {
      "timestamp": [
        449.72,
        451.32
      ],
      "text": " dan kalau kalian lihat ini"
    },
    {
      "timestamp": [
        451.32,
        453.32
      ],
      "text": " sablonnya discharge ya"
    },
    {
      "timestamp": [
        453.32,
        456.0
      ],
      "text": " yang nyatu sama serat kainnya emang agak ribet dan agak lama dan kalau kalian lihat ini sablonnya discharge ya yang nyatu sama serat kainnya"
    },
    {
      "timestamp": [
        456.0,
        458.0
      ],
      "text": " emang agak ribet dan agak lama"
    },
    {
      "timestamp": [
        458.0,
        460.0
      ],
      "text": " dan kalau kalian lihat disini ada"
    },
    {
      "timestamp": [
        460.0,
        462.0
      ],
      "text": " kayak pudar-pudar itu emang"
    },
    {
      "timestamp": [
        462.0,
        464.0
      ],
      "text": " art desainnya seperti itu"
    },
    {
      "timestamp": [
        464.0,
        465.42
      ],
      "text": " jadi jangan kaget"
    },
    {
      "timestamp": [
        465.42,
        467.94
      ],
      "text": " Dan ya bahannya cotton 24"
    },
    {
      "timestamp": [
        467.94,
        469.34
      ],
      "text": " Dan nyaman banget dipakai"
    },
    {
      "timestamp": [
        469.34,
        470.28
      ],
      "text": " Kayak gue pake sekarang"
    },
    {
      "timestamp": [
        470.28,
        472.5
      ],
      "text": " Jadi yang udah pesan selamat menunggu"
    },
    {
      "timestamp": [
        472.5,
        474.54
      ],
      "text": " Jangan menilai terlalu tinggi juga temen-temen"
    },
    {
      "timestamp": [
        474.54,
        477.8
      ],
      "text": " Gue melakukan ini untuk diri gue sendiri bukan untuk orang lain that's it"
    },
    {
      "timestamp": [
        477.8,
        489.22
      ],
      "text": " untuk kaosnya sendiri yang sudah pesan silahkan ditunggu mungkin akan dikirimkan ke rumah kalian"
    },
    {
      "timestamp": [
        489.22,
        494.0
      ],
      "text": " antara di atas tanggal 13 ya karena yang gue janjikan gue gak main-main dalam ngedesain"
    },
    {
      "timestamp": [
        494.0,
        495.94
      ],
      "text": " kaos ini sablonnya discharge"
    },
    {
      "timestamp": [
        495.94,
        497.94
      ],
      "text": " ya, yang nyatu sama kain, jadi kalau udah"
    },
    {
      "timestamp": [
        497.94,
        500.08
      ],
      "text": " bertahun-tahun pun, itu bakal"
    },
    {
      "timestamp": [
        500.08,
        502.0
      ],
      "text": " ngasih residu yang bagus banget untuk"
    },
    {
      "timestamp": [
        502.0,
        504.24
      ],
      "text": " kaos lu gitu, jadi kelihatan vintage gitu ya"
    },
    {
      "timestamp": [
        504.24,
        505.9
      ],
      "text": " dan emang kosli"
    },
    {
      "timestamp": [
        505.9,
        508.04
      ],
      "text": " jadi mohon ditunggu"
    },
    {
      "timestamp": [
        508.04,
        509.98
      ],
      "text": " tanggal 13 dari vendornya"
    },
    {
      "timestamp": [
        509.98,
        511.96
      ],
      "text": " ngejanjiin udah bisa dikirimin mungkin"
    },
    {
      "timestamp": [
        511.96,
        514.06
      ],
      "text": " sampai di rumah kalian ya di atas tanggal segitu"
    },
    {
      "timestamp": [
        514.06,
        520.08
      ],
      "text": " tergantung lokasi dan posisi kalian langsung kita garap langsung kita kirim ke rumah kalian jadi mohon"
    },
    {
      "timestamp": [
        520.08,
        526.14
      ],
      "text": " bersabar buat yang udah mesen Nah setelah yang udah mesen ini kita kirim Kita bakal buka lagi tapi bentuknya bukan pre-order"
    },
    {
      "timestamp": [
        526.14,
        527.04
      ],
      "text": " Melainkan predis"
    },
    {
      "timestamp": [
        527.04,
        531.14
      ],
      "text": " Nah itu aja konten kali ini"
    },
    {
      "timestamp": [
        531.14,
        531.9
      ],
      "text": " Semoga bermanfaat"
    },
    {
      "timestamp": [
        531.9,
        533.32
      ],
      "text": " Sampai jumpa di konten selanjutnya"
    },
    {
      "timestamp": [
        533.32,
        535.3
      ],
      "text": " Selamat datang di masyarakat baru Nah, itu aja konten kali ini. Semoga bermanfaat. Sampai jumpa di konten selanjutnya. See ya."
    },
    {
      "timestamp": [
        536.84,
        null
      ],
      "text": " Selamat datang di Masyarakat Baru, teman-teman."
    }
  ]
}